README.org
#+title: Lilac
#+SETUPFILE: lilac.theme

# Set default header argument for all source code blocks. The "no-export" means
# that we do not expand noweb references when exporting (weaving) --- the fact
# that this is not the default option is odd.
#+PROPERTY: header-args :noweb no-export

# Number the top 5 levels of headings; since h1 is the title, this means headings
# up to 5 numbers --- e.g., "1.2.3.4.5".
#+OPTIONS: H:5

#+BIBLIOGRAPHY: ./citations.bib

* Introduction

/Lilac/ is an addon for Emacs Org mode to make [[https://en.wikipedia.org/wiki/Literate_programming][Literate Programming]] (LP) using
Noweb-style [cite:@ramsey_1994] references easy. It comes in two parts:

1. =lilac.el=: to be loaded and used when /weaving/ [cite:@knuth_1984 98] and
   /tangling/ [cite:@knuth_1984 98] from your own Org mode files (which use
   Noweb references), and
2. =lilac.theme=: to be sourced by your Org mode files to use Lilac's customized
   HTML export.

This document itself reuses the =lilac.theme= file, which gives you a preview
(if you are viewing the HTML output) of what weaving with Lilac looks like.

* Motivation

Lilac was created mainly because the existing Org mode features around Noweb
references were lacking in features. There seems to have been a great deal of
effort to make /tangling/ (extracting source code from source code blocks) work
well, but not much has been done around /weaving/, where I think most of the
difficulties lie (because making output look good to a human (weaving) is much
more difficult than making output look good to a computer (tangling)).

** Problems with Org mode

By default, source code blocks do not get any captions in the HTML output. This
is a problem for LP because you have to manually explain the name of each block
to keep track of their usage in other blocks (when referring to them with Noweb
style references). This gets repetitive rather quickly.

While Org mode allows source code blocks to refer to other blocks (Noweb
references), it does not do any kind of linking. So you can write blocks like

#+begin_src org
,#+name: example-parent-block
,#+begin_src bash
echo "Hello from the parent block"
<<some-other-block>>
,#+end_src

...

,#+name: some-child-block
,#+begin_src bash
echo "I am child 1"
,#+end_src
#+end_src

but when this is exported to HTML neither =example-parent-block= nor
=some-child-block= have any links to each other. This is frustrating because it
makes navigating between them difficult.

Org mode does not create link anchors for headings, which makes referring to
them from other external documents slightly annoying. Org mode does not add link
anchors to source code blocks.

Org mode generates random link ID's on every export. That is, even if you change
nothing in your Org mode file, if you export to HTML there *will* be a diff
because all of the linked objects will get a new link ID.

** Lilac to the rescue

Lilac addresses all of the issues presented above.

Lilac frees you from having to write
a custom =#+caption: ...= text for every source code block, because it generates
them automatically based on the name of the Noweb reference. And Lilac
automatically links child blocks and parent blocks together. Lilac automatically
adds link anchors to all source code blocks as well as headlines, making it
easier to link to different parts of an Org file while browsing it.

Lilac makes HTML generation deterministic. This makes it VCS and CI-friendly
because the output changes if and only if the input changes. Speaking of
CI-friendliness, Lilac was designed to be run from outside of Emacs by default
(and not interactively).

* Usage

First create an Org mode file that uses LP. Then either clone this repo or add
it as a submodule to your project. The point is to get the =lilac.el= (and its
dependencies, themselves submodules) and =lilac.theme= (and associated
CSS/JavaScript files) available locally. Then for the Org mode file you are
using, you can load =lilac.el= and run =(lilac-publish)= to generate the HTML
file, or run =(org-babel-tangle)= to generate the source code from it. See the
=Makefile= that this project uses as a reference.

The main thing that you need to keep in mind when writing Org mode files for
consumption by Lilac is that the source code blocks must use Noweb references
using =__NREF__= as a prefix. See the discussion below.

