README.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lilac</title>
<meta name="author" content="Linus Arver" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="syntax-highlighting.css"/>
<link rel="stylesheet" type="text/css" href="style.css" />
<link rel="stylesheet" href="https://fonts.googleapis.com/css2?family=Source+Serif+Pro&family=Source+Code+Pro">
</head>
<body>
<div id="content" class="content">
<h1 class="title">Lilac</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#h-Introduction">1. Introduction</a></li>
<li><a href="#h-Motivation">2. Motivation</a>
<ul>
<li><a href="#h-Problems-with-Org-mode">2.1. Problems with Org mode</a></li>
<li><a href="#h-Lilac-to-the-rescue">2.2. Lilac to the rescue</a></li>
</ul>
</li>
<li><a href="#h-Usage">3. Usage</a>
<ul>
<li><a href="#h-Source-code-blocks--monoblocks-and-polyblocks">3.1. Source code blocks: monoblocks and polyblocks</a>
<ul>
<li><a href="#h-Examples-of-source-code-blocks">3.1.1. Examples of source code blocks</a>
<ul>
<li><a href="#h-Multi-parent-child-blocks">3.1.1.1. Multi-parent child blocks</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li><a href="#h-How-Lilac-uses-LP">4. How Lilac uses LP</a></li>
<li><a href="#h-Weaving--generating-the-HTML">5. Weaving (generating the HTML)</a>
<ul>
<li><a href="#h-Makefile">5.1. Makefile</a></li>
<li><a href="#h-Emacs-customizations-for-HTML-export---lilac-el-">5.2. Emacs customizations for HTML export (<code>lilac.el</code>)</a></li>
<li><a href="#h-Fix-non-determinism">5.3. Fix non-determinism</a>
<ul>
<li><a href="#h-Do-not-insert-current-time-as-HTML-comment">5.3.1. Do not insert current time as HTML comment</a></li>
<li><a href="#h-Do-not-insert-current-Org-mode-version">5.3.2. Do not insert current Org mode version</a></li>
<li><a href="#h-Do-not-use-random-numbers-for-the-HTML---id---attribute">5.3.3. Do not use random numbers for the HTML "<code>id</code>" attribute</a></li>
</ul>
</li>
<li><a href="#h-Toplevel-publishing-function---lilac-publish-">5.4. Toplevel publishing function (<code>lilac-publish</code>)</a>
<ul>
<li><a href="#h-Modify-the-Org-buffer">5.4.1. Modify the Org buffer</a></li>
<li><a href="#h-Modify-the-HTML">5.4.2. Modify the HTML</a></li>
<li><a href="#h-Miscellaneous-export-settings">5.4.3. Miscellaneous export settings</a></li>
</ul>
</li>
<li><a href="#h-Org-modifications">5.5. Org modifications</a>
<ul>
<li><a href="#h-Give-all-source-code-blocks-a----name-------field--HTML-ID">5.5.1. Give all source code blocks a <code>#+name: ...</code> field (HTML ID)</a></li>
<li><a href="#h-Automatic-captions-for-Noweb-source-code-blocks">5.5.2. Automatic captions for Noweb source code blocks</a></li>
<li><a href="#h-Human-readable-UIDs--Headings--aka-headlines">5.5.3. Human-readable UIDs (Headings, aka headlines)</a></li>
</ul>
</li>
<li><a href="#h-HTML-modifications">5.6. HTML modifications</a>
<ul>
<li><a href="#h-Use-human-readable-HTML-IDs-for-source-code-links">5.6.1. Use human-readable HTML IDs for source code links</a></li>
<li><a href="#h-Pretty-source-code-captions">5.6.2. Pretty source code captions</a></li>
<li><a href="#h-Link-noweb-references--link-to-child-block-from-parent-block">5.6.3. Link noweb references (link to child block from parent block)</a></li>
<li><a href="#h-Custom-Noweb-delimiters">5.6.4. Custom Noweb delimiters</a></li>
</ul>
</li>
<li><a href="#h-Autogenerate-CSS-for-syntax-highlighting-of-source-code-blocks">5.7. Autogenerate CSS for syntax highlighting of source code blocks</a></li>
<li><a href="#h-Misc-settings">5.8. Misc settings</a>
<ul>
<li><a href="#h-Use-HTML5-export--not-XML--to-un-break-MathJax">5.8.1. Use HTML5 export, not XML (to un-break MathJax)</a></li>
<li><a href="#h-Preserve-leading-whitespace-characters-on-export">5.8.2. Preserve leading whitespace characters on export</a></li>
<li><a href="#h-Disable-backups">5.8.3. Disable backups</a></li>
<li><a href="#h-Profiling">5.8.4. Profiling</a></li>
</ul>
</li>
<li><a href="#h-Automatically-link-headlines--h2-to-h6">5.9. Automatically link headlines (h2 to h6)</a></li>
<li><a href="#h-Imports">5.10. Imports</a></li>
<li><a href="#h-Additional--hand-tweaked--CSS">5.11. Additional (hand-tweaked) CSS</a>
<ul>
<li><a href="#h-Source-code-block-body">5.11.1. Source code block body</a></li>
<li><a href="#h-Source-code-block-captions">5.11.2. Source code block captions</a></li>
<li><a href="#h-Links-to-child-source-block-from-parent">5.11.3. Links to child source block from parent</a></li>
</ul>
</li>
<li><a href="#h-Create--lilac-theme--file">5.12. Create <code>lilac.theme</code> file</a></li>
<li><a href="#h-Ignore-woven-HTML-from--git-diff">5.13. Ignore woven HTML from <code>git diff</code></a>
<ul>
<li><a href="#h-git-add--p">5.13.1. <code>git add -p</code></a></li>
</ul>
</li>
<li><a href="#h-gitignore">5.14. gitignore</a></li>
</ul>
</li>
<li><a href="#h-Tangling--generating-the-source-code">6. Tangling (generating the source code)</a></li>
<li><a href="#h-Development-environment--Nix-shell">7. Development environment (Nix shell)</a></li>
<li><a href="#h-Tests">8. Tests</a>
<ul>
<li><a href="#h-Test-helpers">8.1. Test helpers</a></li>
<li><a href="#h-Smart-source-code-block-caption-helpers">8.2. Smart source code block caption helpers</a></li>
</ul>
</li>
<li><a href="#h-Glossary">9. Glossary</a></li>
<li><a href="#h-References">10. References</a></li>
</ul>
</div>
</div>

<div id="outline-container-h-Introduction" class="outline-2">
<h2 id="h-Introduction"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-h-Introduction">
<p>
<i>Lilac</i> is an addon for Emacs Org mode to make <a href="https://en.wikipedia.org/wiki/Literate_programming">Literate Programming</a> (LP) using
Noweb-style <a href="#citeproc_bib_item_1">[1]</a> references easy. It comes in two parts:
</p>

<ol class="org-ol">
<li><code>lilac.el</code>: to be loaded and used when <i>weaving</i> <a href="#citeproc_bib_item_2">[2, p. 98]</a> and
<i>tangling</i> <a href="#citeproc_bib_item_2">[2, p. 98]</a> from your own Org mode files (which use
Noweb references), and</li>
<li><code>lilac.theme</code>: to be sourced by your Org mode files to use Lilac's customized
HTML export.</li>
</ol>

<p>
This document itself reuses the <code>lilac.theme</code> file, which gives you a preview
(if you are viewing the HTML output) of what weaving with Lilac looks like.
</p>
</div>
</div>

<div id="outline-container-h-Motivation" class="outline-2">
<h2 id="h-Motivation"><span class="section-number-2">2.</span> Motivation</h2>
<div class="outline-text-2" id="text-h-Motivation">
<p>
Lilac was created mainly because the existing Org mode features around Noweb
references were lacking in features. There seems to have been a great deal of
effort to make <i>tangling</i> (extracting source code from source code blocks) work
well, but not much has been done around <i>weaving</i>, where I think most of the
difficulties lie (because making output look good to a human (weaving) is much
more difficult than making output look good to a computer (tangling)).
</p>
</div>

<div id="outline-container-h-Problems-with-Org-mode" class="outline-3">
<h3 id="h-Problems-with-Org-mode"><span class="section-number-3">2.1.</span> Problems with Org mode</h3>
<div class="outline-text-3" id="text-h-Problems-with-Org-mode">
<p>
By default, source code blocks do not get any captions in the HTML output. This
is a problem for LP because you have to manually explain the name of each block
to keep track of their usage in other blocks (when referring to them with Noweb
style references). This gets repetitive rather quickly.
</p>

<p>
While Org mode allows source code blocks to refer to other blocks (Noweb
references), it does not do any kind of linking. So you can write blocks like
</p>

<div class="org-src-container"><pre class="src src-org" id="org0000000"><span class="org-org-meta-line">#+name: example-parent-block</span>
<span class="org-org-block-begin-line">#+begin_src bash</span>
<span class="org-org-block"><span class="org-builtin">echo</span></span><span class="org-org-block"> </span><span class="org-org-block"><span class="org-string">"Hello from the parent block"</span></span>
<span class="org-org-block">&lt;&lt;some-other-block&gt;&gt;</span>
<span class="org-org-block-end-line">#+end_src</span>

...

<span class="org-org-meta-line">#+name: some-child-block</span>
<span class="org-org-block-begin-line">#+begin_src bash</span>
<span class="org-org-block"><span class="org-builtin">echo</span></span><span class="org-org-block"> </span><span class="org-org-block"><span class="org-string">"I am child 1"</span></span>
<span class="org-org-block-end-line">#+end_src</span>
</pre></div><p>
but when this is exported to HTML neither <code>example-parent-block</code> nor
<code>some-child-block</code> have any links to each other. This is frustrating because it
makes navigating between them difficult.
</p>

<p>
Org mode does not create link anchors for headings, which makes referring to
them from other external documents slightly annoying. Org mode does not add link
anchors to source code blocks.
</p>

<p>
Org mode generates random link ID's on every export. That is, even if you change
nothing in your Org mode file, if you export to HTML there <b>will</b> be a diff
because all of the linked objects will get a new link ID.
</p>
</div>
</div>

<div id="outline-container-h-Lilac-to-the-rescue" class="outline-3">
<h3 id="h-Lilac-to-the-rescue"><span class="section-number-3">2.2.</span> Lilac to the rescue</h3>
<div class="outline-text-3" id="text-h-Lilac-to-the-rescue">
<p>
Lilac addresses all of the issues presented above.
</p>

<p>
Lilac frees you from having to write
a custom <code>#+caption: ...</code> text for every source code block, because it generates
them automatically based on the name of the Noweb reference. And Lilac
automatically links child blocks and parent blocks together. Lilac automatically
adds link anchors to all source code blocks as well as headlines, making it
easier to link to different parts of an Org file while browsing it.
</p>

<p>
Lilac makes HTML generation deterministic. This makes it VCS and CI-friendly
because the output changes if and only if the input changes. Speaking of
CI-friendliness, Lilac was designed to be run from outside of Emacs by default
(and not interactively).
</p>
</div>
</div>
</div>

<div id="outline-container-h-Usage" class="outline-2">
<h2 id="h-Usage"><span class="section-number-2">3.</span> Usage</h2>
<div class="outline-text-2" id="text-h-Usage">
<p>
First create an Org mode file that uses LP. Then either clone this repo or add
it as a submodule to your project. The point is to get the <code>lilac.el</code> (and its
dependencies, themselves submodules) and <code>lilac.theme</code> (and associated
CSS/JavaScript files) available locally. Then for the Org mode file you are
using, you can load <code>lilac.el</code> and run <code>(lilac-publish)</code> to generate the HTML
file, or run <code>(org-babel-tangle)</code> to generate the source code from it. See the
<code>Makefile</code> that this project uses as a reference.
</p>

<p>
The main thing that you need to keep in mind when writing Org mode files for
consumption by Lilac is that the source code blocks must use Noweb references
using <code>__NREF__</code> as a prefix. See the discussion below.
</p>
</div>
