README.org
** Source code blocks: monoblocks and polyblocks

In Org mode, Noweb-style references by default must be enclosed in double angle
brackets =<<= and =>>=. While this works, it's problematic because it can mean
different things syntactically based on the source code language. Your source
code block's language might think that the angle brackets are operators or
keywords and colorize them differently, for example.

Instead, Lilac expects Noweb-style references in the form =__NREF__foo= (where
the "NREF" stands for "Noweb reference"). Then you are free to name your child
block with this same =__NREF__foo= name. This is better because now you can
search for this word =__NREF__foo= in your raw Org mode document and you'll
instantly be able to see where it is used. Contrast this with the default Org
mode behavior where you'll have to search for =<<foo>>= and =foo= separately
(because searching for just =foo= may collide with other names that are not
source code block names).

In the example below, the =parent-block= refers to 2 other child blocks for its
definition.

#+begin_comment
The =,#+name: ...=, =,#+begin_src ...= and =,#+end_src= in the =org= source
blocks have a leading comma but this comma is only for Org's own parser to
disambiguate against actual source code blocks in this file. The leading comma
is stripped during HTML export.
#+end_comment

#+caption: Sample Org-mode Noweb-style references
#+begin_src org
,#+name: parent-block
,#+begin_src bash
echo "Hello from the parent block"
__NREF__child-block-1
__NREF__child-block-2
,#+end_src

...

,#+name: __NREF__child-block-1
,#+begin_src bash
echo "I am child 1"
,#+end_src

...

,#+header: :noweb-ref __NREF__child-block-2
,#+begin_src bash
echo -n "I am "
,#+end_src

,#+header: :noweb-ref __NREF__child-block-2
,#+begin_src bash
echo "child 2"
,#+end_src
#+end_src

This example illustrates the two ways to define a child block: either as a
single code block with =#+name: __NREF__foo=, or as multiple blocks with
=#+header: :noweb-ref __NREF__foo=. Lilac calls them [[monoblock][monoblocks]] and [[polyblock][polyblocks]]
respectively. Polyblocks are concatenated together in the order they appear in
the overall Org file; this final concatenated version is what gets inserted into
the Noweb reference in the parent block.

*** Examples of source code blocks

Below is an example of the usage described above. Notice how the child blocks
referenced in the parent block are linked to their definitions.

#+name: example-parent-block
#+caption: example-parent-block
#+begin_src bash
echo "Hello from the parent block"
__NREF__example-child-block-foo
echo ""
__NREF__example-child-block-bar
#+end_src

Below are the child blocks. The first is a monoblock. Every child block's name
links back up to the parent block where it is referenced.

#+name: __NREF__example-child-block-foo
#+begin_src bash
echo "I am child 1"
#+end_src

The blocks below are polyblocks.

#+header: :noweb-ref __NREF__example-child-block-bar
#+begin_src bash
echo -n "I am "
#+end_src

Note the fraction after the name which denotes the position of the block in the
overall polyblock "chain".

#+header: :noweb-ref __NREF__example-child-block-bar
#+begin_src bash
echo "child 2"
#+end_src

**** Multi-parent child blocks

Sometimes a piece of code will be reused in different source code blocks. You
can think of it as constants in a programming language, but in LP the concept
extends to any arbitrary piece of text.

Below is an example where we define a child block once...

#+name: __NREF__example-child-block-baz
#+begin_src bash
echo "Hello from child block baz"
#+end_src

...but where we also reuse it (reference it) in different parent blocks.

#+name: example-parent-1
#+caption: example-parent-1
#+begin_src bash
echo "Hello from parent 1"
__NREF__example-child-block-baz
#+end_src

#+name: example-parent-2
#+caption: example-parent-2
#+begin_src bash
echo "Hello from parent 2"
__NREF__example-child-block-baz
#+end_src

Notice that the child block has an additional link named "2", which points to
the second parent that references this block (the first parent is linked by the
child block name itself, as in the previous example). If it is referenced in
additional parent blocks, they will show up as links "3", "4", etc.

* How Lilac uses LP

All source code is generated by /tangling/ this Org file (=README.org=). This
file is the single source of truth for basically everything. Some other things
like COPYRIGHT and LICENSE do not come from this file, but they are exceptions.

Tangling is done by loading this file into Emacs and then running
=(org-babel-tangle)=. This file is also the source of truth for the /woven/
HTML documentation (=README.html=), and similarly the HTML is generated by
invoking =(lilac-publish)=. The outputs of both tangling and weaving are checked
into version control.

The =Makefile= in this repo is used as the main "driver" for both tangling and
weaving.

