README.html

<div id="outline-container-h-Source-code-blocks--monoblocks-and-polyblocks" class="outline-3">
<h3 id="h-Source-code-blocks--monoblocks-and-polyblocks"><span class="section-number-3">3.1.</span> Source code blocks: monoblocks and polyblocks</h3>
<div class="outline-text-3" id="text-h-Source-code-blocks--monoblocks-and-polyblocks">
<p>
In Org mode, Noweb-style references by default must be enclosed in double angle
brackets <code>&lt;&lt;</code> and <code>&gt;&gt;</code>. While this works, it's problematic because it can mean
different things syntactically based on the source code language. Your source
code block's language might think that the angle brackets are operators or
keywords and colorize them differently, for example.
</p>

<p>
Instead, Lilac expects Noweb-style references in the form <code>__NREF__foo</code> (where
the "NREF" stands for "Noweb reference"). Then you are free to name your child
block with this same <code>__NREF__foo</code> name. This is better because now you can
search for this word <code>__NREF__foo</code> in your raw Org mode document and you'll
instantly be able to see where it is used. Contrast this with the default Org
mode behavior where you'll have to search for <code>&lt;&lt;foo&gt;&gt;</code> and <code>foo</code> separately
(because searching for just <code>foo</code> may collide with other names that are not
source code block names).
</p>

<p>
In the example below, the <code>parent-block</code> refers to 2 other child blocks for its
definition.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><label class="org-src-name">Sample Org-mode Noweb-style references</label><span class="lilac-caption-link-symbol"><a href="#Sample-Org-mode-Noweb-style-references-1">&#x1f517;</a></span></div><pre class="src src-org" id="Sample-Org-mode-Noweb-style-references-1"><span class="org-org-meta-line">#+name: parent-block</span>
<span class="org-org-block-begin-line">#+begin_src bash</span>
<span class="org-org-block"><span class="org-builtin">echo</span></span><span class="org-org-block"> </span><span class="org-org-block"><span class="org-string">"Hello from the parent block"</span></span>
<span class="org-org-block">__NREF__child-block-1</span>
<span class="org-org-block">__NREF__child-block-2</span>
<span class="org-org-block-end-line">#+end_src</span>

...

<span class="org-org-meta-line">#+name: __NREF__child-block-1</span>
<span class="org-org-block-begin-line">#+begin_src bash</span>
<span class="org-org-block"><span class="org-builtin">echo</span></span><span class="org-org-block"> </span><span class="org-org-block"><span class="org-string">"I am child 1"</span></span>
<span class="org-org-block-end-line">#+end_src</span>

...

<span class="org-org-meta-line">#+header: :noweb-ref __NREF__child-block-2</span>
<span class="org-org-block-begin-line">#+begin_src bash</span>
<span class="org-org-block"><span class="org-builtin">echo</span></span><span class="org-org-block"> -n </span><span class="org-org-block"><span class="org-string">"I am "</span></span>
<span class="org-org-block-end-line">#+end_src</span>

<span class="org-org-meta-line">#+header: :noweb-ref __NREF__child-block-2</span>
<span class="org-org-block-begin-line">#+begin_src bash</span>
<span class="org-org-block"><span class="org-builtin">echo</span></span><span class="org-org-block"> </span><span class="org-org-block"><span class="org-string">"child 2"</span></span>
<span class="org-org-block-end-line">#+end_src</span>
</pre></div></div><p>
This example illustrates the two ways to define a child block: either as a
single code block with <code>#+name: __NREF__foo</code>, or as multiple blocks with
<code>#+header: :noweb-ref __NREF__foo</code>. Lilac calls them <a href="#org0000004">monoblocks</a> and <a href="#org0000006">polyblocks</a>
respectively. Polyblocks are concatenated together in the order they appear in
the overall Org file; this final concatenated version is what gets inserted into
the Noweb reference in the parent block.
</p>
</div>

<div id="outline-container-h-Examples-of-source-code-blocks" class="outline-4">
<h4 id="h-Examples-of-source-code-blocks"><span class="section-number-4">3.1.1.</span> Examples of source code blocks</h4>
<div class="outline-text-4" id="text-h-Examples-of-source-code-blocks">
<p>
Below is an example of the usage described above. Notice how the child blocks
referenced in the parent block are linked to their definitions.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><label class="org-src-name">example-parent-block</label><span class="lilac-caption-link-symbol"><a href="#example-parent-block">&#x1f517;</a></span></div><pre class="src src-bash" id="example-parent-block"><span class="org-builtin">echo</span> <span class="org-string">"Hello from the parent block"</span>
<span class="lilac-child-link-from-parent"><a href="#__NREF__example-child-block-foo">example-child-block-foo</a></span>
<span class="org-builtin">echo</span> <span class="org-string">""</span>
<span class="lilac-child-link-from-parent"><a href="#__NREF__example-child-block-bar-1">example-child-block-bar</a></span>
</pre></div></div><p>
Below are the child blocks. The first is a monoblock. Every child block's name
links back up to the parent block where it is referenced.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#example-parent-block">example-child-block-foo</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__example-child-block-foo">&#x1f517;</a></span></div><pre class="src src-bash" id="__NREF__example-child-block-foo"><span class="org-builtin">echo</span> <span class="org-string">"I am child 1"</span>
</pre></div></div><p>
The blocks below are polyblocks.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#example-parent-block">example-child-block-bar</a></span>(1/2) <span class="lilac-caption-link-symbol"><a href="#__NREF__example-child-block-bar-1">&#x1f517;</a></span></div><pre class="src src-bash" id="__NREF__example-child-block-bar-1"><span class="org-builtin">echo</span> -n <span class="org-string">"I am "</span>
</pre></div></div><p>
Note the fraction after the name which denotes the position of the block in the
overall polyblock "chain".
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#example-parent-block">example-child-block-bar</a></span>(2/2) <span class="lilac-caption-link-symbol"><a href="#__NREF__example-child-block-bar-2">&#x1f517;</a></span></div><pre class="src src-bash" id="__NREF__example-child-block-bar-2"><span class="org-builtin">echo</span> <span class="org-string">"child 2"</span>
</pre></div></div>
</div>

<div id="outline-container-h-Multi-parent-child-blocks" class="outline-5">
<h5 id="h-Multi-parent-child-blocks"><span class="section-number-5">3.1.1.1.</span> Multi-parent child blocks</h5>
<div class="outline-text-5" id="text-h-Multi-parent-child-blocks">
<p>
Sometimes a piece of code will be reused in different source code blocks. You
can think of it as constants in a programming language, but in LP the concept
extends to any arbitrary piece of text.
</p>

<p>
Below is an example where we define a child block once&#x2026;
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#example-parent-1">example-child-block-baz</a></span><span class="lilac-caption-parent-link"><a href="#example-parent-2">2</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__example-child-block-baz">&#x1f517;</a></span></div><pre class="src src-bash" id="__NREF__example-child-block-baz"><span class="org-builtin">echo</span> <span class="org-string">"Hello from child block baz"</span>
</pre></div></div><p>
&#x2026;but where we also reuse it (reference it) in different parent blocks.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><label class="org-src-name">example-parent-1</label><span class="lilac-caption-link-symbol"><a href="#example-parent-1">&#x1f517;</a></span></div><pre class="src src-bash" id="example-parent-1"><span class="org-builtin">echo</span> <span class="org-string">"Hello from parent 1"</span>
<span class="lilac-child-link-from-parent"><a href="#__NREF__example-child-block-baz">example-child-block-baz</a></span>
</pre></div></div><div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><label class="org-src-name">example-parent-2</label><span class="lilac-caption-link-symbol"><a href="#example-parent-2">&#x1f517;</a></span></div><pre class="src src-bash" id="example-parent-2"><span class="org-builtin">echo</span> <span class="org-string">"Hello from parent 2"</span>
<span class="lilac-child-link-from-parent"><a href="#__NREF__example-child-block-baz">example-child-block-baz</a></span>
</pre></div></div><p>
Notice that the child block has an additional link named "2", which points to
the second parent that references this block (the first parent is linked by the
child block name itself, as in the previous example). If it is referenced in
additional parent blocks, they will show up as links "3", "4", etc.
</p>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-h-How-Lilac-uses-LP" class="outline-2">
<h2 id="h-How-Lilac-uses-LP"><span class="section-number-2">4.</span> How Lilac uses LP</h2>
<div class="outline-text-2" id="text-h-How-Lilac-uses-LP">
<p>
All source code is generated by <i>tangling</i> this Org file (<code>README.org</code>). This
file is the single source of truth for basically everything. Some other things
like COPYRIGHT and LICENSE do not come from this file, but they are exceptions.
</p>

<p>
Tangling is done by loading this file into Emacs and then running
<code>(org-babel-tangle)</code>. This file is also the source of truth for the <i>woven</i>
HTML documentation (<code>README.html</code>), and similarly the HTML is generated by
invoking <code>(lilac-publish)</code>. The outputs of both tangling and weaving are checked
into version control.
</p>

<p>
The <code>Makefile</code> in this repo is used as the main "driver" for both tangling and
weaving.
</p>
</div>
</div>
