README.org
* Weaving (generating the HTML)

Weaving is conceptually simpler than tangling because there is no extra step ---
the output is an HTML page and that is something that we can use directly
(unlike program source code, which may require additional compilation into a
binary, depending on the language). We limit ourselves to HTML output because
HTML support is ubiquitous; plus we don't have to worry about page breaks such
as in PDF output.

Although weaving is conceptually simple, most of the code in [[file:lilac.el][=lilac.el=]] have to
do with weaving because the default infrastructure that ships with Org mode is
too rigid for our needs. For example, we make heavy use of Noweb-style
[cite:@ramsey_1994] references, but also add in extensive HTML links to allow
the reader to jump around code easily because Org does not cross-link these
references by default.

Weaving currently requires the following dependencies:

| Dependency | Why                      |
|------------+--------------------------|
| [[https://www.gnu.org/software/make/][GNU Make]]   | to run "make"            |
| [[https://www.gnu.org/software/emacs/][GNU Emacs]]  | for tangling and weaving |

Note that all of the above can be brought in by using the [[https://github.com/NixOS/nix][Nix package manager]].
This is why we provide a [[file:shell.nix]] file in this repo.

** Makefile

We have a top-level =Makefile= so that we can run some =make= commands on the
command line. The overall idea is to tangle and weave, while also running any
associated tests.

#+name: Makefile
#+caption: Makefile
#+begin_src makefile :tangle Makefile :eval no
all: test weave
.PHONY: all

test: tangle
	emacs --quick --batch --kill --load ert \
		--load lilac.el \
		--load lilac-tests.el \
		--funcall ert-run-tests-batch-and-exit
.PHONY: test

__NREF__Makefile-weave
__NREF__Makefile-tangle
__NREF__Makefile-run_emacs
__NREF__Makefile-update-deps
#+end_src

Weaving just depends on the main =README.html= file being generated. Before we
call =(lilac-publish)=, we have to first call =(lilac-gen-css-and-exit
\"README.org\")= because otherwise the source code blocks do not get any syntax
highlighting. And lastly we have to modify the generated =README.html= file with
=sed= because we have to fix up some CSS classes that get inlined into the HTML.

#+name: __NREF__Makefile-weave
#+begin_src makefile
weave: README.html
.PHONY: weave

README.html: README.org
	$(call run_emacs,(lilac-gen-css-and-exit),README.org)
	$(call run_emacs,(lilac-publish),README.org)
	# Fix inline styles.
	sed -i 's/<style>.csl-left-margin{float: left; padding-right: 0em/'\
	'<style>.csl-left-margin{float: left; padding-right: 1em/' README.html
	sed -i 's/.csl-right-inline{margin: 0 0 0 1em;}<\/style>/'\
	'.csl-right-inline{margin: 0 0 0 2em;}<\/style>/' README.html
#+end_src

Tangling is pretty straightforward --- we just need to call
=(org-babel-tangle)= on =README.org=. This generates a number of files, such as
=Makefile= and =shell.nix=.

The key here is to enumerate these generated files, because we need to tell the
=make= utility that it should run the rule if =README.org= has a newer
modification timestamp than any of the generated files. Technically speaking,
because all of the tangled files are tangled together at once with
=(org-babel-tangle)=, we could just list one of them such as =Makefile= (instead
of enumerating all of them). However we still enumerate them all here for
completeness.

Lastly we make use of the fake file =tangle=, so that we can write the top-level
=test= rule as =test: tangle=, which reads more naturally than the equivalent
=test: Makefile= or =test: lilac.el=.

#+name: __NREF__Makefile-tangle
#+begin_src makefile
# tangled_output are all files that are generated by tangling README.org.
tangled_output = \
	citations.bib \
	lilac.el \
	lilac.theme \
	.gitattributes \
	.gitignore \
	Makefile \
	misc.js \
	shell.nix \
	style.css \
	syntax-highlighting.css

tangle $(tangled_output) &: README.org
	# Generate the toplevel Makefile (this file) and others as described in
	# tangled_output. In a way this bootstraps the whole literate-programming
	# pipeline.
	$(call run_emacs,(org-babel-tangle),README.org)
	touch tangle
#+end_src

The =run_emacs= function is used for both weaving and tangling. The main thing
of interest here is that it loads the =lilac.el= (tangled) file before
evaluating the given expression.

#+name: __NREF__Makefile-run_emacs
#+begin_src makefile
define run_emacs
	emacs $(2) --quick --batch --kill --load $(PROJ_ROOT)/lilac.el --eval="$(1)"
endef

PROJ_ROOT := $(shell git rev-parse --show-toplevel)
#+end_src

We use [[https://github.com/nmattia/niv][=niv=]] to update the dependencies sourced by =shell.nix=.

#+name: __NREF__Makefile-update-deps
#+begin_src makefile
update-deps: package/nix/sources.json package/nix/sources.nix
	cd package && niv update
	touch update-deps
#+end_src

