README.html

<div id="outline-container-h-Weaving--generating-the-HTML" class="outline-2">
<h2 id="h-Weaving--generating-the-HTML"><span class="section-number-2">5.</span> Weaving (generating the HTML)</h2>
<div class="outline-text-2" id="text-h-Weaving--generating-the-HTML">
<p>
Weaving is conceptually simpler than tangling because there is no extra step &#x2014;
the output is an HTML page and that is something that we can use directly
(unlike program source code, which may require additional compilation into a
binary, depending on the language). We limit ourselves to HTML output because
HTML support is ubiquitous; plus we don't have to worry about page breaks such
as in PDF output.
</p>

<p>
Although weaving is conceptually simple, most of the code in <a href="lilac.el"><code>lilac.el</code></a> have to
do with weaving because the default infrastructure that ships with Org mode is
too rigid for our needs. For example, we make heavy use of Noweb-style
<a href="#citeproc_bib_item_1">[1]</a> references, but also add in extensive HTML links to allow
the reader to jump around code easily because Org does not cross-link these
references by default.
</p>

<p>
Weaving currently requires the following dependencies:
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Dependency</th>
<th scope="col" class="org-left">Why</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><a href="https://www.gnu.org/software/make/">GNU Make</a></td>
<td class="org-left">to run "make"</td>
</tr>

<tr>
<td class="org-left"><a href="https://www.gnu.org/software/emacs/">GNU Emacs</a></td>
<td class="org-left">for tangling and weaving</td>
</tr>
</tbody>
</table>

<p>
Note that all of the above can be brought in by using the <a href="https://github.com/NixOS/nix">Nix package manager</a>.
This is why we provide a <a href="shell.nix">shell.nix</a> file in this repo.
</p>
</div>

<div id="outline-container-h-Makefile" class="outline-3">
<h3 id="h-Makefile"><span class="section-number-3">5.1.</span> Makefile</h3>
<div class="outline-text-3" id="text-h-Makefile">
<p>
We have a top-level <code>Makefile</code> so that we can run some <code>make</code> commands on the
command line. The overall idea is to tangle and weave, while also running any
associated tests.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><label class="org-src-name">Makefile</label><span class="lilac-caption-link-symbol"><a href="#Makefile">&#x1f517;</a></span></div><pre class="src src-makefile" id="Makefile"><span class="org-makefile-targets">all</span>: test weave
<span class="org-makefile-targets">.PHONY</span>: all

<span class="org-makefile-targets">test</span>: tangle
        emacs --quick --batch --kill --load ert \
                --load lilac.el \
                --load lilac-tests.el \
                --funcall ert-run-tests-batch-and-exit
<span class="org-makefile-targets">.PHONY</span>: test

<span class="lilac-child-link-from-parent"><a href="#__NREF__Makefile-weave">Makefile-weave</a></span>
<span class="lilac-child-link-from-parent"><a href="#__NREF__Makefile-tangle">Makefile-tangle</a></span>
<span class="lilac-child-link-from-parent"><a href="#__NREF__Makefile-run_emacs">Makefile-run_emacs</a></span>
<span class="lilac-child-link-from-parent"><a href="#__NREF__Makefile-update-deps">Makefile-update-deps</a></span>
</pre></div></div><p>
Weaving just depends on the main <code>README.html</code> file being generated. Before we
call <code>(lilac-publish)</code>, we have to first call <code>(lilac-gen-css-and-exit
\"README.org\")</code> because otherwise the source code blocks do not get any syntax
highlighting. And lastly we have to modify the generated <code>README.html</code> file with
<code>sed</code> because we have to fix up some CSS classes that get inlined into the HTML.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#Makefile">Makefile-weave</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__Makefile-weave">&#x1f517;</a></span></div><pre class="src src-makefile" id="__NREF__Makefile-weave"><span class="org-makefile-targets">weave</span>: README.html
<span class="org-makefile-targets">.PHONY</span>: weave

<span class="org-makefile-targets">README.html</span>: README.org
        $(<span class="org-variable-name">call</span> run_emacs,(lilac-gen-css-and-exit),README.org)
        $(<span class="org-variable-name">call</span> run_emacs,(lilac-publish),README.org)
<span class="org-makefile-space">        #</span><span class="org-comment-delimiter"> </span><span class="org-comment">Fix inline styles.</span>
        sed -i <span class="org-string">'s/&lt;style&gt;.csl-left-margin{float: left; padding-right: 0em/'</span>\
        <span class="org-string">'&lt;style&gt;.csl-left-margin{float: left; padding-right: 1em/'</span> README.html
        sed -i <span class="org-string">'s/.csl-right-inline{margin: 0 0 0 1em;}&lt;\/style&gt;/'</span>\
        <span class="org-string">'.csl-right-inline{margin: 0 0 0 2em;}&lt;\/style&gt;/'</span> README.html
</pre></div></div><p>
Tangling is pretty straightforward &#x2014; we just need to call
<code>(org-babel-tangle)</code> on <code>README.org</code>. This generates a number of files, such as
<code>Makefile</code> and <code>shell.nix</code>.
</p>

<p>
The key here is to enumerate these generated files, because we need to tell the
<code>make</code> utility that it should run the rule if <code>README.org</code> has a newer
modification timestamp than any of the generated files. Technically speaking,
because all of the tangled files are tangled together at once with
<code>(org-babel-tangle)</code>, we could just list one of them such as <code>Makefile</code> (instead
of enumerating all of them). However we still enumerate them all here for
completeness.
</p>

<p>
Lastly we make use of the fake file <code>tangle</code>, so that we can write the top-level
<code>test</code> rule as <code>test: tangle</code>, which reads more naturally than the equivalent
<code>test: Makefile</code> or <code>test: lilac.el</code>.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#Makefile">Makefile-tangle</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__Makefile-tangle">&#x1f517;</a></span></div><pre class="src src-makefile" id="__NREF__Makefile-tangle"><span class="org-comment-delimiter"># </span><span class="org-comment">tangled_output are all files that are generated by tangling README.org.</span>
<span class="org-variable-name">tangled_output</span> = \
        citations.bib \
        lilac.el \
        lilac.theme \
        .gitattributes \
        .gitignore \
        Makefile \
        misc.js \
        shell.nix \
        style.css \
        syntax-highlighting.css

<span class="org-makefile-targets">tangle $(</span><span class="org-variable-name"><span class="org-makefile-targets">tangled_output</span></span><span class="org-makefile-targets">) &amp;</span>: README.org
<span class="org-makefile-space">        #</span><span class="org-comment-delimiter"> </span><span class="org-comment">Generate the toplevel Makefile (this file) and others as described in</span>
<span class="org-makefile-space">        #</span><span class="org-comment-delimiter"> </span><span class="org-comment">tangled_output. In a way this bootstraps the whole literate-programming</span>
<span class="org-makefile-space">        #</span><span class="org-comment-delimiter"> </span><span class="org-comment">pipeline.</span>
        $(<span class="org-variable-name">call</span> run_emacs,(org-babel-tangle),README.org)
        touch tangle
</pre></div></div><p>
The <code>run_emacs</code> function is used for both weaving and tangling. The main thing
of interest here is that it loads the <code>lilac.el</code> (tangled) file before
evaluating the given expression.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#Makefile">Makefile-run_emacs</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__Makefile-run_emacs">&#x1f517;</a></span></div><pre class="src src-makefile" id="__NREF__Makefile-run_emacs">define run_emacs
        emacs $(<span class="org-variable-name">2</span>) --quick --batch --kill --load $(<span class="org-variable-name">PROJ_ROOT</span>)/lilac.el --eval=<span class="org-string">"$(</span><span class="org-string"><span class="org-variable-name">1</span></span><span class="org-string">)"</span>
endef

<span class="org-variable-name">PROJ_ROOT</span> := $(<span class="org-variable-name">shell</span> git rev-parse --show-toplevel)
</pre></div></div><p>
We use <a href="https://github.com/nmattia/niv"><code>niv</code></a> to update the dependencies sourced by <code>shell.nix</code>.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#Makefile">Makefile-update-deps</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__Makefile-update-deps">&#x1f517;</a></span></div><pre class="src src-makefile" id="__NREF__Makefile-update-deps"><span class="org-makefile-targets">update-deps</span>: package/nix/sources.json package/nix/sources.nix
        cd package &amp;&amp; niv update
        touch update-deps
</pre></div></div>
</div>
</div>
