README.org
** Emacs customizations for HTML export (=lilac.el=)

Below is the overall structure of =lilac.el=. The =gc-cons-threshold= setting is
to prevent =emacs= from entering garbage collection pauses, because we invoke
=emacs= from the command line in a fire-and-forget manner.

#+name: lilac.el
#+caption: lilac.el
#+begin_src emacs-lisp :tangle lilac.el :eval no
; Set garbage-collection threshold to 16 GiB.
(setq gc-cons-threshold #x400000000)
__NREF__lilac_dot_el-imports
__NREF__lilac_dot_el-fix-nondeterminism
__NREF__lilac_dot_el-autogenerate-css
__NREF__lilac_dot_el-lilac-publish
__NREF__lilac_dot_el-misc
(provide 'lilac)
#+end_src

** Fix non-determinism

Nondeterminism is problematic because it results in a different HTML file
every time we run =org-babel-tangle=, /even if the Org files have not changed/.
Here we take care to set things right so that we can have reprducible, stable
HTML output.

*** Do not insert current time as HTML comment

Org mode also injects an HTML comment (not visible to the user) to record the
time that the HTML was generated. We disable this because it breaks
deterministic output. See [[https://emacs.stackexchange.com/questions/50117/how-to-disable-commented-date-in-org-mode-html-export][this link]] for more info.

#+header: :noweb-ref __NREF__lilac_dot_el-fix-nondeterminism
#+begin_src emacs-lisp
(setq org-export-time-stamp-file nil)
#+end_src

*** Do not insert current Org mode version

By default Org mode appends visible metadata at the bottom of the HTML document,
including the Org version used to generate the document. We suppress this
information.

#+header: :noweb-ref __NREF__lilac_dot_el-fix-nondeterminism
#+begin_src emacs-lisp
(setq org-html-postamble nil)
#+end_src

*** Do not use random numbers for the HTML "=id=" attribute

Stop randomized IDs from being generated every time. Instead count from 0 and
work our way up.

See https://www.reddit.com/r/orgmode/comments/aagmfh/comment/hk6upbf.

#+header: :noweb-ref __NREF__lilac_dot_el-fix-nondeterminism
#+begin_src emacs-lisp
(defun org-export-deterministic-reference (references)
  (let ((new (length references)))
     (while (rassq new references) (setq new (+ new 1)))
     new))
(advice-add #'org-export-new-reference
            :override #'org-export-deterministic-reference)
#+end_src

** Toplevel publishing function (=lilac-publish=)

The toplevel function is =lilac-publish=. This actually publishes twice, with
=lilac-publish-1= and =lilac-publish-2=. The reason we publish twice is because
we need to examine the HTML output twice in order to build up a database of
parent/child source code block links (which is then used to link between these
parent/child source code blocks).

Also note that we do some modifications to the Org buffer directly before
exporting to HTML. The main reason is so that the source code blocks that are
named =__NREF__...= get an automatic =#+caption: ...= text to go along with it
(because for these Noweb-style blocks, the captions should always look uniform).

#+name: __NREF__lilac_dot_el-lilac-publish
#+begin_src emacs-lisp
(defun lilac-publish ()
  (interactive)
  (lilac-publish-1)
  (clrhash lilac-polyblock-names-totals)
  (lilac-publish-2))

(defun lilac-publish-1 ()
  (let (
        __NREF__lilac-publish-modify-org
        __NREF__lilac-publish-modify-HTML-1
        __NREF__lilac-publish-use-css)
    (org-html-export-to-html)))

(defun lilac-publish-2 ()
  (let (
        __NREF__lilac-publish-modify-org
        __NREF__lilac-publish-modify-HTML-2
        __NREF__lilac-publish-use-css)
    (org-html-export-to-html)))

;; Modify Org buffer
__NREF__UID-for-all-src-blocks
__NREF__smart-source-code-block-captions
__NREF__UID-for-all-headlines

;; Modify HTML
__NREF__lilac-link-to-child-blocks-from-parent
__NREF__lilac-prettify-source-code-captions
__NREF__lilac-human-readable-src-block-ids
#+end_src

