README.html

<div id="outline-container-h-Emacs-customizations-for-HTML-export---lilac-el-" class="outline-3">
<h3 id="h-Emacs-customizations-for-HTML-export---lilac-el-"><span class="section-number-3">5.2.</span> Emacs customizations for HTML export (<code>lilac.el</code>)</h3>
<div class="outline-text-3" id="text-h-Emacs-customizations-for-HTML-export---lilac-el-">
<p>
Below is the overall structure of <code>lilac.el</code>. The <code>gc-cons-threshold</code> setting is
to prevent <code>emacs</code> from entering garbage collection pauses, because we invoke
<code>emacs</code> from the command line in a fire-and-forget manner.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><label class="org-src-name">lilac.el</label><span class="lilac-caption-link-symbol"><a href="#lilac-el">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="lilac-el"><span class="org-comment-delimiter">; </span><span class="org-comment">Set garbage-collection threshold to 16 GiB.</span>
(<span class="org-keyword">setq</span> gc-cons-threshold #x400000000)
<span class="lilac-child-link-from-parent"><a href="#__NREF__lilac_dot_el-imports">lilac_dot_el-imports</a></span>
<span class="lilac-child-link-from-parent"><a href="#__NREF__lilac_dot_el-fix-nondeterminism-1">lilac_dot_el-fix-nondeterminism</a></span>
<span class="lilac-child-link-from-parent"><a href="#__NREF__lilac_dot_el-autogenerate-css">lilac_dot_el-autogenerate-css</a></span>
<span class="lilac-child-link-from-parent"><a href="#__NREF__lilac_dot_el-lilac-publish">lilac_dot_el-lilac-publish</a></span>
<span class="lilac-child-link-from-parent"><a href="#__NREF__lilac_dot_el-misc-1">lilac_dot_el-misc</a></span>
(<span class="org-keyword">provide</span> '<span class="org-constant">lilac</span>)
</pre></div></div>
</div>
</div>

<div id="outline-container-h-Fix-non-determinism" class="outline-3">
<h3 id="h-Fix-non-determinism"><span class="section-number-3">5.3.</span> Fix non-determinism</h3>
<div class="outline-text-3" id="text-h-Fix-non-determinism">
<p>
Nondeterminism is problematic because it results in a different HTML file
every time we run <code>org-babel-tangle</code>, <i>even if the Org files have not changed</i>.
Here we take care to set things right so that we can have reprducible, stable
HTML output.
</p>
</div>

<div id="outline-container-h-Do-not-insert-current-time-as-HTML-comment" class="outline-4">
<h4 id="h-Do-not-insert-current-time-as-HTML-comment"><span class="section-number-4">5.3.1.</span> Do not insert current time as HTML comment</h4>
<div class="outline-text-4" id="text-h-Do-not-insert-current-time-as-HTML-comment">
<p>
Org mode also injects an HTML comment (not visible to the user) to record the
time that the HTML was generated. We disable this because it breaks
deterministic output. See <a href="https://emacs.stackexchange.com/questions/50117/how-to-disable-commented-date-in-org-mode-html-export">this link</a> for more info.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#lilac-el">lilac_dot_el-fix-nondeterminism</a></span>(1/3) <span class="lilac-caption-link-symbol"><a href="#__NREF__lilac_dot_el-fix-nondeterminism-1">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__lilac_dot_el-fix-nondeterminism-1">(<span class="org-keyword">setq</span> org-export-time-stamp-file nil)
</pre></div></div>
</div>
</div>

<div id="outline-container-h-Do-not-insert-current-Org-mode-version" class="outline-4">
<h4 id="h-Do-not-insert-current-Org-mode-version"><span class="section-number-4">5.3.2.</span> Do not insert current Org mode version</h4>
<div class="outline-text-4" id="text-h-Do-not-insert-current-Org-mode-version">
<p>
By default Org mode appends visible metadata at the bottom of the HTML document,
including the Org version used to generate the document. We suppress this
information.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#lilac-el">lilac_dot_el-fix-nondeterminism</a></span>(2/3) <span class="lilac-caption-link-symbol"><a href="#__NREF__lilac_dot_el-fix-nondeterminism-2">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__lilac_dot_el-fix-nondeterminism-2">(<span class="org-keyword">setq</span> org-html-postamble nil)
</pre></div></div>
</div>
</div>

<div id="outline-container-h-Do-not-use-random-numbers-for-the-HTML---id---attribute" class="outline-4">
<h4 id="h-Do-not-use-random-numbers-for-the-HTML---id---attribute"><span class="section-number-4">5.3.3.</span> Do not use random numbers for the HTML "<code>id</code>" attribute</h4>
<div class="outline-text-4" id="text-h-Do-not-use-random-numbers-for-the-HTML---id---attribute">
<p>
Stop randomized IDs from being generated every time. Instead count from 0 and
work our way up.
</p>

<p>
See <a href="https://www.reddit.com/r/orgmode/comments/aagmfh/comment/hk6upbf">https://www.reddit.com/r/orgmode/comments/aagmfh/comment/hk6upbf</a>.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#lilac-el">lilac_dot_el-fix-nondeterminism</a></span>(3/3) <span class="lilac-caption-link-symbol"><a href="#__NREF__lilac_dot_el-fix-nondeterminism-3">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__lilac_dot_el-fix-nondeterminism-3">(<span class="org-keyword">defun</span> <span class="org-function-name">org-export-deterministic-reference</span> (references)
  (<span class="org-keyword">let</span> ((new (length references)))
     (<span class="org-keyword">while</span> (rassq new references) (<span class="org-keyword">setq</span> new (+ new 1)))
     new))
(advice-add #'org-export-new-reference
            <span class="org-builtin">:override</span> #'org-export-deterministic-reference)
</pre></div></div>
</div>
</div>
</div>

<div id="outline-container-h-Toplevel-publishing-function---lilac-publish-" class="outline-3">
<h3 id="h-Toplevel-publishing-function---lilac-publish-"><span class="section-number-3">5.4.</span> Toplevel publishing function (<code>lilac-publish</code>)</h3>
<div class="outline-text-3" id="text-h-Toplevel-publishing-function---lilac-publish-">
<p>
The toplevel function is <code>lilac-publish</code>. This actually publishes twice, with
<code>lilac-publish-1</code> and <code>lilac-publish-2</code>. The reason we publish twice is because
we need to examine the HTML output twice in order to build up a database of
parent/child source code block links (which is then used to link between these
parent/child source code blocks).
</p>

<p>
Also note that we do some modifications to the Org buffer directly before
exporting to HTML. The main reason is so that the source code blocks that are
named <code>__NREF__...</code> get an automatic <code>#+caption: ...</code> text to go along with it
(because for these Noweb-style blocks, the captions should always look uniform).
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#lilac-el">lilac_dot_el-lilac-publish</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__lilac_dot_el-lilac-publish">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__lilac_dot_el-lilac-publish">(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-publish</span> ()
  (<span class="org-keyword">interactive</span>)
  (lilac-publish-1)
  (clrhash lilac-polyblock-names-totals)
  (lilac-publish-2))

<span class="org-comment-delimiter">;; </span><span class="org-comment">This is here solely to populate the lilac-child-HTML_ID-hash-table.</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-publish-1</span> ()
  (<span class="org-keyword">let</span> (
        <span class="lilac-child-link-from-parent"><a href="#__NREF__lilac-publish-modify-org">lilac-publish-modify-org</a></span>
        <span class="lilac-child-link-from-parent"><a href="#__NREF__lilac-publish-modify-HTML-1">lilac-publish-modify-HTML-1</a></span>
        <span class="lilac-child-link-from-parent"><a href="#__NREF__lilac-publish-use-css">lilac-publish-use-css</a></span>)
    (org-html-export-to-html)))

(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-publish-2</span> ()
  (<span class="org-keyword">let</span> (
        <span class="lilac-child-link-from-parent"><a href="#__NREF__lilac-publish-modify-org">lilac-publish-modify-org</a></span>
        <span class="lilac-child-link-from-parent"><a href="#__NREF__lilac-publish-modify-HTML-2">lilac-publish-modify-HTML-2</a></span>
        <span class="lilac-child-link-from-parent"><a href="#__NREF__lilac-publish-use-css">lilac-publish-use-css</a></span>)
    (org-html-export-to-html)))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Modify Org buffer</span>
<span class="lilac-child-link-from-parent"><a href="#__NREF__smart-source-code-block-captions">smart-source-code-block-captions</a></span>
<span class="lilac-child-link-from-parent"><a href="#__NREF__UID-for-all-headlines">UID-for-all-headlines</a></span>
<span class="lilac-child-link-from-parent"><a href="#__NREF__UID-for-all-src-blocks">UID-for-all-src-blocks</a></span>

<span class="org-comment-delimiter">;; </span><span class="org-comment">Modify HTML</span>
<span class="lilac-child-link-from-parent"><a href="#__NREF__lilac-html-filter-src-blocks">lilac-html-filter-src-blocks</a></span>
<span class="lilac-child-link-from-parent"><a href="#__NREF__lilac-prettify-source-code-captions">lilac-prettify-source-code-captions</a></span>
<span class="lilac-child-link-from-parent"><a href="#__NREF__lilac-human-readable-src-block-ids">lilac-human-readable-src-block-ids</a></span>
</pre></div></div>
</div>
