README.org
*** Modify the Org buffer

Here we modify the Org mode buffer, by using =org-export-before-parsing-hook=.
This takes a list of functions that are free to modify the Org mode buffer
before each Org element in the buffer gets converted into HTML.

#+name: __NREF__lilac-publish-modify-org
#+begin_src emacs-lisp
(org-export-before-parsing-hook
 '(lilac-UID-for-all-src-blocks
   lilac-insert-noweb-source-code-block-captions
   lilac-UID-for-all-headlines))
#+end_src

As for the actual modifications, see:

- =lilac-UID-for-all-src-blocks= ([[* Give all source code blocks a =#+name: ...= field (HTML ID)]])
- =lilac-insert-noweb-source-code-block-captions= ([[* Automatic captions for Noweb source code blocks]])
- =lilac-UID-for-all-headlines= ([[* Human-readable UIDs (Headings, aka headlines)]])

In brief, the =lilac-UID-for-all-*= functions make it so that the links to
headlines and source code blocks are both deterministic and human-readable. The
=lilac-insert-noweb-source-code-block-captions= function

*** Modify the HTML

This is useful for adding in final tweaks to the HTML that is difficult to
accomplish at the Org-mode buffer level.

Phase 1: In the first phase, we use the generated HTML data to populate the
=lilac-child-HTML_ID-hash-table=. This data structure is used to link to child
blocks from parent blocks. We also populate the
=lilac-org_id-human_id-hash-table= which is used to convert HTML IDs to be more
human-readable.

#+name: __NREF__lilac-publish-modify-HTML-1
#+begin_src emacs-lisp
(org-export-filter-src-block-functions
 '(lilac-populate-child-HTML_ID-hash-table
   lilac-populate-org_id-human_id-hash-table))
#+end_src

Phase 2: In this phase we perform the linking from parent blocks to child blocks
(=lilac-link-to-children-from-parent-body=), and also convert the child source
code captions to look prettier (=lilac-prettify-source-code-captions=).

#+name: __NREF__lilac-publish-modify-HTML-2
#+begin_src emacs-lisp
(org-export-filter-src-block-functions
 '(lilac-link-to-children-from-parent-body
   lilac-prettify-source-code-captions))
(org-export-filter-final-output-functions
 '(lilac-replace-org_ids-with-human_ids))
#+end_src

*** Miscellaneous export settings

Do not hardcode colors into the HTML. Instead refer to CSS class names, to be
stylized by an external CSS file.

#+name: __NREF__lilac-publish-use-css
#+begin_src emacs-lisp
(org-html-htmlize-output-type 'css)
#+end_src

** Org modifications

*** Give all source code blocks a =#+name: ...= field (HTML ID)

Only source code blocks that have a =#+name: ...= field (org name field) get an
HTML ID (org ID) assigned to it. The problem with polyblocks is that they are
not assigned an org name field by default.

Of course, we still want all polyblock to have an HTML ID, which can then be
extracted by [[(lilac-get-src-block-HTML_ID)][=lilac-get-src-block-HTML_ID=]] to build up the
=lilac-child-HTML_ID-hash-table= in [[* Link noweb references (link to child block
from parent block)]]. If we don't do this then parent source code blocks won't
be able to link to the polyblock at all (or vice versa).

Monoblocks with a =#+name: ...= field get a unique HTML ID assigned to it in
the form =orgN= where =N= is a hexadecimal number. By default Org generates a
random number for =N=, but we use a simple counter that increments, starting
from 0 (see [[*Do not use random numbers for the HTML "=id=" attribute]]).

Some source code blocks may not even be monoblocks, because a =#+name: ...=
field may simply be missing.

What we can do is inject a =#+name: ___anonymous-src-block-N= line (where =N= is
an incrementing number) into the beginning of the source code section of all
source code blocks that need it. Then we can construct an HTML link to any
source code block.

Note that the actual name =__anonymous-src-block-N= is not important, because it
gets erased and replaced with an =orgN= ID during HTML export. At that point we
make these =orgN= strings human-readable in [[* Use human-readable HTML IDs for
source code links]].

#+name: __NREF__UID-for-all-src-blocks
#+begin_src emacs-lisp
(defun lilac-UID-for-all-src-blocks (_backend)
  (let* ((all-src-blocks
           __NREF__all-src-blocks)
         (counter 0)
         (auto-names
           (-remove 'null
             (cl-loop for src-block in all-src-blocks collect
               (let* ((pos (org-element-property :begin src-block))
                      (parent-name-struct (lilac-get-src-block-name src-block))
                      (direct-name (org-element-property :name src-block))
                      (no-direct-name (s-blank? direct-name))
                      (prefix
                        (cond ((s-blank? (car parent-name-struct))
                               "___anonymous-src-block")
                              (t
                               (car parent-name-struct))))
                      (name-final
                       (format "#+name: %s-%x\n" prefix counter)))
                 (setq counter (1+ counter))
                 (when no-direct-name
                   (cons pos name-final)))))))
    (lilac-insert-strings-into-buffer auto-names)))
#+end_src

