README.html

<div id="outline-container-h-Modify-the-Org-buffer" class="outline-4">
<h4 id="h-Modify-the-Org-buffer"><span class="section-number-4">5.4.1.</span> Modify the Org buffer</h4>
<div class="outline-text-4" id="text-h-Modify-the-Org-buffer">
<p>
Here we modify the Org mode buffer, by using <code>org-export-before-parsing-hook</code>.
This takes a list of functions that are free to modify the Org mode buffer
before each Org element in the buffer gets converted into HTML.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#__NREF__lilac_dot_el-lilac-publish">lilac-publish-modify-org</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__lilac-publish-modify-org">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__lilac-publish-modify-org">(org-export-before-parsing-hook
 '(lilac-UID-for-all-src-blocks
   lilac-insert-noweb-source-code-block-captions
   lilac-UID-for-all-headlines))
</pre></div></div><p>
As for the actual modifications, see:
</p>

<ul class="org-ul">
<li><code>lilac-UID-for-all-src-blocks</code> (<a href="#h-Give-all-source-code-blocks-a----name-------field--HTML-ID">5.5.1</a>)</li>
<li><code>lilac-insert-noweb-source-code-block-captions</code> (<a href="#h-Automatic-captions-for-Noweb-source-code-blocks">5.5.2</a>)</li>
<li><code>lilac-UID-for-all-headlines</code> (<a href="#h-Human-readable-UIDs--Headings--aka-headlines">5.5.3</a>)</li>
</ul>

<p>
In brief, the <code>lilac-UID-for-all-*</code> functions make it so that the links to
headlines and source code blocks are both deterministic and human-readable. The
<code>lilac-insert-noweb-source-code-block-captions</code> function
</p>
</div>
</div>

<div id="outline-container-h-Modify-the-HTML" class="outline-4">
<h4 id="h-Modify-the-HTML"><span class="section-number-4">5.4.2.</span> Modify the HTML</h4>
<div class="outline-text-4" id="text-h-Modify-the-HTML">
<p>
This is useful for adding in final tweaks to the HTML that is difficult to
accomplish at the Org-mode buffer level.
</p>

<p>
Phase 1: In the first phase, we use the generated HTML data to populate the
<code>child-HTML_ID-hash-table</code>. This data structure is used to link to child blocks
from parent blocks.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#__NREF__lilac_dot_el-lilac-publish">lilac-publish-modify-HTML-1</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__lilac-publish-modify-HTML-1">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__lilac-publish-modify-HTML-1">(org-export-filter-src-block-functions
 '(lilac-populate-child-HTML_ID-hash-table
   lilac-populate-org_id-human_id-hash-table))
</pre></div></div><p>
Phase 2: In this phase we perform the linking from parent blocks to child
blocks.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#__NREF__lilac_dot_el-lilac-publish">lilac-publish-modify-HTML-2</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__lilac-publish-modify-HTML-2">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__lilac-publish-modify-HTML-2">(org-export-filter-src-block-functions
 '(lilac-link-to-children-from-parent-body
   lilac-prettify-source-code-captions))
(org-export-filter-final-output-functions
 '(lilac-replace-org_ids-with-human_ids))
</pre></div></div>
</div>
</div>

<div id="outline-container-h-Miscellaneous-export-settings" class="outline-4">
<h4 id="h-Miscellaneous-export-settings"><span class="section-number-4">5.4.3.</span> Miscellaneous export settings</h4>
<div class="outline-text-4" id="text-h-Miscellaneous-export-settings">
<p>
Do not hardcode colors into the HTML. Instead refer to CSS class names, to be
stylized by an external CSS file.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#__NREF__lilac_dot_el-lilac-publish">lilac-publish-use-css</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__lilac-publish-use-css">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__lilac-publish-use-css">(org-html-htmlize-output-type 'css)
</pre></div></div>
</div>
</div>
</div>

<div id="outline-container-h-Org-modifications" class="outline-3">
<h3 id="h-Org-modifications"><span class="section-number-3">5.5.</span> Org modifications</h3>
<div class="outline-text-3" id="text-h-Org-modifications">
</div>

<div id="outline-container-h-Give-all-source-code-blocks-a----name-------field--HTML-ID" class="outline-4">
<h4 id="h-Give-all-source-code-blocks-a----name-------field--HTML-ID"><span class="section-number-4">5.5.1.</span> Give all source code blocks a <code>#+name: ...</code> field (HTML ID)</h4>
<div class="outline-text-4" id="text-h-Give-all-source-code-blocks-a----name-------field--HTML-ID">
<p>
Only source code blocks that have a <code>#+name: ...</code> field (org name field) get an
HTML ID (org ID) assigned to it. The problem with polyblocks is that they are
not assigned an org name field by default.
</p>

<p>
Of course, we still want all polyblock to have an HTML ID, which can then be
extracted by <a href="#coderef-lilac-get-src-block-HTML_ID" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-lilac-get-src-block-HTML_ID');" onmouseout="CodeHighlightOff(this, 'coderef-lilac-get-src-block-HTML_ID');"><code>lilac-get-src-block-HTML_ID</code></a> to build up the
<code>child-HTML_ID-hash-table</code> in <a href="#h-Link-noweb-references--link-to-child-block-from-parent-block">5.6.3</a>. If we don't do this then parent source code blocks won't be
able to link to the polyblock at all (or vice versa).
</p>

<p>
Monoblocks with a <code>#+name: ...</code> field get a unique HTML ID assigned to it in
the form <code>orgN</code> where <code>N</code> is a hexadecimal number. By default Org generates a
random number for <code>N</code>, but we use a simple counter that increments, starting
from 0 (see <a href="#h-Do-not-use-random-numbers-for-the-HTML---id---attribute">5.3.3</a>).
</p>

<p>
Some source code blocks may not even be monoblocks, because a <code>#+name: ...</code>
field may simply be missing.
</p>

<p>
What we can do is inject a <code>#+name: ___anonymous-src-block-N</code> line (where <code>N</code> is
an incrementing number) into the beginning of the source code section of all
source code blocks that need it. Then we can construct an HTML link to any
source code block.
</p>

<p>
Note that the actual name <code>__anonymous-src-block-N</code> is not important, because it
gets erased and replaced with an <code>orgN</code> ID during HTML export. At that point we
make these <code>orgN</code> strings human-readable in <a href="#h-Use-human-readable-HTML-IDs-for-source-code-links">5.6.1</a>.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#__NREF__lilac_dot_el-lilac-publish">UID-for-all-src-blocks</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__UID-for-all-src-blocks">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__UID-for-all-src-blocks">(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-UID-for-all-src-blocks</span> (_backend)
  (<span class="org-keyword">let*</span> ((all-src-blocks
           <span class="lilac-child-link-from-parent"><a href="#__NREF__all-src-blocks">all-src-blocks</a></span>)
         (counter 0)
         (auto-names
           (-remove 'null
             (<span class="org-keyword">cl-loop</span> for src-block in all-src-blocks collect
               (<span class="org-keyword">let*</span> ((pos (org-element-property <span class="org-builtin">:begin</span> src-block))
                      (parent-name-struct (lilac-get-src-block-name src-block))
                      (direct-name (org-element-property <span class="org-builtin">:name</span> src-block))
                      (no-direct-name (s-blank? direct-name))
                      (prefix
                        (<span class="org-keyword">cond</span> ((s-blank? (car parent-name-struct))
                               <span class="org-string">"___anonymous-src-block"</span>)
                              (t
                               (car parent-name-struct))))
                      (name-final
                       (format <span class="org-string">"#+name: %s-%x\n"</span> prefix counter)))
                 (<span class="org-keyword">setq</span> counter (1+ counter))
                 (<span class="org-keyword">when</span> no-direct-name
                   (cons pos name-final)))))))
    (lilac-insert-strings-into-buffer auto-names)))
</pre></div></div>
</div>
</div>
