README.html

<div id="outline-container-h-Automatic-captions-for-Noweb-source-code-blocks" class="outline-4">
<h4 id="h-Automatic-captions-for-Noweb-source-code-blocks"><span class="section-number-4">5.5.2.</span> Automatic captions for Noweb source code blocks</h4>
<div class="outline-text-4" id="text-h-Automatic-captions-for-Noweb-source-code-blocks">
<p>
For the parent/child source code blocks, we simply build these up by having
blocks named <code>#+name: __NREF__foo</code> or <code>#+header: :noweb-ref __NREF__foo</code>. Each
of these blocks can also reference other blocks by having a line <code>__NREF__bar</code>
inside its body. When defining such blocks, we really don't want to define the
<code>#+caption: ...</code> part manually because it gets tedious rather quickly. Yet we
still have to have these <code>#+caption: ...</code> bits (<i>for every <code>__NREF__...</code>
block!</i>) because that's the only way that Org's HTML exporter knows how to label
these blocks.
</p>

<p>
The code in this section automatically generates <code>#+caption: ...</code> text for these
<code>__NREF__...</code> blocks.
</p>

<p>
We want each <code>#+caption: ...</code> text to have the following items:
</p>

<dl class="org-dl">
<dt><a href="#coderef-NSCB_NAME" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-NSCB_NAME');" onmouseout="CodeHighlightOff(this, 'coderef-NSCB_NAME');"><code>NSCB_NAME</code></a></dt><dd>name of the Noweb source code block,</dd>
<dt><a href="#coderef-NSCB_POLYBLOCK_INDICATOR" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-NSCB_POLYBLOCK_INDICATOR');" onmouseout="CodeHighlightOff(this, 'coderef-NSCB_POLYBLOCK_INDICATOR');"><code>NSCB_POLYBLOCK_INDICATOR</code></a></dt><dd>an indicator to show whether this block is
broken up over multiple blocks, and</dd>
<dt><a href="#coderef-NSCB_LINKS_TO_PARENTS" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-NSCB_LINKS_TO_PARENTS');" onmouseout="CodeHighlightOff(this, 'coderef-NSCB_LINKS_TO_PARENTS');"><code>NSCB_LINKS_TO_PARENTS</code></a></dt><dd>a link back up to a parent block (if any) where
this block is used; can contain more than 1 parent if multiple parents refer
to this same child block</dd>
</dl>

<p>
<i>NSCB</i> here means <i>Noweb source code block</i>. We loop through every source code
block and insert a <code>#+caption: ...</code> text into the buffer. This modified buffer
(with the three bits of information from above) is what is sent down the
pipeline for final export to HTML (i.e., the buffer modification does not affect
the actual buffer (<code>*.org</code> file)).
</p>

<p>
So assume that we already have the smart captions in a sorted <a href="https://www.gnu.org/software/emacs/manual/html_node/elisp/Association-Lists.html">association list</a>
(aka alist), where the KEY is the integer buffer position where this caption
should be inserted, and the VALUE is the caption itself (a string), like this:
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><label class="org-src-name">Caption locations</label><span class="lilac-caption-link-symbol"><a href="#Caption-locations">&#x1f517;</a></span></div><pre class="src src-elisp" id="Caption-locations">'((153  . <span class="org-string">"#+caption: ..."</span>)
  (384  . <span class="org-string">"#+caption: ..."</span>)
  (555  . <span class="org-string">"#+caption: ..."</span>)
  (684  . <span class="org-string">"#+caption: ..."</span>)
  (1051 . <span class="org-string">"#+caption: ..."</span>))
</pre></div></div><p>
We can use the KEY to go to that buffer position and insert the caption. However
the insertion operation mutates the buffer. This means if we perform the
insertions top-to-bottom, the subsequent KEY values will become obsolete. The
trick then is to just do the insertions in reverse order (bottom-to-top), so
that the remaining KEY values remain valid. This is what we do below, where
<code>smart-captions</code> is an alist like the one just described.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#__NREF__lilac_dot_el-lilac-publish">smart-source-code-block-captions</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__smart-source-code-block-captions">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__smart-source-code-block-captions">(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-insert-noweb-source-code-block-captions</span> (_backend)
  (<span class="org-keyword">let*</span> ((parent-blocks
           <span class="lilac-child-link-from-parent"><a href="#__NREF__parent-blocks">parent-blocks</a></span>)
         (child-parents-hash-table
           <span class="lilac-child-link-from-parent"><a href="#__NREF__child-parents-hash-table">child-parents-hash-table</a></span>)
         (all-src-blocks
           <span class="lilac-child-link-from-parent"><a href="#__NREF__all-src-blocks">all-src-blocks</a></span>)
         (smart-captions
           <span class="lilac-child-link-from-parent"><a href="#__NREF__smart-captions">smart-captions</a></span>))
    (lilac-insert-strings-into-buffer smart-captions)))

<span class="lilac-child-link-from-parent"><a href="#__NREF__smart-source-code-block-captions-helpers-1">smart-source-code-block-captions-helpers</a></span>
</pre></div></div><p>
(We'll get to the helper functions <code>smart-source-code-block-captions-helpers</code>
later as they obscure the big picture.)
</p>

<p>
Now we just have to construct <code>smart-captions</code>. The main difficulty is the
construction of <a href="#coderef-NSCB_LINKS_TO_PARENTS" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-NSCB_LINKS_TO_PARENTS');" onmouseout="CodeHighlightOff(this, 'coderef-NSCB_LINKS_TO_PARENTS');"><code>NSCB_LINKS_TO_PARENTS</code></a>, so most of the code will be concerned
about child-parent associations.
</p>

<p>
Why do we even need these source code blocks to link back to their parents? The
point is to make things easier to navigate. For example, if we have
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><label class="org-src-name">Sample Org-mode Noweb-style references</label><span class="lilac-caption-link-symbol"><a href="#Sample-Org-mode-Noweb-style-references-2">&#x1f517;</a></span></div><pre class="src src-org" id="Sample-Org-mode-Noweb-style-references-2"><span class="org-org-meta-line">#+name: parent-block</span>
<span class="org-org-block-begin-line">#+begin_src bash</span>
<span class="org-org-block"><span class="org-builtin">echo</span></span><span class="org-org-block"> </span><span class="org-org-block"><span class="org-string">"Hello from the parent block"</span></span>
<span class="org-org-block">__NREF__child-block-1</span>
<span class="org-org-block">__NREF__child-block-2</span>
<span class="org-org-block-end-line">#+end_src</span>

...

<span class="org-org-meta-line">#+name: __NREF__child-block-1</span>
<span class="org-org-block-begin-line">#+begin_src bash</span>
<span class="org-org-block"><span class="org-builtin">echo</span></span><span class="org-org-block"> </span><span class="org-org-block"><span class="org-string">"I am child 1"</span></span>
<span class="org-org-block-end-line">#+end_src</span>

...

<span class="org-org-meta-line">#+header: :noweb-ref __NREF__child-block-2</span>
<span class="org-org-block-begin-line">#+begin_src bash</span>
<span class="org-org-block"><span class="org-builtin">echo</span></span><span class="org-org-block"> -n </span><span class="org-org-block"><span class="org-string">"I am "</span></span>
<span class="org-org-block-end-line">#+end_src</span>

<span class="org-org-meta-line">#+header: :noweb-ref __NREF__child-block-2</span>
<span class="org-org-block-begin-line">#+begin_src bash</span>
<span class="org-org-block"><span class="org-builtin">echo</span></span><span class="org-org-block"> </span><span class="org-org-block"><span class="org-string">"child 2"</span></span>
<span class="org-org-block-end-line">#+end_src</span>
</pre></div></div><p>
and we export this to HTML, ideally we would want both <code>__NREF__child-block-1</code>
and each of the <code>__NREF__child-block-2</code> blocks to include an HTML link back up
to <code>parent-block</code>. This would make it easier to skim the document and not get
too lost (any time you are looking at any particular source code block, you
would be able to just click on the link back to the parent (if there is one) to
see a higher-level view).
</p>

<p>
The key idea here is to build a hash table (<code>child-parents-hash-table</code>) where
the KEY is a child source code block and the VALUE is the parent block(s). Then
in order to construct <a href="#coderef-NSCB_LINKS_TO_PARENTS" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-NSCB_LINKS_TO_PARENTS');" onmouseout="CodeHighlightOff(this, 'coderef-NSCB_LINKS_TO_PARENTS');"><code>NSCB_LINKS_TO_PARENTS</code></a> we just do a lookup against this
hash table to find the parent(s), if any.
</p>

<p>
The first thing we need is a list of parent source code blocks. We consider a
source code block a parent block if it has any Noweb references within its body.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#__NREF__smart-source-code-block-captions">parent-blocks</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__parent-blocks">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__parent-blocks">(lilac-get-parent-blocks)
</pre></div></div><p>
Then we construct the <code>child-parents-hash-table</code>. For each parent block, we get
all of its children (<code>child-names</code>), and use this data to construct a
child-parent association. Note that we use <code>cl-pushnew</code> instead of <code>push</code> to
deduplicate parents (i.e., when a single parent refers to the same child more
than once we do not want to link back to this same parent more than once from
the child block's caption).
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#__NREF__smart-source-code-block-captions">child-parents-hash-table</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__child-parents-hash-table">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__child-parents-hash-table">(lilac-mk-child-parents-hash-table parent-blocks)
</pre></div></div><p>
Now that we have the child-parent associations, we have to look at all source
code blocks and check if
</p>

<ol class="org-ol">
<li>this source code block's name shows up at all in <code>child-parents-hash-table</code>,
and if so</li>
<li>add a link to the parent (<a href="#coderef-NSCB_LINKS_TO_PARENTS" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-NSCB_LINKS_TO_PARENTS');" onmouseout="CodeHighlightOff(this, 'coderef-NSCB_LINKS_TO_PARENTS');"><code>NSCB_LINKS_TO_PARENTS</code></a>).</li>
</ol>

<p>
Let's grab all source code blocks:
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#__NREF__UID-for-all-src-blocks">all-src-blocks</a></span><span class="lilac-caption-parent-link"><a href="#__NREF__smart-source-code-block-captions">2</a></span><span class="lilac-caption-parent-link"><a href="#__NREF__smart-source-code-block-captions-helpers-4">3</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__all-src-blocks">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__all-src-blocks">(org-element-map (org-element-parse-buffer) 'src-block 'identity)
</pre></div></div><p>
And now we can finally construct <code>smart-captions</code>:
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#__NREF__smart-source-code-block-captions">smart-captions</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__smart-captions">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__smart-captions">(lilac-mk-smart-captions child-parents-hash-table)
</pre></div></div><p>
We used some helper functions up in <a href="#__NREF__smart-source-code-block-captions"><code>__NREF__smart-source-code-block-captions</code></a>;
let's examine them now.
</p>

<p>
<code>lilac-is-parent-block</code> checks whether a source code block is a parent (contains
noweb references to other child blocks in the form <code>__NREF__child-name</code>).
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#__NREF__smart-source-code-block-captions">smart-source-code-block-captions-helpers</a></span>(1/9) <span class="lilac-caption-link-symbol"><a href="#__NREF__smart-source-code-block-captions-helpers-1">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__smart-source-code-block-captions-helpers-1">(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-is-parent-block</span> (src-block)
  (<span class="org-keyword">let</span> ((body (org-element-property <span class="org-builtin">:value</span> src-block)))
    (lilac-get-noweb-children body)))
</pre></div></div><p>
<code>lilac-get-parent-blocks</code> retrieves all source code blocks that are parents
(which have <code>__NREF__...</code> references).
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#__NREF__smart-source-code-block-captions">smart-source-code-block-captions-helpers</a></span>(2/9) <span class="lilac-caption-link-symbol"><a href="#__NREF__smart-source-code-block-captions-helpers-2">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__smart-source-code-block-captions-helpers-2">(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-get-parent-blocks</span> ()
  (org-element-map (org-element-parse-buffer) 'src-block
    (<span class="org-keyword">lambda</span> (src-block)
       (<span class="org-keyword">if</span> (lilac-is-parent-block src-block) src-block))))
</pre></div></div><p>
<code>lilac-mk-child-parents-hash-table</code> takes all parent source code blocks and
generates a hash table where the KEY is the child block name and the VALUE is
the list of parents that refer to the child. When we loop through
<code>parent-blocks</code> below, we have to first <code>reverse</code> it because the function
<code>cl-pushnew</code> grows the list by prepending to it.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#__NREF__smart-source-code-block-captions">smart-source-code-block-captions-helpers</a></span>(3/9) <span class="lilac-caption-link-symbol"><a href="#__NREF__smart-source-code-block-captions-helpers-3">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__smart-source-code-block-captions-helpers-3">(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-mk-child-parents-hash-table</span> (parent-blocks)
  (<span class="org-keyword">let</span> ((hash-table (make-hash-table <span class="org-builtin">:test</span> 'equal)))
    (mapc
     (<span class="org-keyword">lambda</span> (parent-block)
      (<span class="org-keyword">let*</span> ((parent-name (org-element-property <span class="org-builtin">:name</span> parent-block))
             (parent-body (org-element-property <span class="org-builtin">:value</span> parent-block))
             (child-names (lilac-get-noweb-children parent-body)))
        (mapc (<span class="org-keyword">lambda</span> (child-name)
                (<span class="org-keyword">let*</span> ((parents (gethash child-name hash-table)))
                  (<span class="org-keyword">if</span> parents
                    (puthash child-name (<span class="org-keyword">cl-pushnew</span> parent-name parents) hash-table)
                    (puthash child-name (list parent-name) hash-table))))
              child-names)))
     (reverse parent-blocks))
    hash-table))
</pre></div></div><p>
<code>lilac-mk-smart-captions</code> generates an alist of buffer positions (positive
integer) and the literal <code>#+caption: ...</code> text that needs to be inserted back
into the buffer.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#__NREF__smart-source-code-block-captions">smart-source-code-block-captions-helpers</a></span>(4/9) <span class="lilac-caption-link-symbol"><a href="#__NREF__smart-source-code-block-captions-helpers-4">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__smart-source-code-block-captions-helpers-4">(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-mk-smart-captions</span> (child-parents-hash-table)
  (-remove 'null
    (<span class="org-keyword">cl-loop</span> for src-block in <span class="lilac-child-link-from-parent"><a href="#__NREF__all-src-blocks">all-src-blocks</a></span> collect
      (<span class="org-keyword">let*</span> ((child (lilac-get-src-block-name src-block))
             (child-name (car child))
<span id="coderef-NSCB_NAME" class="coderef-off">             (NSCB_NAME (format <span class="org-string">"=%s= "</span> child-name))</span>
<span id="coderef-NSCB_POLYBLOCK_INDICATOR" class="coderef-off">             (NSCB_POLYBLOCK_INDICATOR</span>
               (<span class="org-keyword">if</span> (lilac-get-noweb-ref-polyblock-name src-block)
                   <span class="org-string">"(polyblock)"</span>
                 <span class="org-string">""</span>))
             (polyblock-counter (gethash child-name lilac-polyblock-names-totals 0))
             (polyblock-counter-incremented
              (puthash child-name (+ 1 polyblock-counter)
                       lilac-polyblock-names-totals))
             (parents (gethash child-name child-parents-hash-table))
             (parents-zipped (lilac-enumerate parents))
             (pos (org-element-property <span class="org-builtin">:begin</span> src-block))
<span id="coderef-NSCB_LINKS_TO_PARENTS" class="coderef-off">             (NSCB_LINKS_TO_PARENTS</span>
              (mapconcat (<span class="org-keyword">lambda</span> (parent-with-idx)
                           (format <span class="org-string">" [[%s][%d]]"</span>
                                   (nth 1 parent-with-idx)
                                   (+ 1 (nth 0 parent-with-idx))))
                         parents-zipped <span class="org-string">" "</span>))
             (smart-caption
              (concat
                <span class="org-string">"#+caption: "</span>
                NSCB_NAME
                NSCB_POLYBLOCK_INDICATOR
                NSCB_LINKS_TO_PARENTS
                <span class="org-string">"\n"</span>)))
        (<span class="org-keyword">when</span> parents (cons pos smart-caption))))))
</pre></div></div><p>
<code>lilac-insert-strings-into-buffer</code> takes an alist of buffer positions and
strings and inserts them all into the buffer.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#__NREF__smart-source-code-block-captions">smart-source-code-block-captions-helpers</a></span>(5/9) <span class="lilac-caption-link-symbol"><a href="#__NREF__smart-source-code-block-captions-helpers-5">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__smart-source-code-block-captions-helpers-5">(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-insert-strings-into-buffer</span> (pos-strings)
  (<span class="org-keyword">cl-loop</span> for pos-string in (reverse pos-strings) do
        (<span class="org-keyword">let</span> ((pos (car pos-string))
              (str (cdr pos-string)))
          (goto-char pos)
          (insert str))))
</pre></div></div><p>
<code>lilac-get-noweb-children</code> extracts all Noweb references in the form
"<code>__NREF__foo</code>" from a given multiline string, returning a list of all such
references. This function expects at most 1 Noweb reference per line. The return
type is a list of strings.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#__NREF__smart-source-code-block-captions">smart-source-code-block-captions-helpers</a></span>(6/9) <span class="lilac-caption-link-symbol"><a href="#__NREF__smart-source-code-block-captions-helpers-6">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__smart-source-code-block-captions-helpers-6">(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-get-noweb-children</span> (s)
  (<span class="org-keyword">let*</span> ((lines (split-string s <span class="org-string">"\n"</span>))
         (refs (-remove 'null
                 (mapcar
                  (<span class="org-keyword">lambda</span> (line)
                   (<span class="org-keyword">if</span> (string-match (lilac-nref-rx nil) line)
                       (match-string-no-properties 1 line)))
                  lines))))
    refs))
</pre></div></div><p>
<code>lilac-get-noweb-ref-polyblock-name</code> gets the string <code>__NREF__foo</code> in a
<code>#+header: :noweb-ref __NREF__foo</code> line for a source code block.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#__NREF__smart-source-code-block-captions">smart-source-code-block-captions-helpers</a></span>(7/9) <span class="lilac-caption-link-symbol"><a href="#__NREF__smart-source-code-block-captions-helpers-7">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__smart-source-code-block-captions-helpers-7">(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-get-noweb-ref-polyblock-name</span> (source-code-block)
  (<span class="org-keyword">let*</span> ((headers (org-element-property <span class="org-builtin">:header</span> source-code-block))
         (noweb-ref-name
          (nth 0
           (-remove 'null
            (mapcar
             (<span class="org-keyword">lambda</span> (header)
               (<span class="org-keyword">if</span> (string-match <span class="org-string">":noweb-ref </span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">.+</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">"</span> header)
                   (match-string-no-properties 1 header)))
             headers)))))
    noweb-ref-name))
</pre></div></div><p>
Note that a child source block can have two ways of defining its name. The first
is with the direct <code>#+name: __NREF__foo</code> style (<a href="#org0000004">monoblock</a>), and the second way
is with a line like <code>#+header: :noweb-ref __NREF__foo</code> (<a href="#org0000006">polyblock</a>). Here
<code>lilac-get-src-block-name</code> grabs the name of a (child) source code block, taking
into account these two styles. For polyblock names, we mark it as such with a
<code>(polyblock)</code> string, which is used later for the <a href="#coderef-NSCB_POLYBLOCK_INDICATOR" class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-NSCB_POLYBLOCK_INDICATOR');" onmouseout="CodeHighlightOff(this, 'coderef-NSCB_POLYBLOCK_INDICATOR');"><code>NSCB_POLYBLOCK_INDICATOR</code></a>.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#__NREF__smart-source-code-block-captions">smart-source-code-block-captions-helpers</a></span>(8/9) <span class="lilac-caption-link-symbol"><a href="#__NREF__smart-source-code-block-captions-helpers-8">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__smart-source-code-block-captions-helpers-8">(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-get-src-block-name</span> (src-block)
  (<span class="org-keyword">let*</span> ((name-direct (org-element-property <span class="org-builtin">:name</span> src-block))
         (name-indirect (lilac-get-noweb-ref-polyblock-name src-block)))
    (<span class="org-keyword">if</span> name-indirect
        `(,name-indirect <span class="org-string">"(polyblock)"</span>)
        `(,name-direct <span class="org-string">""</span>))))
</pre></div></div><p>
Next we have some helpers to enumerate through a list just like in Python. The
index starts at 0 (same as Python).
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#__NREF__smart-source-code-block-captions">smart-source-code-block-captions-helpers</a></span>(9/9) <span class="lilac-caption-link-symbol"><a href="#__NREF__smart-source-code-block-captions-helpers-9">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__smart-source-code-block-captions-helpers-9">(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-enumerate</span> (lst <span class="org-type">&amp;optional</span> start)
  (<span class="org-keyword">let</span> ((ret ()))
    (<span class="org-keyword">cl-loop</span> for index from (<span class="org-keyword">if</span> start start 0)
           for item in lst
           do (<span class="org-keyword">push</span> (list index item) ret))
    (reverse ret)))

<span class="org-comment-delimiter">; </span><span class="org-comment">See https://emacs.stackexchange.com/a/7150.</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-matches</span> (regexp s <span class="org-type">&amp;optional</span> group)
  <span class="org-doc">"Get a list of all regexp matches in a string"</span>
  (<span class="org-keyword">if</span> (= (length s) 0)
      ()
      (<span class="org-keyword">save-match-data</span>
        (<span class="org-keyword">let</span> ((pos 0)
              (matches ()))
          (<span class="org-keyword">while</span> (string-match regexp s pos)
            (<span class="org-keyword">push</span> (match-string (<span class="org-keyword">if</span> group group 0) s) matches)
            (<span class="org-keyword">setq</span> pos (match-end 0)))
          (reverse matches)))))
</pre></div></div>
</div>
</div>
