README.org
*** Human-readable UIDs (Headings, aka headlines)

By default Org does a terrible job of naming HTML =id= fields for headings. By
default it uses a randomly-generated number. In [[* Do not use random numbers for
the HTML "=id=" attribute]] we tweak this behavior to use a deterministic,
incrementing number starting from 0. However while this solution gets rid of the
nondeterminism, it still results in human-unfriendly =id= attributes because
they are all numeric (e.g. =org00000a1=, =org00000f3=, etc).

For headings, we can do better because in practice they already mostly have
unique contents, which should work most of the time to act as an =id=. In other
words, we want all headings to have HTML IDs that are patterned after their
contents. This way we can have IDs like =some-heading-name-1= (where the
trailing =-1= is only used to disambiguate against another heading of the same
name) instead of =org00000a1= (numeric hex).

For each heading, we insert a =CUSTOM_ID= property. This makes Org refer to this
=CUSTOM_ID= instead of the numeric =org...= link names. We append this headline
property just below every headline we find in the buffer. The actual
construction of the =CUSTOM_ID= (=headline-UID= in the code below) is done by
=lilac-get-unique-id=.

#+Name: __NREF__UID-for-all-headlines
#+begin_src emacs-lisp
(defun lilac-UID-for-all-headlines (_backend)
  (let* ((all-headlines
           (org-element-map (org-element-parse-buffer) 'headline 'identity))

         (headline-uid-hash-table (make-hash-table :test 'equal))
         (headline-UIDs
           (-remove 'null
             (cl-loop for headline in all-headlines collect
               (let* ((headline-UID
                       (lilac-get-unique-id headline headline-uid-hash-table))
                      ;; Get the position just after the headline (just
                      ;; underneath it).
                      (pos (progn
                             (goto-char (org-element-property :begin headline))
                             (re-search-forward "\n"))))
                 (cons pos (concat
                            ":PROPERTIES:\n"
                            ":CUSTOM_ID: " headline-UID "\n"
                            ":END:\n")))))))
    (lilac-insert-strings-into-buffer headline-UIDs)))

__NREF__get-unique-id
#+end_src

=lilac-get-unique-id= converts a given headline to its canonical form (every
non-word character converted to a dash) and performs a lookup against the hash
table. If the entry exists, it looks up a =entry-N= value in a loop with =N=
increasing until it sees that no such key exists (at which point we know that we
have a unique ID).

#+name: __NREF__get-unique-id
#+begin_src emacs-lisp
(defun lilac-get-unique-id (headline hash-table)
  (let* ((name (org-element-property :raw-value headline))
         (disambiguation-number 0)
         (key (concat "h-" (lilac-normalize-string name)))
         (val (gethash key hash-table)))
    ;; Discard the key if a value already exists. This drives up the
    ;; disambiguation number.
    (while val
      (setq disambiguation-number (1+ disambiguation-number))
      (setq key (concat "h-"
                        (lilac-normalize-string
                         (format "%s-%s" name disambiguation-number))))
      (setq val (gethash key hash-table)))
    (puthash key t hash-table)
    key))

(defun lilac-normalize-string (s)
  (string-trim
    (replace-regexp-in-string "[^A-Za-z0-9]" "-" s)
    "-"
    "-"))
#+end_src

** HTML modifications

