README.html

<div id="outline-container-h-Human-readable-UIDs--Headings--aka-headlines" class="outline-4">
<h4 id="h-Human-readable-UIDs--Headings--aka-headlines"><span class="section-number-4">5.5.3.</span> Human-readable UIDs (Headings, aka headlines)</h4>
<div class="outline-text-4" id="text-h-Human-readable-UIDs--Headings--aka-headlines">
<p>
By default Org does a terrible job of naming HTML <code>id</code> fields for headings. By
default it uses a randomly-generated number. In <a href="#h-Do-not-use-random-numbers-for-the-HTML---id---attribute">5.3.3</a> we tweak this behavior to use a deterministic,
incrementing number starting from 0. However while this solution gets rid of the
nondeterminism, it still results in human-unfriendly <code>id</code> attributes because
they are all numeric (e.g. <code>org00000a1</code>, <code>org00000f3</code>, etc).
</p>

<p>
For headings, we can do better because in practice they already mostly have
unique contents, which should work most of the time to act as an <code>id</code>. In other
words, we want all headings to have HTML IDs that are patterned after their
contents. This way we can have IDs like <code>some-heading-name-1</code> (where the
trailing <code>-1</code> is only used to disambiguate against another heading of the same
name) instead of <code>org00000a1</code> (numeric hex).
</p>

<p>
For each heading, we insert a <code>CUSTOM_ID</code> property. This makes Org refer to this
<code>CUSTOM_ID</code> instead of the numeric <code>org...</code> link names. We append this headline
property just below every headline we find in the buffer. The actual
construction of the <code>CUSTOM_ID</code> (<code>headline-UID</code> in the code below) is done by
<code>lilac-get-unique-id</code>.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#__NREF__lilac_dot_el-lilac-publish">UID-for-all-headlines</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__UID-for-all-headlines">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__UID-for-all-headlines">(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-UID-for-all-headlines</span> (_backend)
  (<span class="org-keyword">let*</span> ((all-headlines
           (org-element-map (org-element-parse-buffer) 'headline 'identity))

         (headline-uid-hash-table (make-hash-table <span class="org-builtin">:test</span> 'equal))
         (headline-UIDs
           (-remove 'null
             (<span class="org-keyword">cl-loop</span> for headline in all-headlines collect
               (<span class="org-keyword">let*</span> ((headline-UID
                       (lilac-get-unique-id headline headline-uid-hash-table))
                      <span class="org-comment-delimiter">;; </span><span class="org-comment">Get the position just a</span>
                      <span class="org-comment-delimiter">;; </span><span class="org-comment">fter the headline (just underneath it).</span>
                      (pos (<span class="org-keyword">progn</span>
                             (goto-char (org-element-property <span class="org-builtin">:begin</span> headline))
                             (re-search-forward <span class="org-string">"\n"</span>))))
                 (cons pos (concat
                            <span class="org-string">":PROPERTIES:\n"</span>
                            <span class="org-string">":CUSTOM_ID: "</span> headline-UID <span class="org-string">"\n"</span>
                            <span class="org-string">":END:\n"</span>)))))))
    (lilac-insert-strings-into-buffer headline-UIDs)))

<span class="lilac-child-link-from-parent"><a href="#__NREF__get-unique-id">get-unique-id</a></span>
</pre></div></div><p>
<code>lilac-get-unique-id</code> converts a given headline to its canonical form (every
non-word character converted to a dash) and performs a lookup against the hash
table. If the entry exists, it looks up a <code>entry-N</code> value in a loop with <code>N</code>
increasing until it sees that no such key exists (at which point we know that we
have a unique ID).
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#__NREF__UID-for-all-headlines">get-unique-id</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__get-unique-id">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__get-unique-id">(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-get-unique-id</span> (headline hash-table)
  (<span class="org-keyword">let*</span> ((name (org-element-property <span class="org-builtin">:raw-value</span> headline))
         (disambiguation-number 0)
         (key (concat <span class="org-string">"h-"</span> (lilac-normalize-string name)))
         (val (gethash key hash-table)))
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Discard the key if a value already exists. This drives up the</span>
    <span class="org-comment-delimiter">;; </span><span class="org-comment">disambiguation number.</span>
    (<span class="org-keyword">while</span> val
      (<span class="org-keyword">setq</span> disambiguation-number (+ 1 disambiguation-number))
      (<span class="org-keyword">setq</span> key (concat <span class="org-string">"h-"</span>
                        (lilac-normalize-string
                         (format <span class="org-string">"%s-%s"</span> name disambiguation-number))))
      (<span class="org-keyword">setq</span> val (gethash key hash-table)))
    (puthash key t hash-table)
    key))

(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-normalize-string</span> (s)
  (string-trim
    (replace-regexp-in-string <span class="org-string">"[</span><span class="org-string"><span class="org-negation-char">^</span></span><span class="org-string">A-Za-z0-9]"</span> <span class="org-string">"-"</span> s)
    <span class="org-string">"-"</span>
    <span class="org-string">"-"</span>))
</pre></div></div>
</div>
</div>
</div>
