README.html

<div id="outline-container-h-HTML-modifications" class="outline-3">
<h3 id="h-HTML-modifications"><span class="section-number-3">5.6.</span> HTML modifications</h3>
<div class="outline-text-3" id="text-h-HTML-modifications">
</div>

<div id="outline-container-h-Use-human-readable-HTML-IDs-for-source-code-links" class="outline-4">
<h4 id="h-Use-human-readable-HTML-IDs-for-source-code-links"><span class="section-number-4">5.6.1.</span> Use human-readable HTML IDs for source code links</h4>
<div class="outline-text-4" id="text-h-Use-human-readable-HTML-IDs-for-source-code-links">
<p>
Recall that there are 2 types of source code blocks: <a href="#org0000004">monoblocks</a> and <a href="#org0000006">polyblocks</a>.
</p>

<p>
Polyblocks do get a name field attached to them during the <a href="#h-Give-all-source-code-blocks-a----name-------field--HTML-ID">Org
modification stage</a>, in the format <code>___anonymous-src-block-N</code>. These names are
for HTML link generation only, because the user won't see them &#x2014; they will
instead just see <code>org000012</code> or some such. In fact, all monoblocks are also
given these random-looking (and unstable) <code>org...</code> HTML IDs.
</p>

<p>
And therein lies the problem: if a user decides to bookmark a particular source
code block, whether a monoblock or polyblock, they will link to an
<code>org...</code>-style ID and chances are that this link will break over time.
</p>

<p>
This is exactly the same problem we have for headlines. For headlines we solved
the problem with a <a href="#h-Human-readable-UIDs--Headings--aka-headlines">hash table</a>, and we need to do the same thing here. The major
difference, though, is that unlike headlines which can accept a <code>CUSTOM_ID</code> Org
property, source code blocks have no such facility. So instead of modifying the
buffer (as we do for headlines), we have to modify the final HTML output
instead.
</p>

<p>
The solution is to simply look at all source code block links, then modify the
<code>id=...</code> part so that it looks like a more human-readable ID. We can extract the
human-readable ID by looking at the smart captions inside the
<code>&lt;label&gt;...&lt;/label&gt;</code> area for both monoblocks and polyblocks. And then it's just
a matter of doing a basic search-and-replace across the entire buffer (HTML
file).
</p>

<p>
We have to do a search-and-replace across the entire file because we may also
have manual links to source code blocks (although &#x2014; maybe it's just not worth
it because we can't refer to polyblocks anyway by name).
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#__NREF__lilac_dot_el-lilac-publish">lilac-human-readable-src-block-ids</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__lilac-human-readable-src-block-ids">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__lilac-human-readable-src-block-ids"><span class="org-comment-delimiter">; </span><span class="org-comment">Define a global hash table for mapping Org-mode-generated ids (that look like</span>
<span class="org-comment-delimiter">; </span><span class="org-comment">"org00012") for source code blocks to a more human-readable ID.</span>
(<span class="org-keyword">setq</span> lilac-org_id-human_id-hash-table (make-hash-table <span class="org-builtin">:test</span> 'equal))
(<span class="org-keyword">setq</span> lilac-human_id-count-hash-table (make-hash-table <span class="org-builtin">:test</span> 'equal))
(<span class="org-keyword">setq</span> lilac-human_id-org_id-hash-table (make-hash-table <span class="org-builtin">:test</span> 'equal))

(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-populate-org_id-human_id-hash-table</span> (src-block-html backend info)
  (<span class="org-keyword">when</span> (org-export-derived-backend-p backend 'html)
    (<span class="org-keyword">let*</span> ((block-name (lilac-get-src-block-name-from-html src-block-html))
           (block-name-count (gethash block-name
                                      lilac-human_id-count-hash-table
                                      0))
           (orgid (lilac-get-src-block-HTML_ID src-block-html)))
      (<span class="org-keyword">when</span> orgid
        (puthash block-name
                 (1+ block-name-count)
                 lilac-human_id-count-hash-table)
        (<span class="org-keyword">cond</span> ((= block-name-count 0)
                (<span class="org-keyword">progn</span>
                  (puthash orgid
                           block-name
                           lilac-org_id-human_id-hash-table)
                  (puthash block-name
                           orgid
                           lilac-human_id-org_id-hash-table)))
              ((= block-name-count 1)
                (<span class="org-keyword">let*</span> ((orgid-first-block
                        (gethash block-name lilac-human_id-org_id-hash-table)))
                  (puthash orgid-first-block
                           (format <span class="org-string">"%s-1"</span> block-name)
                           lilac-org_id-human_id-hash-table)
                  (puthash orgid
                           (format <span class="org-string">"%s-%d"</span> block-name (1+ block-name-count))
                           lilac-org_id-human_id-hash-table)))
              (t
                 (puthash orgid
                          (format <span class="org-string">"%s-%d"</span> block-name (1+ block-name-count))
                          lilac-org_id-human_id-hash-table))))
      src-block-html)))

(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-replace-org_ids-with-human_ids</span> (entire-html backend info)
  (<span class="org-keyword">when</span> (org-export-derived-backend-p backend 'html)
    (<span class="org-keyword">let</span> ((html-oneline (lilac-to-single-line entire-html)))
      (maphash
       (<span class="org-keyword">lambda</span> (k v)
        (<span class="org-keyword">when</span> (<span class="org-keyword">and</span> k v)
         (<span class="org-keyword">setq</span> html-oneline
               (replace-regexp-in-string
                (rx-to-string `(<span class="org-keyword">and</span> <span class="org-string">" id="</span> (* (not <span class="org-string">"\""</span>)) <span class="org-string">"\""</span> ,k <span class="org-string">"\""</span>))
                (format <span class="org-string">" id=\"%s\""</span> v) html-oneline))
         (<span class="org-keyword">setq</span> html-oneline
               (replace-regexp-in-string
                (rx-to-string `(<span class="org-keyword">and</span> <span class="org-string">" href="</span> (* (not <span class="org-string">"\""</span>)) <span class="org-string">"\"#"</span> ,k <span class="org-string">"\""</span>))
                (format <span class="org-string">" href=\"#%s\""</span> v) html-oneline))))
       lilac-org_id-human_id-hash-table)
      (lilac-to-multi-line html-oneline))))
</pre></div></div>
</div>
</div>
