README.org
*** Pretty source code captions

Here there are basically 3 things we have to keep track of:

1. the outer =<div>= that encloses the entire source code block,
2. the =<label>=, if any (it may not exist), and
3. the =<pre>= content.

We only care about source code blocks with a =<label>= because that determines
whether we have a "Listing: ..." or not. We just need to save the 3 bits of
information, and then:

1. print the outer =<div ...>=,
2. print the =<label>= content but as a =<div>=, and
3. print the =<pre>= content.

For the last step, we want to additionally parse the inner "Listing N ... 0 [1 2
3 ...]" text and transform it with reordering and also additional metadata
information such as ~<span class="...">~ tags.

We also save the =NSCB_POLYBLOCK_INDICATOR= with the =polyblock-indicator=
variable and display it.

#+name: __NREF__lilac-prettify-source-code-captions
#+begin_src emacs-lisp
(setq lilac-polyblock-names (make-hash-table :test 'equal))
(setq lilac-polyblock-names-totals (make-hash-table :test 'equal))

(defun lilac-prettify-source-code-captions (src-block-html backend info)
  (when (org-export-derived-backend-p backend 'html)
    ;; Break up source block into 3 subparts --- the leading <div ...>, the
    ;; <label ...></label> (if any) and <pre ...></pre>.
    ;; Then run the linkifying logic against only the body, and then return the
    ;; original label and new body.
    (let* ((div-caption-body (lilac-get-source-block-html-parts-without-newlines
                              src-block-html))
           (leading-div (nth 0 div-caption-body))
           (body (nth 2 div-caption-body))
           (pre-id-match
             (string-match
               (rx-to-string
                 '(and
                       "<pre "
                       (* (not ">"))
                       "id=\""
                       (group (+ (not "\"")))))
               body))
           (pre-id
             (if pre-id-match
                 (match-string-no-properties 1 body)
                 "#deadlink"))
           (body-with-newlines
            (lilac-to-multi-line body))
           (caption (nth 1 div-caption-body))
           ; caption-parts just captures whatever substring is inside the
           ; <label> tags.
           (caption-parts
             (let* ((caption-match
                      (string-match "<label [^>]+>\\(.*?\\)</label>" caption)))
               (if caption-match
                   (match-string-no-properties 1 caption)
                   "")))
           (source-block-name-match
             (string-match
               (rx-to-string
                 '(and
                       "<code>"
                       (group (+ (not "<")))
                       "</code>"))
               caption-parts))
           ;; A source code block is anonymous if: (1) it does not have a
           ;; "#+name: ..." line, or (2) it does not have a "#+header:
           ;; :noweb-ref ..." line.
           (source-block-name
             (if source-block-name-match
                 (match-string-no-properties 1 caption-parts)
                 "anonymous"))
           ;; This is just used for the side effect of recording the
           ;; source-block-name, to be used for the fallback-id.
           (source-block-counter
            (gethash source-block-name lilac-polyblock-names 0))
           (source-block-counter-incremented
            (puthash source-block-name (1+ source-block-counter)
                     lilac-polyblock-names))
           (source-block-name-styled
             (cond ((string-prefix-p "__NREF__" source-block-name)
                    (concat
                      "<span class=\"lilac-caption-source-code-block-name\">"
                      (string-remove-prefix "__NREF__" source-block-name)
                      "</span>"))
                   (t
                    (concat
                      "<span class=\"lilac-caption-source-code-block-name\">"
                      "&#x1f4c4; "
                      source-block-name
                      "</span>"))))
           (polyblock-chain-total
            (gethash source-block-name lilac-polyblock-names-totals 0))
           (polyblock-chain-location
            (if (= polyblock-chain-total 0)
                ""
              (format "(%s/%s) "
                      source-block-counter-incremented polyblock-chain-total)))
           (polyblock-indicator
             (if (string-match "\(polyblock\)" caption-parts)
                 polyblock-chain-location ""))
           (parent-id-regexp
               (rx-to-string
                 '(and
                       " <a href=\""
                       (group (+ (not "\""))))))
           (parent-ids-with-idx
            (lilac-enumerate
             (lilac-matches parent-id-regexp caption-parts 1) 1))
           (parent-links
             (mapconcat (lambda (parent-id-with-idx)
                          (let ((parent-id (car (cdr parent-id-with-idx)))
                                (idx (car parent-id-with-idx)))
                             (format (concat
                                      "<span class="
                                      "\"lilac-caption-parent-link\">"
                                      "<a href=\"%s\">%s</a></span>")
                               parent-id
                               (if (= idx 1)
                                   (string-remove-prefix
                                    "__NREF__" source-block-name)
                                 idx))))
                        parent-ids-with-idx ""))
           ;; For polyblocks, only the first (head) block gets an id field for a
           ;; <pre> tag. The rest (tail) don't have this field so they would
           ;; normally get assigned a deadlink. To avoid this, use a counter for
           ;; the parent-id, because this parent-id is shared across all
           ;; polyblocks. Then use this with the parent-id to generate an
           ;; alternate, fallback-id. This way the tail polyblocks get assigned
           ;; a unique (meaningful) ID and not just "##deadlink".
           (fallback-id
             (if (string= pre-id "#deadlink")
                 (format "%s-%s"
                         source-block-name
                         source-block-counter-incremented)
                 pre-id))
           (pre-tag-match
             (string-match
               (rx-to-string
                 '(and
                       "<pre "
                       (group (* (not ">")))
                       ">"))
               body))
           (pre-tag-entire (match-string-no-properties 0 body))
           (pre-tag-contents (match-string-no-properties 1 body))
           (body-with-replaced-pre
             (if pre-id-match
                 body-with-newlines
                 (string-replace pre-tag-entire
                                 (concat "<pre " pre-tag-contents
                                         (format " id=\"%s\"" fallback-id) ">")
                                 body-with-newlines)))
           (link-symbol
             (format (concat "<span class=\"lilac-caption-link-symbol\">"
                             "<a href=\"#%s\">&#x1f517;</a></span>")
               fallback-id))
           (caption-without-listing-prefix
            (replace-regexp-in-string "<span.+?span>" "" caption))
           (caption-text
            (if (> (length parent-links) 0)
                (concat
                  "<div class=\"lilac-caption\">"
                    parent-links
                    polyblock-indicator
                    link-symbol
                  "</div>")
                (concat
                  "<div class=\"lilac-caption\">"
                    caption-without-listing-prefix
                    link-symbol
                  "</div>")))
           )
      (if (s-blank? caption)
       src-block-html
       (concat
        leading-div
          "<div class=\"lilac-pre-with-caption\">"
            caption-text
            body-with-replaced-pre
          "</div>"
        "</div>")))))

__NREF__lilac-get-source-block-html-parts-without-newlines
#+end_src

This is a helper function to parse the HTML output for a source code block.

#+name: __NREF__lilac-get-source-block-html-parts-without-newlines
#+begin_src emacs-lisp
(defun lilac-get-source-block-html-parts-without-newlines (src-block-html)
    (let* ((one-line (lilac-to-single-line src-block-html))
           (leading-div
             (let ((div-match
                    (string-match "<div [^>]+>" one-line)))
               (match-string-no-properties 0 one-line)))
           (caption
             (let* ((caption-match
                      (string-match "<label [^>]+>.*?</label>" one-line)))
               (if caption-match
                   (match-string-no-properties 0 one-line)
                   "")))
           (body (progn (string-match "<pre [^>]+>.*?</pre>" one-line)
                        (match-string-no-properties 0 one-line))))
      `(,leading-div ,caption ,body)))
#+end_src

