README.html

<div id="outline-container-h-Pretty-source-code-captions" class="outline-4">
<h4 id="h-Pretty-source-code-captions"><span class="section-number-4">5.6.2.</span> Pretty source code captions</h4>
<div class="outline-text-4" id="text-h-Pretty-source-code-captions">
<p>
Here there are basically 3 things we have to keep track of:
</p>

<ol class="org-ol">
<li>the outer <code>&lt;div&gt;</code> that encloses the entire source code block,</li>
<li>the <code>&lt;label&gt;</code>, if any (it may not exist), and</li>
<li>the <code>&lt;pre&gt;</code> content.</li>
</ol>

<p>
We only care about source code blocks with a <code>&lt;label&gt;</code> because that determines
whether we have a "Listing: &#x2026;" or not. We just need to save the 3 bits of
information, and then:
</p>

<ol class="org-ol">
<li>print the outer <code>&lt;div ...&gt;</code>,</li>
<li>print the <code>&lt;pre&gt;</code> content, and</li>
<li>print the <code>&lt;label&gt;</code> content but as a <code>&lt;div&gt;</code>.</li>
</ol>

<p>
For the last step, we want to additionally parse the inner "Listing N &#x2026; 0 [1 2
3 &#x2026;]" text and transform it with reordering and also additional metadata
information such as <code>&lt;span class="..."&gt;</code> tags.
</p>

<p>
We also save the <code>NSCB_POLYBLOCK_INDICATOR</code> with the <code>polyblock-indicator</code>
variable and display it.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#__NREF__lilac_dot_el-lilac-publish">lilac-prettify-source-code-captions</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__lilac-prettify-source-code-captions">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__lilac-prettify-source-code-captions">(<span class="org-keyword">setq</span> lilac-polyblock-names (make-hash-table <span class="org-builtin">:test</span> 'equal))
(<span class="org-keyword">setq</span> lilac-polyblock-names-totals (make-hash-table <span class="org-builtin">:test</span> 'equal))

(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-prettify-source-code-captions</span> (src-block-html backend info)
  (<span class="org-keyword">when</span> (org-export-derived-backend-p backend 'html)
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Break up source block into 3 subparts --- the leading &lt;div ...&gt;, the</span>
    <span class="org-comment-delimiter">;; </span><span class="org-comment">&lt;label ...&gt;&lt;/label&gt; (if any) and &lt;pre ...&gt;&lt;/pre&gt;.</span>
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Then run the linkifying logic against only the body, and then return the</span>
    <span class="org-comment-delimiter">;; </span><span class="org-comment">original label and new body.</span>
    (<span class="org-keyword">let*</span> ((div-caption-body (lilac-get-source-block-html-parts-without-newlines
                              src-block-html))
           (leading-div (nth 0 div-caption-body))
           (body (nth 2 div-caption-body))
           (pre-id-match
             (string-match
               (rx-to-string
                 '(and
                       <span class="org-string">"&lt;pre "</span>
                       (* (not <span class="org-string">"&gt;"</span>))
                       <span class="org-string">"id=\""</span>
                       (group (+ (not <span class="org-string">"\""</span>)))))
               body))
           (pre-id
             (<span class="org-keyword">if</span> pre-id-match
                 (match-string-no-properties 1 body)
                 <span class="org-string">"#deadlink"</span>))
           (body-with-newlines
            (lilac-to-multi-line body))
           (caption (nth 1 div-caption-body))
           <span class="org-comment-delimiter">; </span><span class="org-comment">caption-parts just captures whatever substring is inside the</span>
           <span class="org-comment-delimiter">; </span><span class="org-comment">&lt;label&gt; tags.</span>
           (caption-parts
             (<span class="org-keyword">let*</span> ((caption-match
                      (string-match <span class="org-string">"&lt;label [</span><span class="org-string"><span class="org-negation-char">^</span></span><span class="org-string">&gt;]+&gt;</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">.*?</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">&lt;/label&gt;"</span> caption)))
               (<span class="org-keyword">if</span> caption-match
                   (match-string-no-properties 1 caption)
                   <span class="org-string">""</span>)))
           (source-block-name-match
             (string-match
               (rx-to-string
                 '(and
                       <span class="org-string">"&lt;code&gt;"</span>
                       (group (+ (not <span class="org-string">"&lt;"</span>)))
                       <span class="org-string">"&lt;/code&gt;"</span>))
               caption-parts))
           <span class="org-comment-delimiter">;; </span><span class="org-comment">A source code block is anonymous if: (1) it does not have a</span>
           <span class="org-comment-delimiter">;; </span><span class="org-comment">"#+name: ..." line, or (2) it does not have a "#+header:</span>
           <span class="org-comment-delimiter">;; </span><span class="org-comment">:noweb-ref ..." line.</span>
           (source-block-name
             (<span class="org-keyword">if</span> source-block-name-match
                 (match-string-no-properties 1 caption-parts)
                 <span class="org-string">"anonymous"</span>))
           <span class="org-comment-delimiter">;; </span><span class="org-comment">This is just used for the side effect of recording the</span>
           <span class="org-comment-delimiter">;; </span><span class="org-comment">source-block-name, to be used for the fallback-id.</span>
           (source-block-counter
            (gethash source-block-name lilac-polyblock-names 0))
           (source-block-counter-incremented
            (puthash source-block-name (+ 1 source-block-counter)
                     lilac-polyblock-names))
           (source-block-name-styled
             (<span class="org-keyword">cond</span> ((string-prefix-p <span class="org-string">"__NREF__"</span> source-block-name)
                    (concat
                      <span class="org-string">"&lt;span class=\"lilac-caption-source-code-block-name\"&gt;"</span>
                      (string-remove-prefix <span class="org-string">"__NREF__"</span> source-block-name)
                      <span class="org-string">"&lt;/span&gt;"</span>))
                   (t
                    (concat
                      <span class="org-string">"&lt;span class=\"lilac-caption-source-code-block-name\"&gt;"</span>
                      <span class="org-string">"&amp;#x1f4c4; "</span>
                      source-block-name
                      <span class="org-string">"&lt;/span&gt;"</span>))))
           (polyblock-chain-total
            (gethash source-block-name lilac-polyblock-names-totals 0))
           (polyblock-chain-location
            (<span class="org-keyword">if</span> (= polyblock-chain-total 0)
                <span class="org-string">""</span>
              (format <span class="org-string">"(%s/%s) "</span>
                      source-block-counter-incremented polyblock-chain-total)))
           (polyblock-indicator
             (<span class="org-keyword">if</span> (string-match <span class="org-string">"</span><span class="org-string"><span class="org-warning">\</span></span><span class="org-string">(polyblock</span><span class="org-string"><span class="org-warning">\</span></span><span class="org-string">)"</span> caption-parts)
                 polyblock-chain-location <span class="org-string">""</span>))
           (parent-id-regexp
               (rx-to-string
                 '(and
                       <span class="org-string">" &lt;a href=\""</span>
                       (group (+ (not <span class="org-string">"\""</span>))))))
           (parent-ids-with-idx
            (lilac-enumerate
             (lilac-matches parent-id-regexp caption-parts 1) 1))
           (parent-links
             (mapconcat (<span class="org-keyword">lambda</span> (parent-id-with-idx)
                          (<span class="org-keyword">let</span> ((parent-id (car (cdr parent-id-with-idx)))
                                (idx (car parent-id-with-idx)))
                             (format (concat
                                      <span class="org-string">"&lt;span class="</span>
                                      <span class="org-string">"\"lilac-caption-parent-link\"&gt;"</span>
                                      <span class="org-string">"&lt;a href=\"%s\"&gt;%s&lt;/a&gt;&lt;/span&gt;"</span>)
                               parent-id
                               (<span class="org-keyword">if</span> (= idx 1)
                                   (string-remove-prefix
                                    <span class="org-string">"__NREF__"</span> source-block-name)
                                 idx))))
                        parent-ids-with-idx <span class="org-string">""</span>))
           <span class="org-comment-delimiter">;; </span><span class="org-comment">For polyblocks, only the first (head) block gets an id field for a</span>
           <span class="org-comment-delimiter">;; </span><span class="org-comment">&lt;pre&gt; tag. The rest (tail) don't have this field so they would</span>
           <span class="org-comment-delimiter">;; </span><span class="org-comment">normally get assigned a deadlink. To avoid this, use a counter for</span>
           <span class="org-comment-delimiter">;; </span><span class="org-comment">the parent-id, because this parent-id is shared across all</span>
           <span class="org-comment-delimiter">;; </span><span class="org-comment">polyblocks. Then use this with the parent-id to generate an</span>
           <span class="org-comment-delimiter">;; </span><span class="org-comment">alternate, fallback-id. This way the tail polyblocks get assigned</span>
           <span class="org-comment-delimiter">;; </span><span class="org-comment">a unique (meaningful) ID and not just "##deadlink".</span>
           (fallback-id
             (<span class="org-keyword">if</span> (string= pre-id <span class="org-string">"#deadlink"</span>)
                 (format <span class="org-string">"%s-%s"</span>
                         source-block-name
                         source-block-counter-incremented)
                 pre-id))
           (pre-tag-match
             (string-match
               (rx-to-string
                 '(and
                       <span class="org-string">"&lt;pre "</span>
                       (group (* (not <span class="org-string">"&gt;"</span>)))
                       <span class="org-string">"&gt;"</span>))
               body))
           (pre-tag-entire (match-string-no-properties 0 body))
           (pre-tag-contents (match-string-no-properties 1 body))
           (body-with-replaced-pre
             (<span class="org-keyword">if</span> pre-id-match
                 body-with-newlines
                 (string-replace pre-tag-entire
                                 (concat <span class="org-string">"&lt;pre "</span> pre-tag-contents
                                         (format <span class="org-string">" id=\"%s\""</span> fallback-id) <span class="org-string">"&gt;"</span>)
                                 body-with-newlines)))
           (link-symbol
             (format (concat <span class="org-string">"&lt;span class=\"lilac-caption-link-symbol\"&gt;"</span>
                             <span class="org-string">"&lt;a href=\"#%s\"&gt;&amp;#x1f517;&lt;/a&gt;&lt;/span&gt;"</span>)
               fallback-id))
           (caption-without-listing-prefix
            (replace-regexp-in-string <span class="org-string">"&lt;span.+?span&gt;"</span> <span class="org-string">""</span> caption))
           (caption-text
            (<span class="org-keyword">if</span> (&gt; (length parent-links) 0)
                (concat
                  <span class="org-string">"&lt;div class=\"lilac-caption\"&gt;"</span>
                    parent-links
                    polyblock-indicator
                    link-symbol
                  <span class="org-string">"&lt;/div&gt;"</span>)
                (concat
                  <span class="org-string">"&lt;div class=\"lilac-caption\"&gt;"</span>
                    caption-without-listing-prefix
                    link-symbol
                  <span class="org-string">"&lt;/div&gt;"</span>)))
           )
      (<span class="org-keyword">if</span> (s-blank? caption)
       src-block-html
       (concat
        leading-div
          <span class="org-string">"&lt;div class=\"lilac-pre-with-caption\"&gt;"</span>
            caption-text
            body-with-replaced-pre
          <span class="org-string">"&lt;/div&gt;"</span>
        <span class="org-string">"&lt;/div&gt;"</span>)))))

<span class="lilac-child-link-from-parent"><a href="#__NREF__lilac-get-source-block-html-parts-without-newlines">lilac-get-source-block-html-parts-without-newlines</a></span>
</pre></div></div><p>
This is a helper function to parse the HTML output for a source code block.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#__NREF__lilac-prettify-source-code-captions">lilac-get-source-block-html-parts-without-newlines</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__lilac-get-source-block-html-parts-without-newlines">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__lilac-get-source-block-html-parts-without-newlines">(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-get-source-block-html-parts-without-newlines</span> (src-block-html)
    (<span class="org-keyword">let*</span> ((one-line (lilac-to-single-line src-block-html))
           (leading-div
             (<span class="org-keyword">let</span> ((div-match
                    (string-match <span class="org-string">"&lt;div [</span><span class="org-string"><span class="org-negation-char">^</span></span><span class="org-string">&gt;]+&gt;"</span> one-line)))
               (match-string-no-properties 0 one-line)))
           (caption
             (<span class="org-keyword">let*</span> ((caption-match
                      (string-match <span class="org-string">"&lt;label [</span><span class="org-string"><span class="org-negation-char">^</span></span><span class="org-string">&gt;]+&gt;.*?&lt;/label&gt;"</span> one-line)))
               (<span class="org-keyword">if</span> caption-match
                   (match-string-no-properties 0 one-line)
                   <span class="org-string">""</span>)))
           (body (<span class="org-keyword">progn</span> (string-match <span class="org-string">"&lt;pre [</span><span class="org-string"><span class="org-negation-char">^</span></span><span class="org-string">&gt;]+&gt;.*?&lt;/pre&gt;"</span> one-line)
                        (match-string-no-properties 0 one-line))))
      `(,leading-div ,caption ,body)))
</pre></div></div>
</div>
</div>
