README.html

<div id="outline-container-h-Link-noweb-references--link-to-child-block-from-parent-block" class="outline-4">
<h4 id="h-Link-noweb-references--link-to-child-block-from-parent-block"><span class="section-number-4">5.6.3.</span> Link noweb references (link to child block from parent block)</h4>
<div class="outline-text-4" id="text-h-Link-noweb-references--link-to-child-block-from-parent-block">
<p>
Consider the following code:
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><label class="org-src-name">Sample Org-mode Noweb-style references</label><span class="lilac-caption-link-symbol"><a href="#Sample-Org-mode-Noweb-style-references-3">&#x1f517;</a></span></div><pre class="src src-org" id="Sample-Org-mode-Noweb-style-references-3"><span class="org-org-meta-line">#+name: parent-block</span>
<span class="org-org-block-begin-line">#+begin_src bash</span>
<span class="org-org-block"><span class="org-builtin">echo</span></span><span class="org-org-block"> </span><span class="org-org-block"><span class="org-string">"Hello from the parent block"</span></span>
<span class="org-org-block">__NREF__child-block-1</span>
<span class="org-org-block">__NREF__child-block-2</span>
<span class="org-org-block-end-line">#+end_src</span>

...

<span class="org-org-meta-line">#+name: __NREF__child-block-1</span>
<span class="org-org-block-begin-line">#+begin_src bash</span>
<span class="org-org-block"><span class="org-builtin">echo</span></span><span class="org-org-block"> </span><span class="org-org-block"><span class="org-string">"I am child 1"</span></span>
<span class="org-org-block-end-line">#+end_src</span>

...

<span class="org-org-meta-line">#+header: :noweb-ref __NREF__child-block-2</span>
<span class="org-org-block-begin-line">#+begin_src bash</span>
<span class="org-org-block"><span class="org-builtin">echo</span></span><span class="org-org-block"> -n </span><span class="org-org-block"><span class="org-string">"I am "</span></span>
<span class="org-org-block-end-line">#+end_src</span>

<span class="org-org-meta-line">#+header: :noweb-ref __NREF__child-block-2</span>
<span class="org-org-block-begin-line">#+begin_src bash</span>
<span class="org-org-block"><span class="org-builtin">echo</span></span><span class="org-org-block"> </span><span class="org-org-block"><span class="org-string">"child 2"</span></span>
<span class="org-org-block-end-line">#+end_src</span>
</pre></div></div><p>
What we want to do is to make the <code>__NREF__child-block-1</code> and
<code>__NREF__child-block-2</code> references inside <code>parent-block</code> to link to their
definitions, so that the reader can just click on them to go to see how they're
defined. Unfortunately Org mode doesn't do this by default so we have to do this
ourselves.
</p>

<p>
In the case of <code>__NREF__child-block-2</code>, it is defined in multiple blocks so we
would want to link to the very first block.
</p>

<p>
We cannot use a <code>org-export-before-parsing-hook</code> like we did in
<a href="#__NREF__lilac-publish-modify-org"><code>__NREF__lilac-publish-modify-org</code></a> because at that stage of processing, we are
dealing with Org mode syntax. Any modifications we make to the parent source
code block will be treated as text upon HTML export. Thankfully Org mode allows
customizations on generated HTML through the
<code>org-export-filter-src-block-functions</code> variable. This variable is analogous to
<code>org-export-before-parsing-hook</code>, but operates at the HTML level (not at the Org
syntax level) for source code blocks, which is exactly what we need.
</p>

<p>
So we have to craft valid HTML links (not Org links) to the child source code
blocks. For this we need the actual <code>id</code> part of the HTML <code>&lt;pre&gt;...</code> block that
will hold the source code. That is, the algorithm should be something like:
</p>

<ol class="org-ol">
<li>for every parent source code block,</li>
<li>for every child block (noweb) referenced in the body, insert an HTML link to
the child block (lookup in <code>child-HTML_ID-hash-table</code>).</li>
</ol>

<p>
The only thing remaining is the construction of <code>child-HTML_ID-hash-table</code>. We
can construct this by mapping through all source code blocks and getting the
name which can be just drawn from the <code>&lt;label ...&gt;</code> HTML tag, thanks to the
smart captions we inserted for all child blocks earlier in <a href="#h-Automatic-captions-for-Noweb-source-code-blocks">5.5.2</a>.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#__NREF__lilac_dot_el-lilac-publish">lilac-html-filter-src-blocks</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__lilac-html-filter-src-blocks">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__lilac-html-filter-src-blocks"><span class="org-comment-delimiter">; </span><span class="org-comment">Define a global hash table for mapping child source block names to their HTML</span>
<span class="org-comment-delimiter">; </span><span class="org-comment">IDs.</span>
(<span class="org-keyword">setq</span> lilac-child-HTML_ID-hash-table (make-hash-table <span class="org-builtin">:test</span> 'equal))

(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-populate-child-HTML_ID-hash-table</span> (src-block-html backend info)
  (<span class="org-keyword">when</span> (org-export-derived-backend-p backend 'html)
    (<span class="org-keyword">let*</span> ((child-name (lilac-get-src-block-name-from-html src-block-html))
           (child-HTML_ID (lilac-get-src-block-HTML_ID src-block-html))
           (child-HTML_ID-exists-already
            (gethash child-name lilac-child-HTML_ID-hash-table nil)))
      <span class="org-comment-delimiter">; </span><span class="org-comment">Skip blocks that lack an HTML ID.</span>
      (<span class="org-keyword">if</span> (<span class="org-keyword">and</span> child-HTML_ID (not child-HTML_ID-exists-already))
        (puthash child-name child-HTML_ID lilac-child-HTML_ID-hash-table))
      <span class="org-comment-delimiter">; </span><span class="org-comment">Return src-block-html as-is (no modifications).</span>
      src-block-html)))

(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-get-src-block-name-from-html</span> (src-block-html)
  (<span class="org-keyword">let*</span> ((match-nref (string-match
                      (concat
                       <span class="org-string">"&lt;label.+?&lt;code&gt;"</span>
                       (lilac-nref-rx nil)
                       <span class="org-string">"&lt;/code&gt;"</span>)
                      src-block-html))
         (match-raw (<span class="org-keyword">if</span> (not match-nref)
                        (string-match
                         (rx-to-string
                          '(and
                            <span class="org-string">"&lt;label"</span>
                            (+ (not <span class="org-string">"&gt;"</span>))
                            <span class="org-string">"&gt;"</span>
                            (group (*? anychar))
                            <span class="org-string">"&lt;/label&gt;"</span>))
                         src-block-html)))
         (matched-contents (match-string-no-properties 1 src-block-html)))
    (<span class="org-keyword">if</span> match-nref
        matched-contents
        (<span class="org-keyword">if</span> match-raw
            (lilac-clean-up-match-raw matched-contents)))))

(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-clean-up-match-raw</span> (s)
  (<span class="org-keyword">let*</span> ((normalized (lilac-normalize-string s))
         (rx (rx-to-string
                '(and
                  <span class="org-string">"Listing-"</span>
                  (+ (any digit))
                  (+ <span class="org-string">"-"</span>)
                  <span class="org-string">"span"</span>
                  (* <span class="org-string">"-"</span>)
                  (group (+ anychar)))))
         (match (string-match rx normalized)))
    (<span class="org-keyword">if</span> match
        (match-string-no-properties 1 normalized)
        normalized)))

<span id="coderef-lilac-get-src-block-HTML_ID" class="coderef-off"></span>
(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-get-src-block-HTML_ID</span> (src-block-html)
  (<span class="org-keyword">let</span> ((match (string-match <span class="org-string">"&lt;pre [</span><span class="org-string"><span class="org-negation-char">^</span></span><span class="org-string">&gt;]+?id=\"</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">(</span></span><span class="org-string">[</span><span class="org-string"><span class="org-negation-char">^</span></span><span class="org-string">\"]+</span><span class="org-string"><span class="org-regexp-grouping-backslash">\\</span></span><span class="org-string"><span class="org-regexp-grouping-construct">)</span></span><span class="org-string">\"&gt;"</span> src-block-html)))
    (<span class="org-keyword">if</span> match (match-string-no-properties 1 src-block-html))))

(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-link-to-children-from-parent-body</span> (src-block-html backend info)
  (<span class="org-keyword">when</span> (org-export-derived-backend-p backend 'html)
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Break up source block into 3 subparts --- the leading &lt;div ...&gt;, the</span>
    <span class="org-comment-delimiter">;; </span><span class="org-comment">&lt;label ...&gt;&lt;/label&gt; (if any) and &lt;pre ...&gt;&lt;/pre&gt;.</span>
    <span class="org-comment-delimiter">;; </span><span class="org-comment">Then run the linkifying logic against only the body, and then return the</span>
    <span class="org-comment-delimiter">;; </span><span class="org-comment">original label and new body.</span>
    (<span class="org-keyword">let*</span> ((div-caption-body (lilac-get-source-block-html-parts-without-newlines
                              src-block-html))
           (leading-div (nth 0 div-caption-body))
           (caption (nth 1 div-caption-body))
           (body (nth 2 div-caption-body))
           (body-linkified-without-newlines
            (replace-regexp-in-string
             (lilac-nref-rx nil)
             (<span class="org-keyword">lambda</span> (child-name-text)
                 (<span class="org-keyword">let*</span> ((HTML_ID (gethash child-name-text
                                          lilac-child-HTML_ID-hash-table)))
                  (<span class="org-keyword">if</span> HTML_ID
                      (concat <span class="org-string">"&lt;span class=\"lilac-child-link-from-parent\"&gt;"</span>
                              <span class="org-string">"&lt;a href=\"#"</span> HTML_ID <span class="org-string">"\"&gt;"</span>
                              (string-remove-prefix <span class="org-string">"__NREF__"</span> child-name-text)
                              <span class="org-string">"&lt;/a&gt;&lt;/span&gt;"</span>)
                      child-name-text)))
             body))
           (body-linkified-with-newlines
            (lilac-to-multi-line body-linkified-without-newlines)))
      (concat leading-div caption body-linkified-with-newlines <span class="org-string">"&lt;/div&gt;"</span>))))

(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-to-single-line</span> (s)
  (replace-regexp-in-string <span class="org-string">"\n"</span> <span class="org-string">"&lt;&lt;&lt;NEWLINE&gt;&gt;&gt;"</span> s))

(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-to-multi-line</span> (s)
  (replace-regexp-in-string <span class="org-string">"&lt;&lt;&lt;NEWLINE&gt;&gt;&gt;"</span> <span class="org-string">"\n"</span> s))

<span class="lilac-child-link-from-parent"><a href="#__NREF__custom-noweb-delimiters">custom-noweb-delimiters</a></span>
</pre></div></div>
</div>
</div>
