README.html

<div id="outline-container-h-Custom-Noweb-delimiters" class="outline-4">
<h4 id="h-Custom-Noweb-delimiters"><span class="section-number-4">5.6.4.</span> Custom Noweb delimiters</h4>
<div class="outline-text-4" id="text-h-Custom-Noweb-delimiters">
<p>
Note that we need to evaluate this lisp code if we want to run <code>C-c C-v t</code> to
tangle code blocks properly in an interactive manner from an Emacs editing
session.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#__NREF__lilac-html-filter-src-blocks">custom-noweb-delimiters</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__custom-noweb-delimiters">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__custom-noweb-delimiters">(<span class="org-keyword">setq</span> org-babel-noweb-wrap-start <span class="org-string">"__NREF__"</span>)
(<span class="org-keyword">setq</span> org-babel-noweb-wrap-end <span class="org-string">""</span>)

(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-nref-rx</span> (match-optional-params)
  (rx-to-string
   (lilac-nref-rx-primitive match-optional-params)))

(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-nref-rx-primitive</span> (match-optional-params)
  (<span class="org-keyword">if</span> match-optional-params
   `(group
           <span class="org-string">"__NREF__"</span>
          <span class="org-comment-delimiter">;; </span><span class="org-comment">Noweb reference must start with a letter...</span>
          (any alpha)
          <span class="org-comment-delimiter">;; </span><span class="org-comment">...and must be followed by</span>
          <span class="org-comment-delimiter">;; </span><span class="org-comment">letters,numbers,dashes,underscores,periods...</span>
          (* (<span class="org-keyword">or</span> (any alnum) <span class="org-string">"-"</span> <span class="org-string">"_"</span> <span class="org-string">"."</span>))
          <span class="org-comment-delimiter">;; </span><span class="org-comment">...and may terminate with a "(...)" where the "..." may be an empty</span>
          <span class="org-comment-delimiter">;; </span><span class="org-comment">string, or some other argument.</span>
          (* (<span class="org-keyword">or</span> <span class="org-string">"()"</span>
                 (<span class="org-keyword">and</span> <span class="org-string">"("</span>
                      (* (not <span class="org-string">")"</span>))
                      <span class="org-string">")"</span>))))
   `(group
          <span class="org-string">"__NREF__"</span>
          (any alpha)
          (* (<span class="org-keyword">or</span> (any alnum) <span class="org-string">"-"</span> <span class="org-string">"_"</span> <span class="org-string">"."</span>)))))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Customize noweb delimiters. Unlike traditional &lt;&lt; and &gt;&gt; delimiters, we just</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">use the "__NREF__" prefix as our only delimiter. This has the advantage of</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">being encoded the same way into HTML, which makes our HTML modifications</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">easier and more consistent across different source code languages.</span>
<span class="org-comment-delimiter">;; </span><span class="org-comment">See https://emacs.stackexchange.com/a/73720/13006.</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">org-babel-noweb-wrap</span> (<span class="org-type">&amp;optional</span> regexp)
  <span class="org-doc">"Return regexp matching a Noweb reference.</span>

<span class="org-doc">Match any reference, or only those matching REGEXP, if non-nil.</span>
<span class="org-doc">When matching, reference is stored in match group 1."</span>
  (lilac-nref-rx t))
</pre></div></div>
</div>
</div>
</div>
