README.html

<div id="outline-container-h-Autogenerate-CSS-for-syntax-highlighting-of-source-code-blocks" class="outline-3">
<h3 id="h-Autogenerate-CSS-for-syntax-highlighting-of-source-code-blocks"><span class="section-number-3">5.7.</span> Autogenerate CSS for syntax highlighting of source code blocks</h3>
<div class="outline-text-3" id="text-h-Autogenerate-CSS-for-syntax-highlighting-of-source-code-blocks">
<p>
See <a href="https://emacs.stackexchange.com/questions/31439/how-to-get-colored-syntax-highlighting-of-code-blocks-in-asynchronous-org-mode-e">this</a>, specifically <a href="https://emacs.stackexchange.com/a/36759">https://emacs.stackexchange.com/a/36759</a>.
</p>

<p>
Generate <code>syntax-highlighting.css</code> and quit emacs. This function is designed to
be run from the command line on a fresh emacs instance (dedicated OS process).
Unfortunately, by itself it is almost useless (see
<a href="#__NREF__enable-syntax-highlighting-from-batch-mode"><code>__NREF__enable-syntax-highlighting-from-batch-mode</code></a>), because there appears to
be a <a href="https://debbugs.gnu.org/cgi/bugreport.cgi?bug=61521">bug</a> in Emacs 28 which <a href="https://emacs.stackexchange.com/questions/75814/org-html-htmlize-generate-css-not-generating-styles">breaks</a> <code>org-html-htmlize-generate-css</code>.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#lilac-el">lilac_dot_el-autogenerate-css</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__lilac_dot_el-autogenerate-css">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__lilac_dot_el-autogenerate-css">(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-gen-css-and-exit</span> ()
  (font-lock-flush)
  (font-lock-fontify-buffer)
  (org-html-htmlize-generate-css)
  (<span class="org-keyword">with-current-buffer</span> <span class="org-string">"*html*"</span>
    (write-file <span class="org-string">"syntax-highlighting.css"</span>))
  (kill-emacs))

<span class="org-comment-delimiter">;; </span><span class="org-comment">Without this, batch-org-gen-css-and-exit produces a near-empty CSS file.</span>
<span class="lilac-child-link-from-parent"><a href="#__NREF__enable-syntax-highlighting-from-batch-mode">enable-syntax-highlighting-from-batch-mode</a></span>
</pre></div></div><p>
Sadly, <code>lilac-gen-css-and-exit</code> by itself generates a near-blank CSS file.
So we have to use code from <a href="https://emacs.stackexchange.com/questions/38437/org-mode-batch-export-missing-syntax-highlighting">here</a>:
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#__NREF__lilac_dot_el-autogenerate-css">enable-syntax-highlighting-from-batch-mode</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__enable-syntax-highlighting-from-batch-mode">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__enable-syntax-highlighting-from-batch-mode">(<span class="org-keyword">require</span> '<span class="org-constant">font-lock</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">subr-x</span>) <span class="org-comment-delimiter">;; </span><span class="org-comment">for `</span><span class="org-comment"><span class="org-constant">when-let</span></span><span class="org-comment">'</span>

(<span class="org-keyword">unless</span> (boundp 'maximal-integer)
  (<span class="org-keyword">defconst</span> <span class="org-variable-name">maximal-integer</span> (lsh -1 -1)
    <span class="org-doc">"Maximal integer value representable natively in emacs lisp."</span>))

(<span class="org-keyword">defun</span> <span class="org-function-name">face-spec-default</span> (spec)
  <span class="org-doc">"Get list containing at most the default entry of face SPEC.</span>
<span class="org-doc">Return nil if SPEC has no default entry."</span>
  (<span class="org-keyword">let*</span> ((first (car-safe spec))
     (display (car-safe first)))
    (<span class="org-keyword">when</span> (eq display 'default)
      (list (car-safe spec)))))

(<span class="org-keyword">defun</span> <span class="org-function-name">face-spec-min-color</span> (display-atts)
  <span class="org-doc">"Get min-color entry of DISPLAY-ATTS pair from face spec."</span>
  (<span class="org-keyword">let*</span> ((display (car-safe display-atts)))
    (<span class="org-keyword">or</span> (car-safe (cdr (assoc 'min-colors display)))
    maximal-integer)))

(<span class="org-keyword">defun</span> <span class="org-function-name">face-spec-highest-color</span> (spec)
  <span class="org-doc">"Search face SPEC for highest color.</span>
<span class="org-doc">That means the DISPLAY entry of SPEC</span>
<span class="org-doc">with class 'color and highest min-color value."</span>
  (<span class="org-keyword">let</span> ((color-list (cl-remove-if-not
             (<span class="org-keyword">lambda</span> (display-atts)
               (<span class="org-keyword">when-let</span> ((display (car-safe display-atts))
                  (class (<span class="org-keyword">and</span> (listp display)
                          (assoc 'class display)))
                  (background (assoc 'background display)))
             (<span class="org-keyword">and</span> (member 'light (cdr background))
                  (member 'color (cdr class)))))
             spec)))
    (cl-reduce (<span class="org-keyword">lambda</span> (display-atts1 display-atts2)
         (<span class="org-keyword">if</span> (&gt; (face-spec-min-color display-atts1)
            (face-spec-min-color display-atts2))
             display-atts1
           display-atts2))
           (cdr color-list)
           <span class="org-builtin">:initial-value</span> (car color-list))))

(<span class="org-keyword">defun</span> <span class="org-function-name">face-spec-t</span> (spec)
  <span class="org-doc">"Search face SPEC for fall back."</span>
  (cl-find-if (<span class="org-keyword">lambda</span> (display-atts)
        (eq (car-safe display-atts) t))
          spec))

<span class="org-comment-delimiter">; </span><span class="org-comment">This is slightly tweaked from the original, because the incoming "face" value</span>
<span class="org-comment-delimiter">; </span><span class="org-comment">can look like (fixed-pitch face-name) --- so we take the second element.</span>
(<span class="org-keyword">defun</span> <span class="org-function-name">my-face-attribute</span> (face attribute <span class="org-type">&amp;optional</span> frame inherit)
  <span class="org-doc">"Get FACE ATTRIBUTE from `</span><span class="org-doc"><span class="org-constant">face-user-default-spec</span></span><span class="org-doc">' and not from</span>
<span class="org-doc">`</span><span class="org-doc"><span class="org-constant">face-attribute</span></span><span class="org-doc">'."</span>
  (<span class="org-keyword">let*</span>
    ((face-spec (face-user-default-spec (<span class="org-keyword">if</span> (listp face)
                                            (car (cdr face))
                                          face)))
     (display-attr (<span class="org-keyword">or</span> (face-spec-highest-color face-spec)
               (face-spec-t face-spec)))
     (attr (cdr display-attr))
     (val (<span class="org-keyword">or</span> (plist-get attr attribute)
              (car-safe (cdr (assoc attribute attr))))))
    (<span class="org-keyword">when</span> (<span class="org-keyword">and</span> (null (eq attribute <span class="org-builtin">:inherit</span>))
           (null val))
      (<span class="org-keyword">let</span> ((inherited-face (my-face-attribute face <span class="org-builtin">:inherit</span>)))
    (<span class="org-keyword">when</span> (<span class="org-keyword">and</span> inherited-face
           (null (eq inherited-face 'unspecified)))
      (<span class="org-keyword">setq</span> val (my-face-attribute inherited-face attribute)))))
    (<span class="org-keyword">or</span> val 'unspecified)))

(advice-add 'face-attribute <span class="org-builtin">:override</span> #'my-face-attribute)
</pre></div></div>
</div>
</div>

<div id="outline-container-h-Misc-settings" class="outline-3">
<h3 id="h-Misc-settings"><span class="section-number-3">5.8.</span> Misc settings</h3>
<div class="outline-text-3" id="text-h-Misc-settings">
</div>

<div id="outline-container-h-Use-HTML5-export--not-XML--to-un-break-MathJax" class="outline-4">
<h4 id="h-Use-HTML5-export--not-XML--to-un-break-MathJax"><span class="section-number-4">5.8.1.</span> Use HTML5 export, not XML (to un-break MathJax)</h4>
<div class="outline-text-4" id="text-h-Use-HTML5-export--not-XML--to-un-break-MathJax">
<p>
By default on Org 9.6, MathJax settings (JavaScript snippet) gets wrapped in a
CDATA tag, and we run into the same problem described on this email that has
gone unanswered:
<a href="https://www.mail-archive.com/emacs-orgmode@gnu.org/msg140821.html">https://www.mail-archive.com/emacs-orgmode@gnu.org/msg140821.html</a>. It appears
that this is because the document is exported as XML, not HTMl. Setting the
document type to <code>html5</code>, as below, appears to make the CDATA tag magically
disappear.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#lilac-el">lilac_dot_el-misc</a></span>(1/4) <span class="lilac-caption-link-symbol"><a href="#__NREF__lilac_dot_el-misc-1">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__lilac_dot_el-misc-1">(<span class="org-keyword">setq</span> org-html-doctype <span class="org-string">"html5"</span>)
</pre></div></div>
</div>
</div>

<div id="outline-container-h-Preserve-leading-whitespace-characters-on-export" class="outline-4">
<h4 id="h-Preserve-leading-whitespace-characters-on-export"><span class="section-number-4">5.8.2.</span> Preserve leading whitespace characters on export</h4>
<div class="outline-text-4" id="text-h-Preserve-leading-whitespace-characters-on-export">
<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#lilac-el">lilac_dot_el-misc</a></span>(2/4) <span class="lilac-caption-link-symbol"><a href="#__NREF__lilac_dot_el-misc-2">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__lilac_dot_el-misc-2">(<span class="org-keyword">setq</span> org-src-preserve-indentation t)
</pre></div></div>
</div>
</div>
