README.org
*** Disable backups

Disable backup files for =lilac.el= (that look like =lilac.el~=) when we invoke
Emacs from the [[Makefile][Makefile]].

#+header: :noweb-ref __NREF__lilac_dot_el-misc
#+begin_src emacs-lisp
(setq make-backup-files nil)
#+end_src

*** Profiling

We don't use this very often, but it's mainly for determining cost centers for
weaving and tangling.

#+header: :noweb-ref __NREF__lilac_dot_el-misc
#+begin_src emacs-lisp
(defun lilac-publish-profile ()
  (interactive)
  (profiler-start 'cpu)
  (lilac-publish)
  (profiler-stop)
  (profiler-report)
  (profiler-report-write-profile "emacs-profile-weave.txt") t)

(defun lilac-tangle-profile ()
  (interactive)
  (profiler-start 'cpu)
  (org-babel-tangle)
  (profiler-stop)
  (profiler-report)
  (profiler-report-write-profile "emacs-profile-tangle.txt") t)
#+end_src

** Automatically link headlines (h2 to h6)

Every HTML element =h2= to =h6= (which encode the Org mode headlines) already
come with a unique ID, but they are only ever linked from the Table of Contents.
The code here makes it so that the headlines are linked to themselves, which
makes it easy for users to link to them directly when they're reading the page.

The JavaScript below is taken from [[https://github.com/listx/listx_blog/blame/8e6e7b533d89f77a6939e5eda9fd9d990d25a7a9/misc.js#L1][here]].

#+name: misc.js
#+caption: misc.js
#+begin_src js :tangle misc.js :eval no
$(function() {
    $("h2,h3,h4,h5,h6").each(function() {
        var $this = $(this);
        var href = $this.attr("id");
        $this.wrapInner(
            $("<a/>").attr("href", '#' + href)
                     .addClass("section-heading"));
    });
});
#+end_src

Now we just have to refer to the above in the snippet below, to be included in [[* Create
=lilac.theme= file][=lilac.theme=]].

#+name: __NREF__automatically_link_headlines
#+begin_src org
# Automatically link headlines.
,#+HTML_HEAD: <script src="https://code.jquery.com/jquery-3.6.4.min.js"></script>
,#+HTML_HEAD: <script src="misc.js"></script>
#+end_src

Linkifying itself makes all the headlines blue (the default color for links).
This is a bit distracting, so make them black.

#+name: __NREF__css-source-code-section-headlines
#+begin_src css
a.section-heading {
    color: black;
    text-decoration: none;
}

a.section-heading:hover::after {
    float: left;
    margin-left: -1.3em;
    content: "\1f517";
}
#+end_src

** Imports

If we want syntax-highlighting to work for a code block, that code block's major
mode (language) must be loaded in here.

#+name: __NREF__lilac_dot_el-imports
#+begin_src emacs-lisp
;; Built-in packages (distributed with Emacs).
(require 'elisp-mode)

;; Third-party packages (checked in as Git submodules)
(add-to-list 'load-path (concat (getenv "PWD") "/deps/elisp/s.el"))
(require 's)
(add-to-list 'load-path (concat (getenv "PWD") "/deps/elisp/compat.el"))
(require 'compat)
(add-to-list 'load-path (concat (getenv "PWD") "/deps/elisp/dash.el"))
(require 'dash)
(add-to-list 'load-path (concat (getenv "PWD") "/deps/elisp/dr-qubit.org"))
(add-to-list 'load-path (concat (getenv "PWD") "/deps/elisp/f.el"))
(add-to-list 'load-path (concat (getenv "PWD") "/deps/elisp/parsebib"))
(add-to-list 'load-path (concat (getenv "PWD") "/deps/elisp/citeproc-el"))
(require 'citeproc)
(require 'oc-csl)
(add-to-list 'load-path (concat (getenv "PWD") "/deps/elisp/emacs-htmlize"))
(require 'htmlize)
(add-to-list 'load-path (concat (getenv "PWD") "/deps/elisp/magit/lisp"))
(require 'magit-section)
(add-to-list 'load-path (concat (getenv "PWD") "/deps/elisp/nix-mode"))
(require 'nix-mode)
#+end_src

