README.html

<div id="outline-container-h-Disable-backups" class="outline-4">
<h4 id="h-Disable-backups"><span class="section-number-4">5.8.3.</span> Disable backups</h4>
<div class="outline-text-4" id="text-h-Disable-backups">
<p>
Disable backup files for <code>lilac.el</code> (that look like <code>lilac.el~</code>) when we invoke
Emacs from the <a href="#Makefile">Makefile</a>.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#lilac-el">lilac_dot_el-misc</a></span>(3/4) <span class="lilac-caption-link-symbol"><a href="#__NREF__lilac_dot_el-misc-3">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__lilac_dot_el-misc-3">(<span class="org-keyword">setq</span> make-backup-files nil)
</pre></div></div>
</div>
</div>

<div id="outline-container-h-Profiling" class="outline-4">
<h4 id="h-Profiling"><span class="section-number-4">5.8.4.</span> Profiling</h4>
<div class="outline-text-4" id="text-h-Profiling">
<p>
We don't use this very often, but it's mainly for determining cost centers for
weaving and tangling.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#lilac-el">lilac_dot_el-misc</a></span>(4/4) <span class="lilac-caption-link-symbol"><a href="#__NREF__lilac_dot_el-misc-4">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__lilac_dot_el-misc-4">(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-publish-profile</span> ()
  (<span class="org-keyword">interactive</span>)
  (profiler-start 'cpu)
  (lilac-publish)
  (profiler-stop)
  (profiler-report)
  (profiler-report-write-profile <span class="org-string">"emacs-profile-weave.txt"</span>) t)

(<span class="org-keyword">defun</span> <span class="org-function-name">lilac-tangle-profile</span> ()
  (<span class="org-keyword">interactive</span>)
  (profiler-start 'cpu)
  (org-babel-tangle)
  (profiler-stop)
  (profiler-report)
  (profiler-report-write-profile <span class="org-string">"emacs-profile-tangle.txt"</span>) t)
</pre></div></div>
</div>
</div>
</div>

<div id="outline-container-h-Automatically-link-headlines--h2-to-h6" class="outline-3">
<h3 id="h-Automatically-link-headlines--h2-to-h6"><span class="section-number-3">5.9.</span> Automatically link headlines (h2 to h6)</h3>
<div class="outline-text-3" id="text-h-Automatically-link-headlines--h2-to-h6">
<p>
Every HTML element <code>h2</code> to <code>h6</code> (which encode the Org mode headlines) already
come with a unique ID, but they are only ever linked from the Table of Contents.
The code here makes it so that the headlines are linked to themselves, which
makes it easy for users to link to them directly when they're reading the page.
</p>

<p>
The JavaScript below is taken from <a href="https://github.com/listx/listx_blog/blame/8e6e7b533d89f77a6939e5eda9fd9d990d25a7a9/misc.js#L1">here</a>.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><label class="org-src-name">misc.js</label><span class="lilac-caption-link-symbol"><a href="#misc-js">&#x1f517;</a></span></div><pre class="src src-js" id="misc-js">$(<span class="org-keyword">function</span>() {
    $(<span class="org-string">"h2,h3,h4,h5,h6"</span>).each(<span class="org-keyword">function</span>() {
        <span class="org-keyword">var</span> <span class="org-variable-name">$this</span> = $(<span class="org-constant">this</span>);
        <span class="org-keyword">var</span> <span class="org-variable-name">href</span> = $this.attr(<span class="org-string">"id"</span>);
        $this.wrapInner(
            $(<span class="org-string">"&lt;a/&gt;"</span>).attr(<span class="org-string">"href"</span>, <span class="org-string">'#'</span> + href)
                     .addClass(<span class="org-string">"section-heading"</span>));
    });
});
</pre></div></div><p>
Now we just have to refer to the above in the snippet below, to be included in <a href="#h-Create--lilac-theme--file"><code>lilac.theme</code></a>.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#lilac-theme">automatically_link_headlines</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__automatically_link_headlines">&#x1f517;</a></span></div><pre class="src src-org" id="__NREF__automatically_link_headlines"><span class="org-comment"># Automatically link headlines.</span>
<span class="org-org-meta-line">#+HTML_HEAD: &lt;script src="<a href="https://code.jquery.com/jquery-3.6.4.min.js">https://code.jquery.com/jquery-3.6.4.min.js</a>"&gt;&lt;/script&gt;</span>
<span class="org-org-meta-line">#+HTML_HEAD: &lt;script src="misc.js"&gt;&lt;/script&gt;</span>
</pre></div></div><p>
Linkifying itself makes all the headlines blue (the default color for links).
This is a bit distracting, so make them black.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#style-css">css-source-code-section-headlines</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__css-source-code-section-headlines">&#x1f517;</a></span></div><pre class="src src-css" id="__NREF__css-source-code-section-headlines"><span class="org-css-selector">a.section-heading </span>{
    <span class="org-css-property">color</span>: <span class="custom">black</span>;
    <span class="org-css-property">text-decoration</span>: none;
}

<span class="org-css-selector">a.section-heading:hover::after </span>{
    <span class="org-css-property">float</span>: left;
    <span class="org-css-property">margin-left</span>: -1.3em;
    <span class="org-css-property">content</span>: <span class="org-string">"\1f517"</span>;
}
</pre></div></div>
</div>
</div>

<div id="outline-container-h-Imports" class="outline-3">
<h3 id="h-Imports"><span class="section-number-3">5.10.</span> Imports</h3>
<div class="outline-text-3" id="text-h-Imports">
<p>
If we want syntax-highlighting to work for a code block, that code block's major
mode (language) must be loaded in here.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#lilac-el">lilac_dot_el-imports</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__lilac_dot_el-imports">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__lilac_dot_el-imports"><span class="org-comment-delimiter">;; </span><span class="org-comment">Built-in packages (distributed with Emacs).</span>
(<span class="org-keyword">require</span> '<span class="org-constant">elisp-mode</span>)

<span class="org-comment-delimiter">;; </span><span class="org-comment">Third-party packages (checked in as Git submodules)</span>
(add-to-list 'load-path (concat (getenv <span class="org-string">"PWD"</span>) <span class="org-string">"/deps/elisp/s.el"</span>))
(<span class="org-keyword">require</span> '<span class="org-constant">s</span>)
(add-to-list 'load-path (concat (getenv <span class="org-string">"PWD"</span>) <span class="org-string">"/deps/elisp/compat.el"</span>))
(<span class="org-keyword">require</span> '<span class="org-constant">compat</span>)
(add-to-list 'load-path (concat (getenv <span class="org-string">"PWD"</span>) <span class="org-string">"/deps/elisp/dash.el"</span>))
(<span class="org-keyword">require</span> '<span class="org-constant">dash</span>)
(add-to-list 'load-path (concat (getenv <span class="org-string">"PWD"</span>) <span class="org-string">"/deps/elisp/dr-qubit.org"</span>))
(add-to-list 'load-path (concat (getenv <span class="org-string">"PWD"</span>) <span class="org-string">"/deps/elisp/f.el"</span>))
(add-to-list 'load-path (concat (getenv <span class="org-string">"PWD"</span>) <span class="org-string">"/deps/elisp/parsebib"</span>))
(add-to-list 'load-path (concat (getenv <span class="org-string">"PWD"</span>) <span class="org-string">"/deps/elisp/citeproc-el"</span>))
(<span class="org-keyword">require</span> '<span class="org-constant">citeproc</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">oc-csl</span>)
(add-to-list 'load-path (concat (getenv <span class="org-string">"PWD"</span>) <span class="org-string">"/deps/elisp/emacs-htmlize"</span>))
(<span class="org-keyword">require</span> '<span class="org-constant">htmlize</span>)
(add-to-list 'load-path (concat (getenv <span class="org-string">"PWD"</span>) <span class="org-string">"/deps/elisp/magit/lisp"</span>))
(<span class="org-keyword">require</span> '<span class="org-constant">magit-section</span>)
(add-to-list 'load-path (concat (getenv <span class="org-string">"PWD"</span>) <span class="org-string">"/deps/elisp/nix-mode"</span>))
(<span class="org-keyword">require</span> '<span class="org-constant">nix-mode</span>)
</pre></div></div>
</div>
</div>
