README.html

<div id="outline-container-h-Additional--hand-tweaked--CSS" class="outline-3">
<h3 id="h-Additional--hand-tweaked--CSS"><span class="section-number-3">5.11.</span> Additional (hand-tweaked) CSS</h3>
<div class="outline-text-3" id="text-h-Additional--hand-tweaked--CSS">
<p>
We add some additional CSS tweaks on top of what we get from Org.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><label class="org-src-name">style.css</label><span class="lilac-caption-link-symbol"><a href="#style-css">&#x1f517;</a></span></div><pre class="src src-css" id="style-css"><span class="org-css-selector">a </span>{
    <span class="org-css-property">color</span>: <span class="custom-2">#0000ff</span>;
}

<span class="org-css-selector">body </span>{
    <span class="org-css-property">font-size</span>: 1.5em;
    <span class="org-css-property">width</span>: 1000px;
    <span class="org-css-property">margin</span>: auto;
}

<span class="org-css-selector">body, p, li, h1, h2, h3, h4, h5, h6, legend </span>{
    <span class="org-css-property">font-family</span>: <span class="org-string">"Source Serif Pro"</span>, serif;
}

<span class="org-css-selector">p, li </span>{
    <span class="org-css-property">line-height</span>: 1.2em;
}

<span class="org-css-selector">p, ol, ul </span>{
    <span class="org-css-property">margin-bottom</span>: 0.5em;
}

<span class="org-css-selector">li </span>{
    <span class="org-css-property">margin-bottom</span>: 0;
}

<span class="org-css-selector">table </span>{
    <span class="org-css-property">margin</span>: 1em auto 0em auto;
    <span class="org-css-property">border-spacing</span>: 0;
    <span class="org-css-property">border-radius</span>: 4px;
    <span class="org-css-property">border</span>: 1px solid <span class="custom-1">#777</span>;
    <span class="org-css-property">border-collapse</span>: unset;
}

<span class="org-css-selector">th, td </span>{
    <span class="org-css-property">padding</span>: 3px 6px;
    <span class="org-css-property">border-right</span>: 1px solid <span class="custom-1">#777</span>;
    <span class="org-css-property">border-bottom</span>: 1px solid <span class="custom-1">#777</span>;
}

<span class="org-css-selector">th:last-child, td:last-child  </span>{
    <span class="org-css-property">border-right</span>: none;
}

<span class="org-css-selector">tr:last-child td </span>{
    <span class="org-css-property">border-bottom</span>: none;
}

<span class="org-comment-delimiter">/* </span><span class="org-comment">Center all images.</span><span class="org-comment-delimiter"> */</span>
<span class="org-css-selector">img </span>{
    <span class="org-css-property">display</span>: block;
    <span class="org-css-property">margin</span>: 0 auto;
}

<span class="org-comment-delimiter">/* </span><span class="org-comment">Increase text size for smaller sections.</span><span class="org-comment-delimiter"> */</span>
<span class="org-css-selector">h3, h4, h5, h6 </span>{
    <span class="org-css-property">margin-top</span>: 1em;
    <span class="org-css-property">margin-bottom</span>: 1em;
}
<span class="org-css-selector">h7 </span>{
    <span class="org-css-property">font-weight</span>: bold;
    <span class="org-css-property">font-size</span>: 18pt;
}
<span class="org-css-selector">.outline-7 </span>{
    <span class="org-css-property">margin-top</span>: 1em;
}

<span class="org-css-selector">code </span>{
    <span class="org-css-property">background</span>: <span class="custom">#eee</span>;
    <span class="org-css-property">padding-left</span>: 5px;
    <span class="org-css-property">padding-right</span>: 5px;
    <span class="org-css-property">white-space</span>: nowrap;
    <span class="org-css-property">border-radius</span>: 4px;
    <span class="org-css-property">border-style</span>: solid;
    <span class="org-css-property">border-width</span>: 1px;
    <span class="org-css-property">border-color</span>: <span class="custom-1">#777</span>;
}

<span class="org-css-selector">thead </span>{
    <span class="org-css-property">background</span>: <span class="custom">#eee</span>;
}

<span class="org-css-selector">pre </span>{
    <span class="org-css-property">font-size</span>: 0.8em;
    <span class="org-css-property">border-top-left-radius</span>: 0;
    <span class="org-css-property">border-top-right-radius</span>: 0;
    <span class="org-css-property">border-bottom-left-radius</span>: 5px;
    <span class="org-css-property">border-bottom-right-radius</span>: 5px;
}

<span class="lilac-child-link-from-parent"><a href="#__NREF__css-source-code-section-headlines">css-source-code-section-headlines</a></span>
<span class="lilac-child-link-from-parent"><a href="#__NREF__css-source-code-block-body">css-source-code-block-body</a></span>
<span class="lilac-child-link-from-parent"><a href="#__NREF__css-source-code-block-captions">css-source-code-block-captions</a></span>
<span class="lilac-child-link-from-parent"><a href="#__NREF__css-source-code-block-child-link-from-parent">css-source-code-block-child-link-from-parent</a></span>
</pre></div></div>
</div>

<div id="outline-container-h-Source-code-block-body" class="outline-4">
<h4 id="h-Source-code-block-body"><span class="section-number-4">5.11.1.</span> Source code block body</h4>
<div class="outline-text-4" id="text-h-Source-code-block-body">
<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#style-css">css-source-code-block-body</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__css-source-code-block-body">&#x1f517;</a></span></div><pre class="src src-css" id="__NREF__css-source-code-block-body"><span class="org-css-selector">.org-src-container </span>{
    <span class="org-css-property">margin</span>: 1em 0;
}

<span class="org-css-selector">.org-src-container pre </span>{
    <span class="org-css-property">margin</span>: 0;
    <span class="org-css-property">font-family</span>: <span class="org-string">"Source Code Pro"</span>, monospace;
    <span class="org-css-property">border-width</span>: 0;
    <span class="org-css-property">scroll-margin-top</span>: 100px;
    <span class="org-css-property">border-style</span>: solid;
    <span class="org-css-property">border-width</span>: 2px;
    <span class="org-css-property">border-color</span>: <span class="custom-1">#999</span>;
    <span class="org-css-property">border-radius</span>: 5px;
}

<span class="org-comment-delimiter">/* </span><span class="org-comment">Source code block body.</span><span class="org-comment-delimiter"> */</span>
<span class="org-css-selector">.org-src-container pre.src </span>{
    <span class="org-css-property">background-color</span>: <span class="custom">#f3f3f3</span>;
}

</pre></div></div>
</div>
</div>

<div id="outline-container-h-Source-code-block-captions" class="outline-4">
<h4 id="h-Source-code-block-captions"><span class="section-number-4">5.11.2.</span> Source code block captions</h4>
<div class="outline-text-4" id="text-h-Source-code-block-captions">
<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#style-css">css-source-code-block-captions</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__css-source-code-block-captions">&#x1f517;</a></span></div><pre class="src src-css" id="__NREF__css-source-code-block-captions"><span class="org-css-selector">.lilac-caption </span>{
    <span class="org-css-property">font-family</span>: <span class="org-string">"Source Code Pro"</span>, monospace;
    <span class="org-css-property">text-align</span>: right;
    <span class="org-css-property">border-top-left-radius</span>: 5px;
    <span class="org-css-property">border-top-right-radius</span>: 5px;
    <span class="org-css-property">padding-top</span>: 2px;
    <span class="org-css-property">padding-bottom</span>: 5px;
}

<span class="org-css-selector">.lilac-caption label </span>{
    <span class="org-css-property">margin-right</span>: 10px;
    <span class="org-css-property">padding-left</span>: 10px;
    <span class="org-css-property">padding-right</span>: 10px;
    <span class="org-css-property">padding-bottom</span>: 10px;
    <span class="org-css-property">border-radius</span>: 5px;
    <span class="org-css-property">border-style</span>: solid;
    <span class="org-css-property">border-bottom-style</span>: none;
    <span class="org-css-property">border-bottom-left-radius</span>: 0;
    <span class="org-css-property">border-bottom-right-radius</span>: 0;
    <span class="org-css-property">background-color</span>: <span class="custom-6">#ddd</span>;
    <span class="org-css-property">border-color</span>: <span class="custom-5">#999</span>;
}

<span class="org-css-selector">.lilac-caption-source-code-block-name </span>{
    <span class="org-css-property">color</span>: <span class="custom-4">#444444</span>;
    <span class="org-css-property">font-weight</span>: bold;
    <span class="org-css-property">margin-right</span>: 5px;
}

<span class="org-css-selector">.lilac-caption-parent-link </span>{
    <span class="org-css-property">margin-top</span>: 5px;
    <span class="org-css-property">margin-right</span>: 5px;
    <span class="org-css-property">padding-left</span>: 5px;
    <span class="org-css-property">padding-right</span>: 5px;
    <span class="org-css-property">font-weight</span>: bold;
}
<span class="org-css-selector">.lilac-caption-parent-link a </span>{
    <span class="org-css-property">padding-left</span>: 10px;
    <span class="org-css-property">padding-right</span>: 10px;
    <span class="org-css-property">padding-bottom</span>: 10px;
    <span class="org-css-property">color</span>: <span class="custom-3">#21618c</span>;
    <span class="org-css-property">background-color</span>: <span class="custom-2">#d8f6ff</span>;
    <span class="org-css-property">border-radius</span>: 5px;
    <span class="org-css-property">border-style</span>: solid;
    <span class="org-css-property">border-bottom-style</span>: none;
    <span class="org-css-property">border-bottom-left-radius</span>: 0;
    <span class="org-css-property">border-bottom-right-radius</span>: 0;
}
<span class="org-css-selector">.lilac-caption-parent-link a:hover </span>{
    <span class="org-css-property">color</span>: <span class="custom-1">#7d3c98</span>;
    <span class="org-css-property">background-color</span>: <span class="custom">#f8e9ff</span>;
    <span class="org-css-property">text-decoration</span>: none;
}

<span class="org-css-selector">.lilac-caption-link-symbol a </span>{
    <span class="org-css-property">margin-right</span>: 5px;
}
<span class="org-css-selector">.lilac-caption-link-symbol a:hover </span>{
    <span class="org-css-property">text-decoration</span>: none;
}

<span class="org-css-selector">.lilac-caption-listing-number </span>{
    <span class="org-css-property">margin-right</span>: 5px;
}
</pre></div></div>
</div>
</div>
