README.org
*** Links to child source block from parent

#+name: __NREF__css-source-code-block-child-link-from-parent
#+begin_src css
.lilac-child-link-from-parent {
    font-weight: bold;
}
.lilac-child-link-from-parent a {
    color: #21618c;
    background-color: #d8f6ff;
    border-radius: 5px;
    border-style: solid;
    margin: 5px 0;
    padding: 2px 5px;
    display: inline-block;
}
.lilac-child-link-from-parent a:hover {
    color: #7d3c98;
    background-color: #f8e9ff;
    text-decoration: none;
}
#+end_src

** Create =lilac.theme= file

Allow HTML exports of Org files (inluding this one) to pull in CSS and
JavaScript that we've defined for Lilac by referring to a single theme file. The
inspiration for this setup comes from https://gitlab.com/OlMon/org-themes.

#+name: lilac.theme
#+caption: lilac.theme
#+begin_src org :tangle lilac.theme :eval no
# Include additional CSS styles.
,#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="syntax-highlighting.css"/>
,#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="style.css" />
,#+HTML_HEAD: <link rel="stylesheet" href="https://fonts.googleapis.com/css2?family=Source+Serif+Pro&family=Source+Code+Pro">

__NREF__automatically_link_headlines
#+end_src

** Ignore woven HTML from =git diff=

Typically we only need to look at the rendered HTML output in a web browser as
the raw HTML diff output is extremely difficult to parse as a human. So by
default we ask Git to exclude it from =git diff= by treating them as binary
data.

#+name: .gitattributes
#+caption: .gitattributes
#+begin_src gitattributes :tangle .gitattributes :eval no
,* -diff
,**/*.org diff
,**/.gitattributes diff
,**/.gitmodules diff
,**/.gitignore diff
package/nix/sources.json diff
package/nix/sources.nix diff
#+end_src

In order to still show the HTML textual diff, we can run =git diff --text=.

*** =git add -p=

Note that the above setting to treat HTML files as binary data prevents them
from being considered for =git add -p=. In order to add them, use =git add -u=
instead.

** gitignore

#+name: .gitignore
#+caption: .gitignore
#+begin_src gitignore :tangle .gitignore :eval no
,**/*.auctex-auto
tangle
update-deps
weave
#+end_src

* Tangling (generating the source code)

Tangling is simply the act of collecting the =#+begin_src ... #+end_src= blocks
and arranging them into the various target (source code) files. Every source
code block is given a unique name.

We simply tangle the =README.org= file (this file) to get all the code we need.

* Development environment (Nix shell)

This is the main development shell and brings in all of our dependencies to
build all of our code. Taken from [[https://github.com/tweag/haskell-stack-nix-example/blob/b9383e35416a2b0e21fbc97ed079538f9f395b6a/shell.nix#L1][here]]. The =Makefile= is meant to be executed
from within this environment.

#+name: shell.nix
#+caption: shell.nix
#+begin_src nix :tangle shell.nix :eval no
let
  # Nixpkgs snapshot.
  sources = import ./package/nix/sources.nix;
  # The final "pkgs" attribute.
  pkgs = import sources.nixpkgs {};
in

# This is our development shell.
pkgs.mkShell ({
  buildInputs = [
    # Tangling and weaving for Literate Programming.
    pkgs.emacs

    # Update Nix dependencies in package/nix/sources.nix.
    pkgs.niv

    # Misc.
    pkgs.git
    pkgs.less
  ];
})
#+end_src

* Tests

We use [[https://www.gnu.org/software/emacs/manual/ert.html][ERT, the Emacs Lisp Regression Testing tool]] for our unit tests. Pure
functions that take all of their inputs explicitly ("dependency-injected") are
easy to test because we just provide the various inputs and expect the function
to produce certain outputs. For functions that operate on an Emacs buffer, we
use =with-temp-buffer= to create a temporary buffer first before invoking the
functions under test.

Some functions we test expect Org mode to be active (so that certain Org mode
functions are available), so we turn it on here by calling =(org-mode)=.

#+name: lilac-tests.el
#+caption: lilac-tests.el
#+begin_src emacs-lisp :tangle lilac-tests.el :eval no
(require 'ert)
(require 'lilac)

(org-mode)

__NREF__t-helpers
__NREF__t-smart-caption-generation

(provide 'lilac-tests)
#+end_src

** Test helpers

Note that we cannot write =__NREF__foo= directly in the test code here, because
when this Org file is tangled, the references will be detected and Org mode will
try to replace them with a monoblock or polyblock elsewhere in this file named
=__NREF__foo=. So we have to go in "stealth mode" by writing the =__NREF__=
prefix indirectly with the =(nref)= helper function.

#+name: __NREF__t-helpers
#+begin_src emacs-lisp
(defun nref (s) (concat "__NREF__" s))
#+end_src

