README.html

<div id="outline-container-h-Links-to-child-source-block-from-parent" class="outline-4">
<h4 id="h-Links-to-child-source-block-from-parent"><span class="section-number-4">5.11.3.</span> Links to child source block from parent</h4>
<div class="outline-text-4" id="text-h-Links-to-child-source-block-from-parent">
<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#style-css">css-source-code-block-child-link-from-parent</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__css-source-code-block-child-link-from-parent">&#x1f517;</a></span></div><pre class="src src-css" id="__NREF__css-source-code-block-child-link-from-parent"><span class="org-css-selector">.lilac-child-link-from-parent </span>{
    <span class="org-css-property">font-weight</span>: bold;
}
<span class="org-css-selector">.lilac-child-link-from-parent a </span>{
    <span class="org-css-property">color</span>: <span class="custom-3">#21618c</span>;
    <span class="org-css-property">background-color</span>: <span class="custom-2">#d8f6ff</span>;
    <span class="org-css-property">border-radius</span>: 5px;
    <span class="org-css-property">border-style</span>: solid;
    <span class="org-css-property">margin</span>: 5px 0;
    <span class="org-css-property">padding</span>: 2px 5px;
    <span class="org-css-property">display</span>: inline-block;
}
<span class="org-css-selector">.lilac-child-link-from-parent a:hover </span>{
    <span class="org-css-property">color</span>: <span class="custom-1">#7d3c98</span>;
    <span class="org-css-property">background-color</span>: <span class="custom">#f8e9ff</span>;
    <span class="org-css-property">text-decoration</span>: none;
}
</pre></div></div>
</div>
</div>
</div>

<div id="outline-container-h-Create--lilac-theme--file" class="outline-3">
<h3 id="h-Create--lilac-theme--file"><span class="section-number-3">5.12.</span> Create <code>lilac.theme</code> file</h3>
<div class="outline-text-3" id="text-h-Create--lilac-theme--file">
<p>
Allow HTML exports of Org files (inluding this one) to pull in CSS and
JavaScript that we've defined for Lilac by referring to a single theme file. The
inspiration for this setup comes from <a href="https://gitlab.com/OlMon/org-themes">https://gitlab.com/OlMon/org-themes</a>.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><label class="org-src-name">lilac.theme</label><span class="lilac-caption-link-symbol"><a href="#lilac-theme">&#x1f517;</a></span></div><pre class="src src-org" id="lilac-theme"><span class="org-comment"># Include additional CSS styles.</span>
<span class="org-org-meta-line">#+HTML_HEAD: &lt;link rel="stylesheet" type="text/css" href="syntax-highlighting.css"/&gt;</span>
<span class="org-org-meta-line">#+HTML_HEAD: &lt;link rel="stylesheet" type="text/css" href="style.css" /&gt;</span>
<span class="org-org-meta-line">#+HTML_HEAD: &lt;link rel="stylesheet" href="<a href="https://fonts.googleapis.com/css2?family=Source+Serif+Pro&amp;family=Source+Code+Pro">https://fonts.googleapis.com/css2?family=Source+Serif+Pro&amp;family=Source+Code+Pro</a>"&gt;</span>

<span class="lilac-child-link-from-parent"><a href="#__NREF__automatically_link_headlines">automatically_link_headlines</a></span>
</pre></div></div>
</div>
</div>

<div id="outline-container-h-Ignore-woven-HTML-from--git-diff" class="outline-3">
<h3 id="h-Ignore-woven-HTML-from--git-diff"><span class="section-number-3">5.13.</span> Ignore woven HTML from <code>git diff</code></h3>
<div class="outline-text-3" id="text-h-Ignore-woven-HTML-from--git-diff">
<p>
Typically we only need to look at the rendered HTML output in a web browser as
the raw HTML diff output is extremely difficult to parse as a human. So by
default we ask Git to exclude it from <code>git diff</code> by treating them as binary
data.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><label class="org-src-name">.gitattributes</label><span class="lilac-caption-link-symbol"><a href="#gitattributes">&#x1f517;</a></span></div><pre class="src src-gitattributes" id="gitattributes">* -diff
**/*.org diff
**/.gitattributes diff
**/.gitmodules diff
**/.gitignore diff
package/nix/sources.json diff
package/nix/sources.nix diff
</pre></div></div><p>
In order to still show the HTML textual diff, we can run <code>git diff --text</code>.
</p>
</div>

<div id="outline-container-h-git-add--p" class="outline-4">
<h4 id="h-git-add--p"><span class="section-number-4">5.13.1.</span> <code>git add -p</code></h4>
<div class="outline-text-4" id="text-h-git-add--p">
<p>
Note that the above setting to treat HTML files as binary data prevents them
from being considered for <code>git add -p</code>. In order to add them, use <code>git add -u</code>
instead.
</p>
</div>
</div>
</div>

<div id="outline-container-h-gitignore" class="outline-3">
<h3 id="h-gitignore"><span class="section-number-3">5.14.</span> gitignore</h3>
<div class="outline-text-3" id="text-h-gitignore">
<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><label class="org-src-name">.gitignore</label><span class="lilac-caption-link-symbol"><a href="#gitignore">&#x1f517;</a></span></div><pre class="src src-gitignore" id="gitignore">**/*.auctex-auto
tangle
update-deps
weave
</pre></div></div>
</div>
</div>
</div>

<div id="outline-container-h-Tangling--generating-the-source-code" class="outline-2">
<h2 id="h-Tangling--generating-the-source-code"><span class="section-number-2">6.</span> Tangling (generating the source code)</h2>
<div class="outline-text-2" id="text-h-Tangling--generating-the-source-code">
<p>
Tangling is simply the act of collecting the <code>#+begin_src ... #+end_src</code> blocks
and arranging them into the various target (source code) files. Every source
code block is given a unique name.
</p>

<p>
We simply tangle the <code>README.org</code> file (this file) to get all the code we need.
</p>
</div>
</div>

<div id="outline-container-h-Development-environment--Nix-shell" class="outline-2">
<h2 id="h-Development-environment--Nix-shell"><span class="section-number-2">7.</span> Development environment (Nix shell)</h2>
<div class="outline-text-2" id="text-h-Development-environment--Nix-shell">
<p>
This is the main development shell and brings in all of our dependencies to
build all of our code. Taken from <a href="https://github.com/tweag/haskell-stack-nix-example/blob/b9383e35416a2b0e21fbc97ed079538f9f395b6a/shell.nix#L1">here</a>. The <code>Makefile</code> is meant to be executed
from within this environment.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><label class="org-src-name">shell.nix</label><span class="lilac-caption-link-symbol"><a href="#shell-nix">&#x1f517;</a></span></div><pre class="src src-nix" id="shell-nix"><span class="org-nix-keyword">let</span>
  <span class="org-comment"># Nixpkgs snapshot.</span>
  <span class="org-nix-attribute">sources</span> = <span class="org-nix-builtin">import</span> <span class="org-nix-constant">./package/nix/sources.nix</span>;
  <span class="org-comment"># The final "pkgs" attribute.</span>
  <span class="org-nix-attribute">pkgs</span> = <span class="org-nix-builtin">import</span> sources.nixpkgs {};
<span class="org-nix-keyword">in</span>

<span class="org-comment-delimiter"># </span><span class="org-comment">This is our development shell.</span>
pkgs.mkShell ({
  <span class="org-nix-attribute">buildInputs</span> = [
    <span class="org-comment"># Tangling and weaving for Literate Programming.</span>
    pkgs.emacs

    <span class="org-comment"># Update Nix dependencies in package/nix/sources.nix.</span>
    pkgs.niv

    <span class="org-comment"># Misc.</span>
    pkgs.git
    pkgs.less
  ];
})
</pre></div></div>
</div>
</div>

<div id="outline-container-h-Tests" class="outline-2">
<h2 id="h-Tests"><span class="section-number-2">8.</span> Tests</h2>
<div class="outline-text-2" id="text-h-Tests">
<p>
We use <a href="https://www.gnu.org/software/emacs/manual/ert.html">ERT, the Emacs Lisp Regression Testing tool</a> for our unit tests. Pure
functions that take all of their inputs explicitly ("dependency-injected") are
easy to test because we just provide the various inputs and expect the function
to produce certain outputs. For functions that operate on an Emacs buffer, we
use <code>with-temp-buffer</code> to create a temporary buffer first before invoking the
functions under test.
</p>

<p>
Some functions we test expect Org mode to be active (so that certain Org mode
functions are available), so we turn it on here by calling <code>(org-mode)</code>.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><label class="org-src-name">lilac-tests.el</label><span class="lilac-caption-link-symbol"><a href="#lilac-tests-el">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="lilac-tests-el">(<span class="org-keyword">require</span> '<span class="org-constant">ert</span>)
(<span class="org-keyword">require</span> '<span class="org-constant">lilac</span>)

(org-mode)

<span class="lilac-child-link-from-parent"><a href="#__NREF__t-helpers">t-helpers</a></span>
<span class="lilac-child-link-from-parent"><a href="#__NREF__t-smart-caption-generation-1">t-smart-caption-generation</a></span>

(<span class="org-keyword">provide</span> '<span class="org-constant">lilac-tests</span>)
</pre></div></div>
</div>

<div id="outline-container-h-Test-helpers" class="outline-3">
<h3 id="h-Test-helpers"><span class="section-number-3">8.1.</span> Test helpers</h3>
<div class="outline-text-3" id="text-h-Test-helpers">
<p>
Note that we cannot write <code>__NREF__foo</code> directly in the test code here, because
when this Org file is tangled, the references will be detected and Org mode will
try to replace them with a monoblock or polyblock elsewhere in this file named
<code>__NREF__foo</code>. So we have to go in "stealth mode" by writing the <code>__NREF__</code>
prefix indirectly with the <code>(nref)</code> helper function.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#lilac-tests-el">t-helpers</a></span><span class="lilac-caption-link-symbol"><a href="#__NREF__t-helpers">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__t-helpers">(<span class="org-keyword">defun</span> <span class="org-function-name">nref</span> (s) (concat <span class="org-string">"__NREF__"</span> s))
</pre></div></div>
</div>
</div>
