lilac-tests.el
(require 'ert)
(require 'lilac)

(defun nref (s) (concat "__NREF__" s))
