README.html

<div id="outline-container-h-Smart-source-code-block-caption-helpers" class="outline-3">
<h3 id="h-Smart-source-code-block-caption-helpers"><span class="section-number-3">8.2.</span> Smart source code block caption helpers</h3>
<div class="outline-text-3" id="text-h-Smart-source-code-block-caption-helpers">
<p>
<code>lilac-get-noweb-children</code> should return a list of Noweb references (child block
names) found in a source code block.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#lilac-tests-el">t-smart-caption-generation</a></span>(1/6) <span class="lilac-caption-link-symbol"><a href="#__NREF__t-smart-caption-generation-1">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__t-smart-caption-generation-1">(<span class="org-keyword">ert-deftest</span> <span class="org-function-name">t-lilac-get-noweb-children</span> ()
  (<span class="org-keyword">let</span> ((body
         (concat
          <span class="org-string">"#+name: foo\n"</span>
          <span class="org-string">"#+caption: foo\n"</span>
          <span class="org-string">"#+begin_src emacs-lisp\n"</span>
          <span class="org-string">"; foo\n"</span>
          <span class="org-string">"#+end_src\n"</span>)))
    (<span class="org-keyword">should</span> (equal (lilac-get-noweb-children body)
                   ())))
  (<span class="org-keyword">let</span> ((body
         (concat
          <span class="org-string">"#+name: parent\n"</span>
          <span class="org-string">"#+caption: parent\n"</span>
          <span class="org-string">"#+begin_src emacs-lisp\n"</span>
          <span class="org-string">"; foo\n"</span>
          (nref <span class="org-string">"one"</span>) <span class="org-string">"\n"</span>
          <span class="org-string">"; bar\n"</span>
          (nref <span class="org-string">"two"</span>) <span class="org-string">"\n"</span>
          <span class="org-string">"#+end_src\n"</span>)))
    (<span class="org-keyword">should</span> (equal (lilac-get-noweb-children body)
                   `(,(nref <span class="org-string">"one"</span>) ,(nref <span class="org-string">"two"</span>))))))
</pre></div></div><p>
<code>lilac-is-parent-block</code> depends on <code>lilac-get-noweb-children</code>. We tested the
latter already above, but we test the former anyway for completeness.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#lilac-tests-el">t-smart-caption-generation</a></span>(2/6) <span class="lilac-caption-link-symbol"><a href="#__NREF__t-smart-caption-generation-2">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__t-smart-caption-generation-2">(<span class="org-keyword">ert-deftest</span> <span class="org-function-name">t-lilac-is-parent-block</span> ()
  (<span class="org-keyword">with-temp-buffer</span>
    (insert <span class="org-string">"#+name: parent\n"</span>)
    (insert <span class="org-string">"#+caption: parent\n"</span>)
    (insert <span class="org-string">"#+begin_src emacs-lisp\n"</span>)
    (insert <span class="org-string">"; foo\n"</span>)
    (insert (concat (nref <span class="org-string">"child"</span>) <span class="org-string">"\n"</span>))
    (insert <span class="org-string">"#+end_src\n"</span>)
    (goto-char (point-min))
    (<span class="org-keyword">let</span> ((src-block (org-element-at-point)))
      (<span class="org-keyword">should-not</span> (equal nil (lilac-is-parent-block src-block))))))
</pre></div></div><p>
Here we test whether we can automatically insert captions for child blocks.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#lilac-tests-el">t-smart-caption-generation</a></span>(3/6) <span class="lilac-caption-link-symbol"><a href="#__NREF__t-smart-caption-generation-3">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__t-smart-caption-generation-3">(<span class="org-keyword">ert-deftest</span> <span class="org-function-name">t-lilac-insert-noweb-source-code-block-captions</span> ()
  (<span class="org-keyword">with-temp-buffer</span>
    (insert <span class="org-string">"#+name: parent\n"</span>)
    (insert <span class="org-string">"#+caption: parent\n"</span>)
    (insert <span class="org-string">"#+begin_src emacs-lisp\n"</span>)
    (insert <span class="org-string">"; foo\n"</span>)
    (insert (concat (nref <span class="org-string">"child1"</span>) <span class="org-string">"\n"</span>))
    (insert (concat (nref <span class="org-string">"child2"</span>) <span class="org-string">"\n"</span>))
    (insert <span class="org-string">"#+end_src\n"</span>)
    (insert <span class="org-string">"\n"</span>)
    (insert (concat <span class="org-string">"#+name: "</span> (nref <span class="org-string">"child1"</span>) <span class="org-string">"\n"</span>))
    (insert <span class="org-string">"#+begin_src emacs-lisp\n"</span>)
    (insert <span class="org-string">"; bar\n"</span>)
    (insert <span class="org-string">"#+end_src\n"</span>)
    (insert <span class="org-string">"\n"</span>)
    (insert (concat <span class="org-string">"#+name: "</span> (nref <span class="org-string">"child2"</span>) <span class="org-string">"\n"</span>))
    (insert <span class="org-string">"#+begin_src emacs-lisp\n"</span>)
    (insert <span class="org-string">"; baz\n"</span>)
    (insert <span class="org-string">"#+end_src\n"</span>)
    (lilac-insert-noweb-source-code-block-captions nil)
    (goto-char (point-min))
    (<span class="org-keyword">should</span> (search-forward
             (concat <span class="org-string">"#+caption: ="</span> (nref <span class="org-string">"child1"</span>) <span class="org-string">"=  [[parent][1]]"</span>)
             nil t))
    (<span class="org-keyword">should</span> (search-forward
             (concat <span class="org-string">"#+caption: ="</span> (nref <span class="org-string">"child2"</span>) <span class="org-string">"=  [[parent][1]]"</span>)
             nil t)))
  (<span class="org-keyword">with-temp-buffer</span>
    (insert <span class="org-string">"#+name: parent1\n"</span>)
    (insert <span class="org-string">"#+caption: parent1\n"</span>)
    (insert <span class="org-string">"#+begin_src emacs-lisp\n"</span>)
    (insert <span class="org-string">"; foo\n"</span>)
    (insert (concat (nref <span class="org-string">"child1"</span>) <span class="org-string">"\n"</span>))
    (insert (concat (nref <span class="org-string">"child2"</span>) <span class="org-string">"\n"</span>))
    (insert <span class="org-string">"#+end_src\n"</span>)
    (insert <span class="org-string">"\n"</span>)
    (insert (concat <span class="org-string">"#+name: "</span> (nref <span class="org-string">"child1"</span>) <span class="org-string">"\n"</span>))
    (insert <span class="org-string">"#+begin_src emacs-lisp\n"</span>)
    (insert <span class="org-string">"; bar\n"</span>)
    (insert <span class="org-string">"#+end_src\n"</span>)
    (insert <span class="org-string">"\n"</span>)
    (insert (concat <span class="org-string">"#+name: "</span> (nref <span class="org-string">"child2"</span>) <span class="org-string">"\n"</span>))
    (insert <span class="org-string">"#+begin_src emacs-lisp\n"</span>)
    (insert <span class="org-string">"; baz\n"</span>)
    (insert <span class="org-string">"#+end_src\n"</span>)
    (insert <span class="org-string">"\n"</span>)
    (insert (concat <span class="org-string">"#+name: parent2\n"</span>))
    (insert <span class="org-string">"#+caption: parent2\n"</span>)
    (insert <span class="org-string">"#+begin_src emacs-lisp\n"</span>)
    (insert <span class="org-string">"; foo\n"</span>)
    (insert (concat (nref <span class="org-string">"child1"</span>) <span class="org-string">"\n"</span>))
    (insert <span class="org-string">"#+end_src\n"</span>)
    (lilac-insert-noweb-source-code-block-captions nil)
    (goto-char (point-min))
    (<span class="org-keyword">should</span> (search-forward
             (concat <span class="org-string">"#+caption: ="</span> (nref <span class="org-string">"child1"</span>) <span class="org-string">"=  [[parent1][1]]  [[parent2][2]]"</span>)
             nil t))
    (<span class="org-keyword">should</span> (search-forward
             (concat <span class="org-string">"#+caption: ="</span> (nref <span class="org-string">"child2"</span>) <span class="org-string">"=  [[parent1][1]]"</span>)
             nil t))))
</pre></div></div><p>
Here we test retrieval of parent source code blocks.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#lilac-tests-el">t-smart-caption-generation</a></span>(4/6) <span class="lilac-caption-link-symbol"><a href="#__NREF__t-smart-caption-generation-4">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__t-smart-caption-generation-4">(<span class="org-keyword">ert-deftest</span> <span class="org-function-name">t-lilac-get-parent-blocks</span> ()
  (<span class="org-keyword">with-temp-buffer</span>
    (insert <span class="org-string">"#+name: foo\n"</span>)
    (insert <span class="org-string">"#+caption: foo\n"</span>)
    (insert <span class="org-string">"#+begin_src emacs-lisp\n"</span>)
    (insert <span class="org-string">"; foo\n"</span>)
    (insert <span class="org-string">"#+end_src\n"</span>)
    (insert <span class="org-string">"\n"</span>)
    (insert <span class="org-string">"#+name: bar\n"</span>)
    (insert <span class="org-string">"#+caption: bar\n"</span>)
    (insert <span class="org-string">"#+begin_src emacs-lisp\n"</span>)
    (insert <span class="org-string">"; bar\n"</span>)
    (insert <span class="org-string">"#+end_src\n"</span>)
    (<span class="org-keyword">should-not</span> (lilac-get-parent-blocks)))
  (<span class="org-keyword">with-temp-buffer</span>
    (insert <span class="org-string">"#+name: parent1\n"</span>)
    (insert <span class="org-string">"#+caption: parent1\n"</span>)
    (insert <span class="org-string">"#+begin_src emacs-lisp\n"</span>)
    (insert <span class="org-string">"; foo\n"</span>)
    (insert (concat (nref <span class="org-string">"child1"</span>) <span class="org-string">"\n"</span>))
    (insert <span class="org-string">"#+end_src\n"</span>)
    (insert <span class="org-string">"\n"</span>)
    (insert <span class="org-string">"#+name: parent2\n"</span>)
    (insert <span class="org-string">"#+caption: parent2\n"</span>)
    (insert <span class="org-string">"#+begin_src emacs-lisp\n"</span>)
    (insert <span class="org-string">"; bar\n"</span>)
    (insert (concat (nref <span class="org-string">"child2"</span>) <span class="org-string">"\n"</span>))
    (insert <span class="org-string">"#+end_src\n"</span>)
    (<span class="org-keyword">should</span> (lilac-get-parent-blocks))))
</pre></div></div><p>
Here we test generating the child-to-parents hash table.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#lilac-tests-el">t-smart-caption-generation</a></span>(5/6) <span class="lilac-caption-link-symbol"><a href="#__NREF__t-smart-caption-generation-5">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__t-smart-caption-generation-5">(<span class="org-keyword">ert-deftest</span> <span class="org-function-name">t-lilac-mk-child-parents-hash-table</span> ()
  (<span class="org-keyword">with-temp-buffer</span>
    (insert <span class="org-string">"#+name: foo\n"</span>)
    (insert <span class="org-string">"#+caption: foo\n"</span>)
    (insert <span class="org-string">"#+begin_src emacs-lisp\n"</span>)
    (insert <span class="org-string">"; foo\n"</span>)
    (insert <span class="org-string">"#+end_src\n"</span>)
    (insert <span class="org-string">"\n"</span>)
    (insert <span class="org-string">"#+name: bar\n"</span>)
    (insert <span class="org-string">"#+caption: bar\n"</span>)
    (insert <span class="org-string">"#+begin_src emacs-lisp\n"</span>)
    (insert <span class="org-string">"; bar\n"</span>)
    (insert <span class="org-string">"#+end_src\n"</span>)
    (<span class="org-keyword">let*</span> ((parent-blocks (lilac-get-parent-blocks))
           (child-parents-hash-table
             (lilac-mk-child-parents-hash-table parent-blocks)))
      (<span class="org-keyword">should</span> (equal (hash-table-count child-parents-hash-table) 0))))
  (<span class="org-keyword">with-temp-buffer</span>
    (insert <span class="org-string">"#+name: parent1\n"</span>)
    (insert <span class="org-string">"#+caption: parent1\n"</span>)
    (insert <span class="org-string">"#+begin_src emacs-lisp\n"</span>)
    (insert <span class="org-string">"; foo\n"</span>)
    (insert (concat (nref <span class="org-string">"child1"</span>) <span class="org-string">"\n"</span>))
    (insert <span class="org-string">"#+end_src\n"</span>)
    (insert <span class="org-string">"\n"</span>)
    (insert <span class="org-string">"#+name: parent2\n"</span>)
    (insert <span class="org-string">"#+caption: parent2\n"</span>)
    (insert <span class="org-string">"#+begin_src emacs-lisp\n"</span>)
    (insert <span class="org-string">"; bar\n"</span>)
    (insert (concat (nref <span class="org-string">"child2"</span>) <span class="org-string">"\n"</span>))
    (insert <span class="org-string">"#+end_src\n"</span>)
    (<span class="org-keyword">let*</span> ((parent-blocks (lilac-get-parent-blocks))
           (child-parents-hash-table
             (lilac-mk-child-parents-hash-table parent-blocks)))
      (<span class="org-keyword">should</span> (equal (hash-table-count child-parents-hash-table) 2)))))
</pre></div></div><p>
Here we test the construction of smart captions.
</p>

<div class="org-src-container"><div class="lilac-pre-with-caption"><div class="lilac-caption"><span class="lilac-caption-parent-link"><a href="#lilac-tests-el">t-smart-caption-generation</a></span>(6/6) <span class="lilac-caption-link-symbol"><a href="#__NREF__t-smart-caption-generation-6">&#x1f517;</a></span></div><pre class="src src-emacs-lisp" id="__NREF__t-smart-caption-generation-6">(<span class="org-keyword">ert-deftest</span> <span class="org-function-name">t-lilac-mk-smart-captions</span> ()
  (<span class="org-keyword">with-temp-buffer</span>
    (insert <span class="org-string">"#+name: parent1\n"</span>)
    (insert <span class="org-string">"#+caption: parent1\n"</span>)
    (insert <span class="org-string">"#+begin_src emacs-lisp\n"</span>)
    (insert <span class="org-string">"; foo\n"</span>)
    (insert (concat (nref <span class="org-string">"child1"</span>) <span class="org-string">"\n"</span>))
    (insert <span class="org-string">"#+end_src\n"</span>)
    (insert <span class="org-string">"\n"</span>)
    (insert <span class="org-string">"#+name: parent2\n"</span>)
    (insert <span class="org-string">"#+caption: parent2\n"</span>)
    (insert <span class="org-string">"#+begin_src emacs-lisp\n"</span>)
    (insert <span class="org-string">"; bar\n"</span>)
    (insert (concat (nref <span class="org-string">"child2"</span>) <span class="org-string">"\n"</span>))
    (insert <span class="org-string">"#+end_src\n"</span>)
    (<span class="org-keyword">let*</span> ((parent-blocks (lilac-get-parent-blocks))
           (child-parents-hash-table
             (lilac-mk-child-parents-hash-table parent-blocks))
           (smart-captions (lilac-mk-smart-captions
                            child-parents-hash-table)))
      (<span class="org-keyword">should</span> (equal smart-captions nil))))
  (<span class="org-keyword">with-temp-buffer</span>
    (insert <span class="org-string">"#+name: parent1\n"</span>)
    (insert <span class="org-string">"#+caption: parent1\n"</span>)
    (insert <span class="org-string">"#+begin_src emacs-lisp\n"</span>)
    (insert <span class="org-string">"; foo\n"</span>)
    (insert (concat (nref <span class="org-string">"child1"</span>) <span class="org-string">"\n"</span>))
    (insert <span class="org-string">"#+end_src\n"</span>)
    (insert <span class="org-string">"\n"</span>)
    (insert <span class="org-string">"#+name: parent2\n"</span>)
    (insert <span class="org-string">"#+caption: parent2\n"</span>)
    (insert <span class="org-string">"#+begin_src emacs-lisp\n"</span>)
    (insert <span class="org-string">"; bar\n"</span>)
    (insert (concat (nref <span class="org-string">"child1"</span>) <span class="org-string">"\n"</span>))
    (insert <span class="org-string">"#+end_src\n"</span>)
    (insert <span class="org-string">"\n"</span>)
    (insert (concat <span class="org-string">"#+name: "</span> (nref <span class="org-string">"child1"</span>) <span class="org-string">"\n"</span>))
    (insert <span class="org-string">"#+begin_src emacs-lisp\n"</span>)
    (insert <span class="org-string">"; child1\n"</span>)
    (insert <span class="org-string">"#+end_src\n"</span>)
    (<span class="org-keyword">let*</span> ((parent-blocks (lilac-get-parent-blocks))
           (child-parents-hash-table
             (lilac-mk-child-parents-hash-table parent-blocks))
           (smart-captions (lilac-mk-smart-captions
                            child-parents-hash-table)))
      (<span class="org-keyword">should</span> (equal smart-captions
       `((181 . ,(concat <span class="org-string">"#+caption: ="</span>
                         (nref <span class="org-string">"child1"</span>)
                         <span class="org-string">"=  [[parent1][1]]  [[parent2][2]]\n"</span>)))))))
  (<span class="org-keyword">with-temp-buffer</span>
    (insert <span class="org-string">"#+name: parent1\n"</span>)
    (insert <span class="org-string">"#+caption: parent1\n"</span>)
    (insert <span class="org-string">"#+begin_src emacs-lisp\n"</span>)
    (insert <span class="org-string">"; foo\n"</span>)
    (insert (concat (nref <span class="org-string">"child1"</span>) <span class="org-string">"\n"</span>))
    (insert <span class="org-string">"#+end_src\n"</span>)
    (insert <span class="org-string">"\n"</span>)
    (insert <span class="org-string">"#+name: parent2\n"</span>)
    (insert <span class="org-string">"#+caption: parent2\n"</span>)
    (insert <span class="org-string">"#+begin_src emacs-lisp\n"</span>)
    (insert <span class="org-string">"; bar\n"</span>)
    (insert (concat (nref <span class="org-string">"child2"</span>) <span class="org-string">"\n"</span>))
    (insert <span class="org-string">"#+end_src\n"</span>)
    (insert <span class="org-string">"\n"</span>)
    (insert (concat <span class="org-string">"#+name: "</span> (nref <span class="org-string">"child1"</span>) <span class="org-string">"\n"</span>))
    (insert <span class="org-string">"#+begin_src emacs-lisp\n"</span>)
    (insert <span class="org-string">"; child1\n"</span>)
    (insert <span class="org-string">"#+end_src\n"</span>)
    (insert <span class="org-string">"\n"</span>)
    (insert (concat <span class="org-string">"#+name: "</span> (nref <span class="org-string">"child2"</span>) <span class="org-string">"\n"</span>))
    (insert <span class="org-string">"#+begin_src emacs-lisp\n"</span>)
    (insert <span class="org-string">"; child2\n"</span>)
    (insert <span class="org-string">"#+end_src\n"</span>)
    (<span class="org-keyword">let*</span> ((parent-blocks (lilac-get-parent-blocks))
           (child-parents-hash-table
             (lilac-mk-child-parents-hash-table parent-blocks))
           (smart-captions (lilac-mk-smart-captions
                            child-parents-hash-table)))
      (<span class="org-keyword">should</span> (equal smart-captions
       `((181 . ,(concat <span class="org-string">"#+caption: ="</span>
                         (nref <span class="org-string">"child1"</span>)
                         <span class="org-string">"=  [[parent1][1]]\n"</span>))
         (247 . ,(concat <span class="org-string">"#+caption: ="</span>
                         (nref <span class="org-string">"child2"</span>)
                         <span class="org-string">"=  [[parent2][1]]\n"</span>)))))))
  (<span class="org-keyword">with-temp-buffer</span>
    (insert <span class="org-string">"#+name: parent1\n"</span>)
    (insert <span class="org-string">"#+caption: parent1\n"</span>)
    (insert <span class="org-string">"#+begin_src emacs-lisp\n"</span>)
    (insert <span class="org-string">"; foo\n"</span>)
    (insert (concat (nref <span class="org-string">"child1"</span>) <span class="org-string">"\n"</span>))
    (insert <span class="org-string">"#+end_src\n"</span>)
    (insert <span class="org-string">"\n"</span>)
    (insert (concat <span class="org-string">"#+name: "</span> (nref <span class="org-string">"child1"</span>) <span class="org-string">"\n"</span>))
    (insert <span class="org-string">"#+begin_src emacs-lisp\n"</span>)
    (insert <span class="org-string">"; child1\n"</span>)
    (insert (concat (nref <span class="org-string">"child2"</span>) <span class="org-string">"\n"</span>))
    (insert <span class="org-string">"#+end_src\n"</span>)
    (insert <span class="org-string">"\n"</span>)
    (insert (concat <span class="org-string">"#+name: "</span> (nref <span class="org-string">"child2"</span>) <span class="org-string">"\n"</span>))
    (insert <span class="org-string">"#+begin_src emacs-lisp\n"</span>)
    (insert <span class="org-string">"; child2\n"</span>)
    (insert <span class="org-string">"#+end_src\n"</span>)
    (<span class="org-keyword">let*</span> ((parent-blocks (lilac-get-parent-blocks))
           (child-parents-hash-table
             (lilac-mk-child-parents-hash-table parent-blocks))
           (smart-captions (lilac-mk-smart-captions
                            child-parents-hash-table)))
      (<span class="org-keyword">should</span> (equal smart-captions
       `((91 . ,(concat <span class="org-string">"#+caption: ="</span>
                         (nref <span class="org-string">"child1"</span>)
                         <span class="org-string">"=  [[parent1][1]]\n"</span>))
         (172 . ,(concat <span class="org-string">"#+caption: ="</span>
                         (nref <span class="org-string">"child2"</span>)
                         <span class="org-string">"=  [["</span>
                         (nref <span class="org-string">"child1"</span>)
                         <span class="org-string">"][1]]\n"</span>))))))))
</pre></div></div>
</div>
</div>
</div>
